<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>schol.io | GDPR</title>




    <!--====== CSS  Styles =======-->
    @include('public.styles')


    <!-- Profile  CSS -->
    <link href="/new/css/terms.css" rel="stylesheet">


    <!-- jQuery js-->
    <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/2.2.4/jquery.min.js"></script>

    <!-- Bootstrap js-->
    <script src="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.7/js/bootstrap.min.js"></script>

    <!-- Bootstrap Select js  -->
    <script src="https://cdnjs.cloudflare.com/ajax/libs/bootstrap-select/1.6.4/js/bootstrap-select.min.js"></script>


    <style>
        body {
            background-color: #F1F4F5;
        }
        h1{font-size: 170%; font-weight: 400; color: #667; margin-top: 50px;}
        h2{font-size: 150%; font-weight: 400; color: #667; margin-top: 40px;}
        h3{font-size: 130%; font-weight: 300; color: #778; margin-top: 25px;}
        h5{font-size: 115%; font-weight: 300; color: #997; margin-top: 25px;}
        .dropdown-menu{background-color: #eee; padding-top: 20px}
        .mainBody{min-height: 1100px;}
        .outerBox{min-height: 800px; background: #fafafa; border: 1px solid #ccc; border-radius: 6px; width: 80%;  margin: 120px auto 50px auto; padding: 30px;}
        .terms{color: #999; text-indent: 50px; line-height: 180%; word-spacing: 3px; text-align: justify;}

        .terms::first-letter {
            font-size: 130%;
        }


        @media( max-width: 620px){
            .outerBox{width: 90%;}
        }
        @media( max-width: 560px){
            .outerBox{width: 98%;}
        }
    </style>

</head>
<body>



<header class="spy navbar navbar-fixed-top navbar-scroll sc-landing-header " id="header" style="z-index: 2">

    <div class="container" style="">
        <div class="row scholarship-profile-nav-row">

            <div class="pull-left visible-lg visible-md nav-web ">
                <!-- Scholio Branding -->
                <a class="sc-landing-brand" href="{{ url('/') }}">
                    <div class="sc-landing-logo-sticky" style=" padding-top: 15px">
                        <img src="{{asset('new/img/logoNX.png')}}"  class="sc-logo" alt="scholio logo" style="height: 63px; padding-top: 2px;">
                    </div>
                </a>
            </div>

            <div class="col-xs-6  visible-sm visible-xs">
                <div class="nav-mobile">
                    <a class="" href="{{ url('/') }}">
                        <div class="navbar-brand  sc-landing-logo-sticky">
                            <img src="{{asset('new/img/logoNX-m.png')}}" class="sc-logo" alt="scholio logo" style="height: 60px; padding-top: 2px;">
                        </div>
                    </a>
                </div>
            </div>
            <!-- Scholio sMenu -->

            <!-- Large Menu -->
            <div class="pull-right visible-md visible-lg" >
                <ul class="nav navbar-nav navbar-right sc-landing-menu" >

                    <li class="" style="margin-top: 16px">
                        <form method="GET" id="langForm">
                            <select onchange="changeLang(this)" class="selectpicker" data-live-search="false" data-mobile="false" data-size='2' data-width="100%" data-style="btn-white">
                                <option style="color: black" data-icon="fa" value="en" {{ request()->cookie('lang')=='en' ? 'selected':'' }}>&nbsp; ENG</option>
                                <option style="color: black" data-icon="fa" value="el" {{ request()->cookie('lang')=='el' ? 'selected':'' }}>&nbsp; GR</option>
                            </select>
                        </form>
                    </li>

                    <li class="sc-landing-menu-item">
                        <a href="{{url('public/scholarships')}}" class="btn-change-search">
                            <i class="fa fa-trophy margin-right-5"></i>
                            @lang('schools.navigation.search_scholarship')
                        </a>
                    </li>
                    <li class="sc-landing-menu-item" style="margin-right: -12px">
                        <a href="{{url('public/schools')}}" class="btn-change-search">
                            <i class="fa fa-university margin-right-5"></i>
                            @lang('scholarships.search_institution')
                        </a>
                    </li>


                    @if(auth()->check())
                        <li><a href="{{ url('/dashboard') }}"><button type="button" class="sc-button-landing sc-button sc-orange sc-t-white" style="margin-right: -12px">@lang('main.navigation.admin')</button></a></li>
                        <li><a href="{{ url('/out') }}"><button type="button" class="sc-button-landing sc-button sc-dark-green sc-t-white ">@lang('main.navigation.logout')</button></a></li>
                    @else
                        <li><a href="{{ url('/register/role') }}"><button type="button" class="sc-button-landing sc-button sc-green sc-t-white" style="margin-right: -12px">@lang('main.navigation.register')</button></a></li>
                        <li><a href="{{ url('/login') }}"><button type="button" class="sc-button-landing sc-button sc-dark-green sc-t-white">@lang('main.navigation.login')</button></a></li>
                    @endif
                </ul>
            </div>


            <!-- Mobile Menu -->
            <div class="col-xs-6 visible-sm visible-xs " style="z-index: 6000; height: 20px;">
                <div class="">
                    <div class="sc-landing-menu-mobile-sandwitch nav navbar-nav navbar-right pull-right">
                        <div class="sc-landing-menu-sandwitch-button-sticky sc-landing-menu-sandwitch">
                            <img src="{{asset('new/img/collapse-dark2.png')}}" alt="scholio logo"  style="height:22px; margin-top: 7px;">
                            {{--<img src="{{asset('new/img/collapse-dark.png')}}" alt="scholio logo">--}}
                        </div>
                    </div>
                </div>

            </div>

            <!-- ======= Sandwich Menu =======-->
            @include('public.sandwich-menu-scholarshipProfile')

        </div>  <!-- row -->
    </div><!-- container-->


</header>

<div class="container mainBody">
    <div class="outerBox">

        <h1>Πολιτική Προστασίας Προσωπικών Δεδομένων</h1>

        <h2>Εισαγωγή</h2>
        <p class="terms">Η χρήση της πλατφόρμας Schol.io γίνεται με αποκλειστική ευθύνη του επισκέπτη–χρήστη. Οι παρακάτω όροι πολιτικής προστασίας προσωπικών δεδομένων αφορούν τόσο στη χρήση της πλατφόρμας Schol.io από απλό επισκέπτη όσο και από εγγεγραμμένο χρήστη.
            Χρήση της πλατφόρμας μας και εγγραφή σε αυτή, συνεπάγεται ανεπιφύλακτη αποδοχή, συγκατάθεση, συναίνεση, έγκριση και συμφωνία από τον επισκέπτη-χρήστη με τους όρους χρήσεως και την πολιτική προστασίας προσωπικών δεδομένων που ακολουθούμε,
            σύμφωνα με τους όρους και τις αρχές του Γενικού Κανονισμού 2016/679 για την Προστασία Δεδομένων (General Data Protection Regulation). Στην περίπτωση που δεν τους αποδέχεστε ανεπιφύλακτα και στο σύνολό τους και δεν συναινείτε με αυτούς, οφείλετε να μην προχωρήσετε στην οποιαδήποτε χρήση της πλατφόρμας Schol.io,
            στην οποιασδήποτε από τις υπηρεσίες της ή των στοιχείων του περιεχομένου της και να εξέλθετε άμεσα από αυτήν.

            Η παρούσα Πολιτική Προστασίας Προσωπικών Δεδομένων έχει ισχύ μόνο για την πλατφόρμα Schol.io. Οι χρήστες – επισκέπτες πρέπει να λαμβάνουν υπόψη ότι η πλατφόρμα μας περιέχει συνδέσμους και προς άλλους δικτυακούς τόπους εκπαιδευτικών ιδρυμάτων, αλλά το schol.io δεν φέρει κανενός είδους ευθύνη
            για τις πρακτικές και όρους πολιτικής προστασίας προσωπικών δεδομένων ή το περιεχόμενο των εν λόγω δικτυακών τόπων και άρα οι χρήστες – επισκέπτες εισέρχονται σε αυτούς αποκλειστικώς με δική τους ευθύνη.

            Το schol.io δύναται οιαδήποτε χρονική στιγμή να τροποποιεί τους όρους χρήσεως, εφόσον είναι πλήρως εναρμονισμένοι με τους όρους του Γενικού Κανονισμού 2016/679 για τη Προστασία Δεδομένων και όλες τις προϋποθέσεις που περιλαμβάνουν κατά την απόλυτη διακριτική μας ευχέρεια και όλως αναιτιολογήτως,
            δημοσιεύοντας μια αναθεωρημένη έκδοση αυτών στην πλατφόρμα μας, οι δε χρήστες - επισκέπτες οφείλουν κάθε φορά να ελέγχουν για ενδεχόμενες αλλαγές και, εφόσον εξακολουθούν τη χρήση και δεν εξέρχονται άμεσα από την ιστοσελίδα, τεκμαίρεται αμάχητα ότι συναινούν και αποδέχονται ανεπιφυλάκτως τους τροποποιημένους όρους
            και προϋποθέσεις και ότι δίδουν τη συναίνεση, συγκατάθεση, συμφωνία και έγκρισή τους. Σε αντίθετη περίπτωση οφείλουν να απέχουν από τη χρήση - επίσκεψη του δικτυακού μας τόπου και από τη χρήση των υπηρεσιών που προσφέρει και να απέχουν από οποιαδήποτε πρόσβαση σε αυτόν και στο οποιοδήποτε περιεχόμενό του.
            Η αναθεωρημένη έκδοση θα ισχύει από τη στιγμή της ανάρτησής της στον δικτυακό τόπο του schol.io χωρίς να είναι αναγκαία οποιαδήποτε άλλη ενέργεια ως προϋπόθεση ισχύος αυτής.
        </p>


        <h2>Προσωπικά δεδομένα που συλλέγουμε</h2>

        <h3>Ποιές προσωπικές πληροφορίες συλλέγουμε</h3>
        <p class="terms">Γενικά, οι προσωπικές πληροφορίες που συλλέγουμε μας επιτρέπουν να επεξεργαστούμε το αίτημα αναζήτησής σας και να παρέχουμε τις υπηρεσίες του schol.io σε εσάς. Συλλέγουμε τις προσωπικές πληροφορίες που υποβάλλετε σε εμάς με τη θέλησή σας κατά την εγγραφή σας σε εμάς.
        </p>

        <h3>Εγγραφή</h3>
        <p class="terms">Κατά την εγγραφή σας στο schol.io για να χρησιμοποιήσετε την υπηρεσία θα σας ζητηθεί να συμπληρώσετε μια ηλεκτρονική φόρμα με: την ιδιότητα χρήσης της πλατφόρμας (Μαθητής, Καθηγητής, Γονέας), το όνοματεπώνυμο σας, τη διεύθυνση του ηλεκτρονικού ταχυδρομείου σας και έναν προσωπικό κωδικό εισαγωγής.
            Οι πληροφορίες δεν θα επαναχρησιμοποιηθούν για σκοπό ασυμβίβαστο με το πεδίο εφαρμογής της υπηρεσίας μας, όπως περιγράφεται στους όρους και τις προϋποθέσεις.
        </p>


        <h3>Λογαριασμός Χρήστη</h3>
        <p class="terms">Είστε υπεύθυνοι για τη διατήρηση της εμπιστευτικότητας του κωδικού πρόσβασης του λογαριασμού σας και είστε πλήρως υπεύθυνος για όλες τις δραστηριότητες που λαμβάνουν χώρα στο λογαριασμό σας.
            Για την αίτηση σε μία υποτροφία συλλέγουμε προσωπικές πληροφορίες που προηγουμένως το κάθε εκπαιδευτικό ίδρυμα έχει απαιτήσει να συμπληρώσει ο κάθε υποψήφιος (ή ο γονέας του), για τη συμμετοχή του στις υποτροφίες του εκπαιδευτικού ιδρύματος. Τέτοιες πληροφορίες μπορεί να είναι κάποιες από τις επόμενες ανάλογα πάντα
            με τις απαιτήσεις του εκάστοτε Εκπαιδευτικού Ιδρύματος: διεύθυνση διαμονής,τηλέφωνο επικοινωνίας, Αριθμός Δελτίου Ταυτότητας, Εθνικότητα, Θρήσκευμα, ημερομηνία & τόπος γέννησης, φύλο, μέλος πολύτεκνης οικογένειας, προηγούμενο σχολείο φοίτησης και βαθμός αποφοίτησης.
            Επίσης το εκάστοτε εκπαιδευτικό ίδρυμα είναι δυνατόν να ζητήσει μέσω της αίτησης υποτροφίας, τα στοιχεία των κηδεμόνων του αιτόυμενου σπουδαστή, όπως ονοματπώνυμο, τηλέφωνο, ηλεκτρονικό ταχυδρομείο, διευθυνση διαμονής, όπως επίσης είναι δυνατόν επάγγελμα και θεση εργασίας τους, ΑΔΤ, ΑΦΜ και εισόδημα.
            Τέλος ο σπουδαστής μπορεί να συμπληρώσει προσωπικές του πληροφορίες στο ατομικό του προφίλ/βιογραφικό όπως οι ιδιαίτερες δεξιότητες του και τα ταλέντα του, οι ξενες γλώσσες ου μιλάει, οι έπαινοι και οι διακρίσεις που έχει λάβει, τα σεμινάρια που έχει παρακολουθήσει και οι πιστοποιήσεις που έχει κατακτήσει,
            πληροφορίες που μας παρέχει οικειοθελώς ο κάθε σπουδαστής με απότερο σκοπό να ενισχύσει το προσωπικό του βιογραφικό και να αυξήσει τις πιθανότητες να διεκδικήσει κάποια υποτροφία.
            Σε όλες αυτές τις πληροφορίες έχει πρόσβαση μόνο ο σπουδαστής, είναι αυστηρά κρυπτογραφημένες και φτάνουν μόνο στα εκπαιδευτικά ιδρύματα των οποίων, έχει αιτηθεί ο σπουδαστής σε κάποια υποτροφία τους. Σε κάθε άλλη περίπτωση οι σπουδαστές, τα βιογραφικά τους και οι προσωπικές τους πληροφορίες δεν είναι "ανιχνεύσιμες"
            ή προσβάσιμες σε κανέναν άλλο χρήστη ή εκπαιδευτικό ίδρυμα.
        </p>

        <p class="terms">
            Η προστασία των προσωπικών δεδομένων του χρήστη–επισκέπτη που επισκέπτεται το schol.io και κάθε είδους υπηρεσία που παρέχεται από το schol.io υπόκειται στους όρους του παρόντος, πλήρως εναρμονισμένους με τους όρους και τις αρχές του Γενικού Κανονισμού 2016/679 για την Προστασία Προσωπικών Δεδομένων (General Data Protection Regulation).
            Το schol.io μπορεί να καταγράφει και να συλλέγει αυτόματα, ενδεικτικά και όχι περιοριστικά τις ακόλουθες κατηγορίες πληροφοριών κατά την επίσκεψη του επισκέπτη-χρήστη στην ιστοσελίδα μας: (1) διευθύνσεις IP, (2) διακομιστές τομέα, (3) είδη ηλεκτρονικών υπολογιστών που έχουν πρόσβαση στην ιστοσελίδα μας,
            (4) είδη φυλλομετρητών που χρησιμοποιούνται για την πρόσβαση στην ιστοσελίδα μας, (5) αναφερόμενη πηγή ή URL το οποίο ενδεχομένως κατεύθυνε τον χρήστη στην ιστοσελίδα μας και (6) τις σελίδες και τις πληροφορίες στις οποίες είχατε πρόσβαση στην ιστοσελίδα μας. Αυτά τα δεδομένα μας βοηθούν στην κατανόηση της επισκεψιμότητας του δικτυακού μας τόπου,
            στη διάγνωση των προβλημάτων του διακομιστή, στη διαχείριση του δικτυακού μας τόπου και στην προσαρμογή και στη βελτίωση των πληροφοριών και υπηρεσιών.
            Προκειμένου να παράσχουμε στον επισκέπτη-χρήστη τις υπηρεσίες μας μπορεί να ζητηθεί από αυτόν να δώσει στο schol.io ορισμένες πληροφορίες, οι οποίες τον προσδιορίζουν προσωπικά, δηλαδή ορισμένα προσωπικά στοιχεία, στα οποία ενδεικτικά και όχι περιοριστικά περιλαμβάνονται: ονοματεπώνυμο, στοιχεία επικοινωνίας, όπως διεύθυνση, αριθμός τηλεφώνου
            και διεύθυνση ηλεκτρονικού ταχυδρομείου, δημογραφικά στοιχεία, ταχυδρομικός κώδικας, και η ημερομηνία γέννησης, η προσωπική ανάγκη για την αναζήτηση εκπαιδευτικής υπηρεσίας που ταιριάζει στα κριτήρια του χρήστη και κάθε πληροφορία και επικοινωνία που παρέχει ο χρήστης μέσω ηλεκτρονικού ταχυδρομείου ή επιστολής προς το  schol.io.
            Κατόπιν συναίνεσης του επισκέπτη-χρήστη, τo schol.io συλλέγει από τον εκάστοτε επισκέπτη-χρήστη και επεξεργάζεται τα προσωπικά δεδομένα όπως αναφέρονται ενδεικτικά παραπάνω, με μοναδικό σκοπό την καλύτερη παροχή των υπηρεσιών, και λαμβάνει όλα τα απαραίτητα τεχνικά και οργανωτικά μέτρα ασφαλείας της επεξεργασίας αυτής,
            περιλαμβανομένων μεταξύ άλλων της κρυπτογράφησης δεδομένων προσωπικού χαρακτήρα, της διασφάλισης του απορρήτου, της ακεραιότητας της διαθεσιμότητας και της αξιοπιστίας των συστημάτων επεξεργασίας (βλ. παράγραφο 9 περί πολιτική ασφαλείας προσωπικών δεδομένων).
            Διευκρινίζουμε επίσης ότι δεν απαιτούμε από τον επισκέπτη-χρήστη να παρέχει "ευαίσθητα προσωπικά δεδομένα" για να χρησιμοποιεί τις υπηρεσίες μας.
            Το schol.io συλλέγει και επεξεργάζεται προσωπικά δεδομένα του επισκέπτη-χρήστη αποκλειστικά και μόνο για την βέλτιστη παροχή των υπηρεσιών της πλατφόρμας και μόνο στο απολύτως αναγκαίο μέτρο για την αποτελεσματική εξυπηρέτηση των σκοπών αυτών.
        </p>

        <p class="terms">
            Όταν επισκέπτης–χρήστης αποστέλλει πληροφορίες προς το δικτυακό τόπο του schol.io με τη συμπλήρωση των σχετικών online φορμών ή την αποστολή email, για την εξυπηρέτηση ενός αιτήματος ή την παροχή κάποιας υπηρεσίας από τo schol.io, οι πληροφορίες πρέπει να παρέχονται ορθά και με ακρίβεια και να μην περιέχουν στοιχεία που θίγουν δικαιώματα τρίτων,
            είναι αναληθή, παραπλανητικά, συκοφαντικά, δυσφημιστικά, ή εν γένει μη νόμιμα. Οι πληροφορίες που παρέχει-συμπληρώνει ο επισκέπτης-χρήστης για την εξυπηρέτηση ενός αιτήματός υποτροφίας δύνανται να κοινοποιηθούν εν όλω ή εν μέρει μόνον κατά την απόλυτη διακριτική ευχέρεια των διαχειριστών του διαδικτυακού τόπου και
            μόνον προς το άμεσα ενδιαφερόμενο εκπαιδευτικό ίδρυμα που έχει δημιουργήσει την προς αίτηση υποτροφία  καθώς και σε οποιαδήποτε αρχή, στην οποία μπορεί να κριθεί ότι οφείλεται τέτοια κοινοποίηση βάσει των σχετικών διατάξεων ή βάσει απόφασης δικαστηρίου ή αρχής για την περίπτωση που η από τον χρήστη ή επισκέπτη χρήση
            μπορεί να θεωρηθεί ότι αντίκειται στους κανόνες χρήσης του schol.io και εν γένει στην ισχύουσα ελληνική, κοινοτική ή διεθνή εφαρμοστέα νομοθεσία. Ειδικά το τελευταίο μπορεί να κριθεί σκόπιμο σε οποιανδήποτε περίπτωση, όλως ενδεικτικώς αναφερόμενη, στην οποία ήθελε θεωρηθεί κατά τη διακριτική ευχέρεια των διαχειριστών του διαδικτυακού τόπου,
            ότι η χρήση του διαδικτυακού τόπου του schol.io από κάποιον επισκέπτη – χρήστη παραβαίνει οποιαδήποτε διάταξη νόμου ή κανονισμού ή τους κανόνες λειτουργίας του ή τους γενικούς κανόνες της καλής πίστης και των χρηστών ηθών. Σε οποιαδήποτε από αυτές τις περιπτώσεις όλες ή οποιεσδήποτε πληροφορίες του
            επισκέπτη–χρήστη αυτού καθώς και η ΙΡ διεύθυνσή του θα μπορούν να αποτελούν μέρος οποιασδήποτε έρευνας, εφόσον αυτό απαιτηθεί για την προστασία δικαιωμάτων του schol.io ή για την προστασία παραβιαζόμενων δικαιωμάτων τρίτων ή εν γένει για την παύση ή αποτροπή οποιασδήποτε παραβίασης.
            Σε περίπτωση αποστολής οιωνδήποτε στοιχείων ή πληροφοριών στην πλατφόρμα του schol.io σε οποιαδήποτε μορφή για οποιονδήποτε λόγο και με οποιονδήποτε τρόπο θα πρέπει αυτά να μην αντιβαίνουν στην εκάστοτε ισχύουσα εφαρμοστέα ελληνική, κοινοτική ή διεθνή νομοθεσία και στους γενικώς παραδεκτούς κανόνες της καλής πίστης και των χρηστών ηθών
            και εν γένει σε όλες τις σχετικές γενικές αρχές για την πρόσβαση στο διαδίκτυο, την τροφοδότηση του διαδικτύου με οποιασδήποτε μορφής υλικό και για τη χρήση του διαδικτύου εν γένει, καθώς και να μην είναι αλλοιωμένα, παραποιημένα ή διασκευασμένα από τον επισκέπτη-χρήστη που προβαίνει στην αποστολή ή δημοσίευσή τους ή από άλλους,
            καθώς και να μην είναι αναληθή ή συκοφαντικά και να μην παραβιάζουν δικαιώματα τρίτων. Τα δεδομένα αυτά ή οποιοδήποτε μέρος τους μπορούν να αρχειοθετηθούν ή να χρησιμοποιηθούν από το schol.io για την καλύτερη παροχή υπηρεσιών στη πλατφόρμα της, στα χρονικά πλαίσια που περιγράφονται ανωτέρω, χωρίς καμία αξίωση ή απαίτηση από οποιαδήποτε αιτία
            έναντι του schol.io από τον επισκέπτη–χρήστη που τα παρέχει ή εν γένει παρέχει πρόσβαση σε αυτά, αφού η ίδια η εξασφάλιση πρόσβασης στον διαδικτυακό τόπο από τους διαχειριστές του συνιστά επαρκές και πλήρες αντάλλαγμα για τη διάθεση των πληροφοριών αυτών από τον χρήστη-επισκέπτη στον διαδικτυακό τόπο.
            Κάθε επισκέπτης-χρήστης είναι απολύτως υπεύθυνος για την με οποιονδήποτε τρόπο ή μέσο και κατά πάντα χρόνο χρήση του schol.io ή οποιουδήποτε μέρους του ή οποιουδήποτε στοιχείου του περιεχομένου αυτού και μπορεί να χρησιμοποιεί τις υπηρεσίες του μόνο για νόμιμους και θεμιτούς σκοπούς.
            Δεν επιτρέπεται ουδείς επισκέπτης-χρήστης να χρησιμοποιεί το schol.io με τρόπο που θα μπορούσε να προκαλέσει οποιασδήποτε μορφής ζημία, φθορά ή βλάβη ή να καταστρέψει, να απενεργοποιήσει ή να βλάψει τους διακομιστές ή τα δίκτυά μας ή μέρος αυτών, ή με τρόπους, οι οποίοι παρεμβαίνουν ή παρακωλύουν την πρόσβαση,  χρήση και την αξιοποίηση των υπηρεσιών
            ή του περιεχομένου του schol.io ή οποιοδήποτε μέρος αυτών από οποιοδήποτε άλλο μέλος-επισκέπτη-χρήστη ή τρίτον. Απαγορεύεται στον επισκέπτη–χρήστη να προβαίνει σε οποιαδήποτε ενέργεια, πράξη ή παράλειψη, η οποία θα μπορούσε να θεωρηθεί ότι συνιστά κατάχρηση των υπηρεσιών μας ή του περιεχομένου μας, όπως όλως ενδεικτικώς προγραμματίζοντας συνάντηση με ειδικό,
            την οποία δεν τηρεί ή δεν προτίθεται να τηρήσει ή αποκτώντας πρόσβαση για σκοπούς άλλους από αυτούς για τους οποίους ευλόγως οφείλει να το πράττει. Απαγορεύεται επίσης στον επισκέπτη – χρήστη να δημιουργεί ψευδείς  λογαριασμούς με δόλιες, μη νόμιμες  ή αθέμιτες εν γένει προθέσεις, ή να συλλέγει
            ή να αποθηκεύει προσωπικά δεδομένα άλλων χρηστών με οποιονδήποτε τρόπο και για οποιονδήποτε σκοπό κατά οποιονδήποτε χρόνο ή να συνδράμει άλλους σε έναν από τους ανωτέρω σκοπούς και εν γένει να προβαίνει σε οποιαδήποτε ενέργεια παρεμφερή προς τις ανωτέρω ακόμη και μη ρητώς αναφερομένη στο παρόν.
            Το schol.io διατηρεί το δικαίωμα να προβάλει κάθε εκ του νόμου ή από τους παρόντες όρους αξίωση, όπως όλως ενδεικτικώς την πλήρη αποζημίωση και ικανοποίησή του για κάθε ζημία του, θετική και αποθετική, περιλαμβανομένων ευλόγων δικαστικών εξόδων και αμοιβών, από την έστω και εξ ελαφράς αμελείας παραβίαση οποιασδήποτε εφαρμοστέας νομοθεσίας, εθνικής,
            ευρωπαϊκής ή διεθνούς, ή οποιασδήποτε των άνω απαγορεύσεων από τον επισκέπτη–χρήστη ή/και οποιονδήποτε τρίτον, ο οποίος τον συνέδραμε σχετικώς, και επίσης να προβεί σε οποιαδήποτε σχετική εξώδικη ή δικαστική νομική ενέργεια ή διαδικασία, όπως ενδεικτικώς σε λήψη νόμιμων διορθωτικών ή ρυθμιστικών εξώδικων ή δικαστικών μέτρων με στόχο την αποτροπή παραβίασης
            των παρόντων όρων και την αποκατάσταση της ζημίας του.
        </p>

        <p class="terms">
            To schol.io διατηρεί το δικαίωμα κατά την απόλυτη διακριτική του ευχέρεια στο πλαίσιο της καλύτερης παροχής των κατόπιν γνωστοποίησης και κοινοποίησης προς τον εκάστοτε επισκέπτη-χρήστη, να προβεί ενδεικτικά και όχι περιοριστικά σε οποιαδήποτε από τις εξής ενέργειες ή και σε περισσότερες ή όλες σωρευτικώς:
            <br>
            α) να καταγράφει και να αποθηκεύει–διατηρεί καταγεγραμμένη κάθε επικοινωνία (ή μέρος αυτών) του επισκέπτη–χρήστη με την ιστοσελίδα, συμπεριλαμβανομένων των e-mail επικοινωνίας και των ερωτήσεων - απαντήσεων προς ειδικούς ή άλλα πρόσωπα,
            <br>
            β) να ερευνά οποιαδήποτε καταγγελία, ιδίως αλλά όλως ενδεικτικώς σε περίπτωση που κάποια επικοινωνία δεν συμμορφώνεται με την εκάστοτε ισχύουσα νομοθεσία ή με τους όρους και προϋποθέσεις χρήσης αυτού,
            <br>
            γ) να αποφασίζει κατά την απόλυτη διακριτική του ευχέρεια να αποσύρει, να παύει την ανάρτηση που δεν συμμορφώνεται με τους κείμενους κανονισμούς και νομοθεσία ή να απαιτεί την απόσυρση μιας οποιασδήποτε επικοινωνίας και να προβαίνει σε οποιαδήποτε άλλη νόμιμη ενέργεια για την προστασία των δικαιωμάτων και των συμφερόντων του,
            <br>
            δ) να αποσύρει κατά απόλυτη διακριτική ευχέρεια και όλως αναιτιολογήτως επικοινωνίες και αποσταλέντα από τον επισκέπτη χρήστη δεδομένα και πληροφορίες, που δύνανται να θεωρηθούν από οποιονδήποτε ως προσβλητικές, συκοφαντικές παράνομες ή ενοχλητικές
            ή που δεν συμμορφώνονται με τους όρους και προϋποθέσεις χρήσεως του schol.io ή τις εκάστοτε ισχύουσες εφαρμοστέες διατάξεις ή δύνανται να πρoσβάλουν δικαιώματα ή έννομα συμφέροντα τρίτων,
            <br>
            ε) να διαγράψει κατά απόλυτη διακριτική ευχέρεια και όλως αναιτιολογήτως και χωρίς προειδοποίηση ή κοινοποίηση οποιοδήποτε εγγεγραμμένο μέλος και να αποκλείσει την πρόσβαση αυτού στον διαδικτυακό τόπο,
            όταν αυτό δεν συμμορφώνεται με οποιονδήποτε από τους όρους και προϋποθέσεις χρήσεως του schol.io ή με οποιαδήποτε εκάστοτε ισχύουσα εφαρμοστέα διάταξη.
        </p>

        <h3>Διατήρηση Προσωπικών Δεδομένων</h3>
        <p class="terms">
            Τα εν λόγω προσωπικά δεδομένα διατηρούνται μόνο για το χρονικό διάστημα που απαιτείται για να πραγματοποιηθούν οι σκοποί της συλλογής και επεξεργασίας τους, και για όσο χρονικό διάστημα ο χρήστης έχει ενεργό λογαριασμό προφίλ στη πλατφόρμα του schol.io.
            Ακόμα και στην περίπτωση που κάποιος χρήστης απενεργοποιήσει τον λογαριασμό προφίλ από την πλατφόρμα της εταιρείας, μπορεί να τον ενεργοποιήσει εκ νέου ανά πάσα στιγμή καθώς τα προσωπικά στοιχεία είναι ήδη καταχωρημένα στη πλατφόρμα της εταιρείας, πλην οποιονδήποτε τροποποιήσεων, τις οποίες πρέπει αρχικά να γνωστοποιήσει στην εταιρεία.

            Εάν επιθυμείτε μόνιμη διαγραφή του προφίλ μπορείτε να την ζητήσετε στην ηλεκτρονική διεύθυνση της πλατφόρμας scholioApp@gmail.com

            Σε κάθε περίπτωση και συγκεκριμένα:

            Για 1 έτος κρατούνται στη βάση δεδομένων της εταιρείας τα στοιχεία του εκπαιδευτικού ιδρύματος σε περίπτωση που προκύψει πρόβλημα διασταύρωσης στοιχείων και εν συνεχεία διαγράφονται με ασφάλεια.
            Σε περίπτωση διαγραφής προφίλ από χρήστη, η εταιρεία διαγράφει με ασφάλεια όλα τα προσωπικά του δεδομένα τα οποία έχει καταχωρίσει στη βάση δεδομένων της και ενημερώνει μέσω mail τον εν λόγω χρήστη ή επαγγελματία, ότι εντός 48 ωρών η εταιρεία θα διακόψει οποιαδήποτε επικοινωνία μαζί του.
            Η εταιρεία διατηρεί στη βάση δεδομένων της, την ημερομηνία εγγραφής και διαγραφής του και το λόγο διαγραφής του από την πλατφόρμα της εταιρείας. Η εταιρεία διατηρεί τα ως άνω στοιχεία για διάστημα 48 μηνών για στατιστικούς και μόνο λόγους.
            Σε κάθε περίπτωση, τα στοιχεία του εκπαιδευτικού ιδρύματος, ο αριθμός τηλεφώνου, και η διεύθυνση e-mail κρυπτογραφούνται για λόγους ασφαλείας με την εγγραφή του και τη δημιουργία προφίλ στην πλατφόρμα της εταιρείας.


            Το schol.io  εγγυάται την ασφάλεια των δεδομένων προσωπικού χαρακτήρα από την υποβαλλόμενη επεξεργασία, μεταξύ άλλων την προστασία τους από μη εξουσιοδοτημένη ή παράνομη επεξεργασία και τυχαία απώλεια, καταστροφή ή φθορά, με την χρησιμοποίηση κατάλληλων τεχνικών ή οργανωτικών μέτρων.
            Παρά την καλόπιστη και κάθε δυνατή προσπάθεια από το schol.io για την αποθήκευση προσωπικών δεδομένων των χρηστών σε ένα ασφαλές λειτουργικό περιβάλλον, το οποίο δεν είναι ανοιχτό για το κοινό, ρητώς με το παρόν δηλώνουμε προς κάθε χρήστη–επισκέπτη ότι δεν είναι δυνατόν να εγγυηθούμε την πλήρη
            ή τέλεια ασφάλεια στη διαφύλαξη των πληροφοριών αυτών, και το schol.io δεν εγγυάται ούτε υπόσχεται ούτε αναλαμβάνει την υποχρέωση να διασφαλίσει ότι δεν θα υπάρξουν ακούσιες αποκαλύψεις προσωπικών δεδομένων ή μη ηθελημένη και μη νόμιμη πρόσβαση σε αυτά μόνον απο κακόβουλους και μη νόμιμους τρίτους,
            και άρα το schol.io δεν υπέχει καμία ευθύνη σχετικώς. Ο χρήστης πρέπει να ενημερώνει άμεσα εγγράφως το schol.io σε περίπτωση που τα στοιχεία επικοινωνίας του έχουν χαθεί, κλαπεί ή χρησιμοποιούνται χωρίς την άδειά του ή σε περίπτωση που υποπέσει στην αντίληψή του οποιαδήποτε άλλη μη ηθελημένη
            και μη νόμιμη πρόσβαση σε αυτά. Σε τέτοια περίπτωση θα καταργήσουμε τα στοιχεία επικοινωνίας σας από το λογαριασμό σας και θα ενημερώσουμε τα αρχεία μας αναλόγως.
        </p>

        <h2>Χρήση Προσωπικών Δεδομένων</h2>
        <h3>Δήλωση Απορρήτου</h3>
        <p class="terms">
            Η προστασία του απορρήτου σας είναι σημαντική για το schol.io. Γι’ αυτό και έχουμε αναπτύξει μια Δήλωση Απορρήτου η οποία καλύπτει το πώς συλλέγουμε, χρησιμοποιούμε, αποκαλύπτουμε, μεταβιβάζουμε και αποθηκεύουμε τις πληροφορίες σας. Αφιερώστε λίγο χρόνο για να εξοικειωθείτε με τις πρακτικές απορρήτου μας και ενημερώστε μας αν έχετε οποιεσδήποτε απορίες.
            Αυτή η δήλωση απορρήτου ισχύει για όλες τις υπηρεσίες του schol.io ή το λογισμικό μας.

            <br>
            Πολιτική Απορρήτου
            <br>
            Οι πληροφορίες που ζητάμε όταν κάνετε την εγγραφή σας στο λογισμικό του schol.io, απαιτούνται προκειμένου να σας προσφέρουμε τις επαγγελματικές υπηρεσίες μας.
            Θα αποκαλύψουμε τα προσωπικά σας στοιχεία σε τρίτους μόνο για τους σκοπούς της εξυπηρέτησης της ανάγκης σας ώστε να σας παρέχουμε τις πληροφορίες ή τις υπηρεσίες που έχετε ζητήσει ή μόνο με τη ρητή συναίνεσή σας.
            Θα θέλαμε και πάλι να τονίσουμε ότι, σύμφωνα με την ευρωπαϊκή νομοθεσία για την προστασία προσωπικών δεδομένων, έχουν τηρηθεί ακριβείς διαδικασίες ασφαλείας για την αποτροπή της κατάχρησης των προσωπικών δεδομένων και τη μη εξουσιοδοτημένη πρόσβαση.
        </p>

        <h3>Τι κάνουμε με τις πληροφορίες που συλλέγουμε</h3>
        <p class="terms">
            Πρωταρχικός μας στόχος στη συλλογή πληροφοριών είναι να σας προσφέρουμε μια βελτιωμένη εμπειρία κατά τη χρήση της υπηρεσίας schol.io. Χρησιμοποιούμε αυτές τις πληροφορίες για να βελτιστοποιήσουμε τα αποτελέσματα βάσει της αναζήτησης τους, ώστε να σας φέρουμε σε επικοινωνία με το εκπαιδευτικό ίδρυμα μέσω πάντα της αίτησης υποτροφίας, να  δείτε το ιστορικό των αιτημάτων σας, τυχόν παρόμοιες υποτροφίες που μπορεί να τρέχουν από εμάς,
            να αξιολογείτε τα εκπαιδευτικά ιδρύματα που ήδη ανήκετε, και εφόσον είστε συνδεδεμενος με αυτα, και φυσικά εφόσον και αυτά έχουν επιλέξει να ενεργοποιήσουν τη δυνατότητα αυτή στο premium profile εκπαιδευτικών ιδρυμάτων. Για την ασφάλεια όλων των χρηστών αλλά και βάση των νέων Ευρωπαικών νόμων περί Προσωπικών Δεδομένων,
            απαγορεύεται η μεταβίβαση των Προσωπικών Δεδομένων χρηστών που έχουν αντληθεί κατά την χρήση της υπηρεσίας, σε τρίτους. Μια τέτοια ενέργεια θεωρείται κακόβουλη και διώκεται ποινικά.

            Η εταιρεία χρησιμοποιεί Internet Protocol (IP) διεύθυνση για να βοηθήσει στη διάγνωση προβλημάτων με τον εξυπηρετητή (server) υπολογιστή μας και για τη διαχείριση του λογισμικού. Η διεύθυνση IP σας χρησιμοποιείται για να βοηθά στον εντοπισμό σας και να συγκεντρώνει ευρεία δημογραφικά δεδομένα.
            Η διεύθυνση IP σας δεν περιέχει προσωπικές πληροφορίες για εσάς.
            Δύναται επίσης να χρησιμοποιήσουμε τα προσωπικά σας στοιχεία για να δημιουργήσουμε ανώνυμα αρχεία πληροφοριών, με εξαίρεση τις πληροφορίες που κάνουν τα προσωπικά σας στοιχεία αναγνωρίσιμα.
            Θα σας στέλνουμε πληροφορίες που σχετίζονται αποκλειστικά με τις υπηρεσίες μας και σε σπάνιες περιπτώσεις, όταν αυτό είναι απαραίτητο. Για παράδειγμα, αν η υπηρεσία μας έχει ανασταλεί προσωρινά για λόγους συντήρησης, ενδέχεται να σας στείλουμε ένα μήνυμα ηλεκτρονικού ταχυδρομείου.
            Γενικά, δεν μπορείτε να εξαιρεθείτε από αυτές τις επικοινωνίες, οι οποίες δεν είναι διαφημιστικού χαρακτήρα. Αν δεν επιθυμείτε να τις λαμβάνετε, έχετε τη δυνατότητα να απενεργοποιήσετε/διαγράψετε το λογαριασμό σας.
            Από την άλλη πλευρά, μπορείτε πάντα να εξαιρεθείτε από τη λήψη ορισμένων επικοινωνιών από το schol.io όπως το newsletter στέλνοντας μας ένα email στο scholioApp@gmail.com. Σημειώστε ότι ακόμα κι αν διαγραφείτε ή εξαιρεθείτε, μπορούμε να σας στείλουμε ανακοινώσεις σχετικά με τις αιτήσεις υποτροφιών που έχετε πραγματοποιήσει.
        </p>

        <h3>Εξυπηρέτηση πελατών</h3>
        <p class="terms">
            Με βάση τις προσωπικά αναγνωρίσιμες πληροφορίες που μας παρέχετε, θα σας στείλουμε ένα email καλωσορίσματος για να επιβεβαιώσουμε το όνομα χρήστη και τον κωδικό πρόσβασής σας.
            Επίσης, θα επικοινωνήσουμε μαζί σας προς απάντηση των ερωτήσεών σας, για να παρέχουμε τις υπηρεσίες που ζητήσατε, και για τη διαχείριση του λογαριασμού σας. Θα επικοινωνήσουμε μαζί σας με email ή τηλεφωνικά, σύμφωνα με τις επιθυμίες σας.
        </p>

        <h2>Προσωπικά Δεδομένα σε τρίτους</h2>
        <p class="terms">
            Ο επισκέπτης–χρήστης αποδέχεται και δίνει τη συγκατάθεση του για την συλλογή την τήρηση και επεξεργασία των προσωπικών του δεδομένων, όπως αυτά δηλώνονται από αυτόν τον ίδιο με την υποβολή του ερωτήματος και του προσωπικού του ιστορικού, από το διαχειριστή της ιστοσελίδας,
            ο οποίος δικαιούται να τα γνωστοποιεί σε τρίτα πρόσωπα (μόνον σε ειδικούς), τα οποία έχουν συμμορφωθεί απόλυτα στους όρους και στις αρχές του Γενικού Κανονισμού 2016/679 για την Προστασία Δεδομένων, με τον αποκλειστικό σκοπό της ορθής και καλής λειτουργίας-παροχής των υπηρεσιών του schol.io
            και της αποστολής των σχετικών απαντήσεων.
            Επιπλέον, ο εκάστοτε επισκέπτης-χρήστης θα πρέπει να γνωρίζει ότι κατά την δημιουργία προφίλ και την δημοσίευση προσωπικών του δεδομένων στην πλατφόρμα του schol.io ενδέχεται να συλλεχθούν αυτόματα προσωπικές του πληροφορίες και συγκεκριμένα η φωτογραφία, από τρίτους, όπως η Google και άλλες μηχανές αναζήτησης.
            Για το λόγο αυτό θα πρέπει ο επισκέπτης χρήστης να επικοινωνήσει απευθείας με τις εταιρείες αυτές για τη διαγραφή των στοιχείων του, καθώς η εταιρεία δεν υπέχει καμία ευθύνη ως προς αυτό.

            Περαιτέρω ο διαχειριστής του schol.io θα τηρεί αρχείο με τα προσωπικά δεδομένα των χρηστών–αποστολέων ερωτημάτων, σύμφωνα με τις διατάξεις του 2016/679 Γενικού Κανονισμού, για το απόρρητο των προσωπικών δεδομένων, υποχρεούμενος στην τήρηση των διατάξεων του Ν. 2225/1994 και του Π.Δ. 47/2005
            για την άρση του απορρήτου αυτού προς κάθε δικαστική αρχή, για λόγους εθνικής ασφάλειας ή για τη διακρίβωση ιδιαίτερα σοβαρών αδικημάτων και για κάθε αναφερόμενο στην εκάστοτε ισχύουσα νομοθεσία λόγο, αφού τηρηθεί η διαδικασία που προβλέπει η εκάστοτε ισχύουσα νομοθεσία,
            οι δε χρήστες–επισκέπτες διατηρούν μεταξύ άλλων και τα δικαιώματα των άρθρων του 2016/679 Γενικού Κανονισμού, περί δικαιώματος πρόσβασης σε δεδομένα προσωπικού χαρακτήρα, διόρθωσης ή διαγραφής αυτών και να ασκείται το δικαίωμα προβολής αντιρρήσεων.
            Ανεξάρτητα από το αν κάποιος είναι απλός χρήστης ή μέλος του schol.io  ή επισκέπτης, μπορεί να ασκήσει τα ακόλουθα δικαιώματα προστασίας δεδομένων, δηλαδή το δικαίωμα διαγραφής, το δικαίωμα τροποποίησης ή διόρθωσης των προσωπικών του δεδομένων, το δικαίωμα να αντιταχθεί στη χρήση των προσωπικών του δεδομένων.

        </p>

        <h2>Πολιτική Ασφάλειας Προσωπικών Δεδομένων</h2>
        <p class="terms">
            Όλες οι πληροφορίες, οι οποίες σχετίζονται με τα προσωπικά σας στοιχεία των χρηστών αλλά και τα δεδομένα που εισάγονται στην εφαρμογή είναι ασφαλή και απόρρητα. Η ασφάλεια επιτυγχάνεται με τις ακόλουθες μεθόδους:
        </p>
        <h3>Αναγνώριση Χρήστη</h3>
        <p class="terms">
            Οι κωδικοί που χρησιμοποιούνται για την αναγνώρισή είναι δύο: ο Κωδικός Εισόδου (e-mail) και ο Προσωπικός Μυστικός Κωδικός Ασφαλείας (password), οι οποίοι κάθε φορά που καταχωρούνται παρέχουν πρόσβαση με απόλυτη ασφάλεια στα προσωπικά στοιχεία του χρήστη.
            Δίνεται η δυνατότητα μεταβολής του προσωπικού μυστικού κωδικού ασφαλείας όσο συχνά επιθυμεί ο χρήστης. Ο χρήστης είναι αποκλειστικά υπεύθυνος για την διατήρηση της μυστικότητας και απόκρυψης του από τρίτα πρόσωπα. Σε περίπτωση απώλειας του ή διαρροής του θα πρέπει να προβεί στην άμεση ειδοποίηση μας,
            διαφορετικά δεν ευθυνόμαστε για την χρήση του μυστικού κωδικού από μη εξουσιοδοτημένο πρόσωπο. Οι μυστικοί κωδικοί ασφαλείας αποθηκεύονται στη βάση δεδομένων μας με χρήση αλγόριθμου κρυπτογράφησης one-way hash, κάνοντας αδύνατη την ανάκτησης του ακόμα και από τους διαχειριστές,
            ενώ με αυτό τον τρόπο το σύστημα προστατεύεται ακόμα και σε περίπτωση κάποιας κακόβουλης επίθεσης.

            Για την εξασφάλιση του απορρήτου της μεταφοράς των προσωπικών δεδομένων, χρησιμοποιούμε το πρωτόκολλο κρυπτογράφησης SSL-256bit.
            Η κρυπτογράφηση είναι ουσιαστικά ένας τρόπος κωδικοποίησης της πληροφορίας μέχρι αυτή να φτάσει στον ορισμένο αποδέκτη της, ο οποίος θα μπορέσει να την αποκωδικοποιήσει με χρήση του κατάλληλου κλειδιού (αυτό γίνεται αυτόματα από το πρωτόκολλο ssl).
            Η κρυπτογράφηση και χρήση ssl είναι υποχρεωτική σε όλες τις σελίδες, είτε περιέχουν ευαίσθητα δεδομένα είτε όχι.
        </p>

        <h3>Ελεγχόμενη Πρόσβαση - Συστήματα Ασφαλείας</h3>
        <p class="terms">
            Η πρόσβαση στα συστήματα μας (servers) ελέγχεται από firewall, το οποίο επιτρέπει τη χρήση συγκεκριμένων υπηρεσιών από τους πελάτες/ χρήστες απαγορεύοντας, παράλληλα, την πρόσβαση σε συστήματα και βάσεις δεδομένων με απόρρητα στοιχεία και πληροφορίες της εταιρείας.
            Σε όλους τους server υπάρχει υπηρεσία Antivirus που ελέγχει για πιθανό κακόβουλο λογισμικό που θα μπορούσε να δημιουργήσει διαρροή δεδομένων. Επιπλέον του εσωτερικού firewall, υπάρχει και επιπλέον φίλτρο από εξωτερική εταιρεία που παρέχει εξωτερικό firewall,
            καθώς και προστασία από διάφορα είδη κακόβουλης επίθεσης (DDOS Attacks, γνωστά exploits κλπ). Η εταιρεία αυτή ΔΕΝ έχει πρόσβαση στον εσωτερικό αποθηκευτικό χώρο μας. Για τη διαχείριση των server, η πρόσβαση επιτρέπεται μόνο μέσω υπηρεσίας VPN στην οποία έχει πρόσβαση μόνο η τεχνική ομάδα του schol.io,
            αποτρέποντας έτσι οποιαδήποτε πρόσβαση από δημόσιο δίκτυο, ακόμα και αν τα στοιχεία πρόσβασης των διαχειριστών διαρρεύσουν για οποιοδήποτε λόγο. Το filesystem των server είναι κρυπτογραφημένο, ώστε ακόμα και αν κάποιος αποκτήσει φυσική πρόσβαση σε server με δεδομένα του schol.io,
            να μην μπορεί να αποκρυπτογραφήσει τα δεδομένα.
        </p>
        <h3>Back Up</h3>
        <p class="terms">
            Κρατάμε καθημερινά εφεδρικά αντίγραφα όλων των δεδομένων για την αποτροπή οποιασδήποτε καταστροφής (hardware failure). Τα αντίγραφα διαγράφονται αυτόματα από τα συστήματα μας έχοντας ως μέγιστο χρόνο ζωής τον ένα μήνα.
            Τα αντίγραφα αποθηκεύονται φυσικά στο ίδιο datacenter αλλά σε ξεχωριστή μονάδα αποθήκευσης, έχοντας ακριβώς τις ίδιες αρχές πρόσβασης και προστασίας όπως και τα πρωτότυπα δεδομένα.
            Τα αντίγραφα ασφαλείας αποθηκεύονται με κρυπτογράφηση, ώστε ακόμα και αν υπάρξει διαρροή τους, να μην είναι δυνατή η ανάκτηση τους.
        </p>
        <h3>Διαρροή Δεδομενων</h3>
        <p class="terms">
            Αν υποπέσει στην αντίληψη μας οποιαδήποτε περίπτωση διαρροής δεδομένων από κακόβουλη επίθεση στα συστήματα μας, οι κινήσεις μας είναι οι εξής:
            <br>
            α) Προσωρινή παύση της λειτουργίας της εφαρμογής, μέχρι να διασφαλίσουμε ότι οποιοδήποτε κενό ασφαλείας έχει κλείσει.
            <br>
            β) Άμεση ειδοποίηση των χρηστών για την παραβίαση, το μέγεθος της - και σε περίπτωση που το λάθος έχει προέλθει από κάποιο μέλος, τον πιθανό τρόπο αντιμετώπισης.
            <br>
            γ) Άμεση ειδοποίηση οποιασδήποτε αρχής είναι αρμόδια ανάλογα με το είδος της διαρροής (π.χ. σε περίπτωση κακόβουλης επίθεσης ειδοποιείται το τμήμα ηλεκτρονικών εγκλημάτων της ελληνικής αστυνομίας).
        </p>
        <h3>Προστασία Cookies</h3>
        <p class="terms">
            Η Εταιρία μέσω της ιστοσελίδας έχει τη δυνατότητα να χρησιμοποιεί Cookies ως μέρος της διευκόλυνσης αλλά και λειτουργίας των υπηρεσιών της πλατφόρμας.
            Τα Cookies είναι μικρά αρχεία (text files), τα οποία απoστέλλονται και φυλάσσονται στον ηλεκτρονικό υπολογιστή του χρήστη/συνδρομητή, επιτρέποντας σε ιστοσελίδες όπως το schol.io, να λειτουργούν απρόσκοπτα και χωρίς τεχνικές ανωμαλίες,
            να επιτρέπουν τη συλλογή πολλαπλών επιλογών του χρήστη/συνδρομητή, και την αναγνώριση χρηστών/συνδρομητών και διευκολύνουν την πρόσβασή τους στην ιστοσελίδα, και επίσης συλλέγουν δεδομένα για τη βελτίωση του περιεχομένου της ιστοσελίδας.
            Τα Cookies δεν προκαλούν βλάβες στους ηλεκτρονικούς υπολογιστές των χρηστών αλλά και στα αρχεία που φυλάσσονται σε αυτούς. Η Εταιρία χρησιμοποιεί τα Cookies για να παρέχει στους χρήστες/συνδρομητές πληροφορίες και να διεκπεραιώνει τις υπηρεσίες που παρέχονται μέσω της ιστοσελίδας.
            Τρίτοι προμηθευτές, συμπεριλαμβανομένης της Google, δύναται να εμφανίσουν διαφημίσεις της Εταιρίας σε ιστότοπους στο διαδίκτυο. Τρίτοι προμηθευτές, συμπεριλαμβανομένης της Google, δύναται να κάνουν χρήση cookies για την προβολή διαφημίσεων που βασίζονται σε προηγούμενη επίσκεψη
            του χρήστη στο δικτυακό τόπο της Εταιρίας. Οι χρήστες μπορούν να επιλέξουν την εξαίρεσή τους από τέτοια χρήση των Cookies από την Google. Επισημαίνεται ότι τα Cookies είναι απόλυτα αναγκαία προκειμένου να λειτουργεί σωστά και απρόσκοπτα η πλατφόρμα.
        </p>

        <br>
        <br>
        <p class="terms">
            Τελευταία ενημέρωση 31.05.2018
        </p>





    </div>

</div>



<!-- Footer -->
    @include('public.footer')
</body>
</html>