<?php

return [
    'navigation' => [
        'about' => 'ΣΧΕΤΙΚΑ',
        'features' => 'ΣΗΜΕΙΑ ΥΠΕΡΟΧΗΣ',
        'institutions' => 'ΕΚΠΑΙΔΕΥΤΗΡΙΑ',
        'contact' => 'ΕΠΙΚΟΙΝΩΝΙΑ',
        'login' => 'Είσοδος',
        'register' => 'Εγγραφή',
        'logout' => 'Αποσύνδεση',
        'admin' => 'Διαχείριση',
    ],
    'first' => [
        'title' => [
            'talent' => 'Έχεις Ταλέντο;',
            'student' => 'Είσαι Μαθητής;',
            'student1' => 'Είσαι Φοιτητής;',
        ],
        'subtitle' => 'Διεκδίκησε τώρα την υποτροφία που σου ταιριάζει.',
        'subtitlePortal' => 'Αναζήτησε τα δημοφιλέστερα Εκπαιδευτικά Ιδρύματα',
        'searchbar' => [
            'scholarships' => [
                'title' => 'Υποτροφίες',
                'placeholder' => 'Αναζήτησε Υποτροφία πχ Νομική Bachelor, ή Αγγλικά, ή Ιδιωτικό Λύκειο Αθήνα',
                'button' => 'Αναζήτηση',
            ],
            'institutions' => [
                'title' => 'Εκπαιδευτικά Ιδρύματα',
                'placeholder' => 'Αναζήτησε Εκπαιδευτικά Ιδρύματα πχ Κολλέγιο, ή Γαλλικά, ή Δημοτικό Θεσσαλονίκη',
                'button' => 'Αναζήτηση',
            ],
        ],
        'algolia' => [
            'search' => [
                'institutions' => 'Εκπαιδευτικά Ιδρύματα',
                'studies' => 'Σπουδές',
                'results' => 'Δεν βρεθηκαν αποτελεσματα!',
            ],
        ],
    ],
    'about' => [
        'title' => 'Βρες τη δική σου υποτροφία με 3 βήματα',
        'titlePortal' => 'Η επιλογή σπουδών πιο ευκολή απο ποτέ',

        'section1' => [
            'title' => 'Αναζήτησε Υποτροφίες',
            'titlePortal' => 'Αναζήτησε',
            'subtitle' => 'Επέλεξε την κατηγορία όπως Κολλέγιο, ΙΕΚ , Ιδιωτικό Λύκειο ή Φροντιστήριο και την πόλη που σε ενδιαφέρει.',
            'subtitlePortal' => 'Αναζήτησε εκπαιδευτικά ιδρύματα όπως κολλέγια, Επαγγελματικές Σχολές και ιδιωτικά Σχολεία.',
        ],
        'section2' => [
            'title' => 'Διεκδίκησε',
            'titlePortal' => 'Εγγράψου',
            'subtitle' => 'Περιέγραψε το προφίλ και τις δεξιότητες σου με μια απλή φόρμα και διεκδίκησε όσες υποτροφίες σε ενδιαφέρουν.',
            'subtitlePortal' => 'Συμπλήρωσε το προφίλ σου και εκδήλωσε το ενδιαφέρον σου για τα εκπαιδευτικά ιδρύματα της προτίμησής σου.',

        ],
        'section3' => [
            'title' => 'Ξεκίνα τις σπουδές σου',
            'subtitle' => 'Ο εκπαιδευτικός φορέας εξετάζει το αίτημα σου και σε ενημερώνει αναλυτικά για τις περαιτέρω λεπτομέρειες.',
            'subtitlePortal' => 'Ο εκπαιδευτικός φορέας σε ενημερώνει για τις λεπτομέρειες της εγγραφής σου.',
        ],
        'button' => 'Ξεκίνησε Τώρα !',
        'institutions' => [
            'title' => 'Η ολοκληρωμένη λύση προβολής για κάθε εκπαιδευτικό ίδρυμα',
            'title-xs' => 'Η ολοκληρωμένη λύση για κάθε εκπαιδευτικό ίδρυμα',
            'section1' => 'Δημιουργήστε και διαθέστε εύκολα καινότομες υποτροφίες',
            'section2' => 'Διαχειριστείτε το δυναμικό σας',
            'section3' => 'Προβληθείτε σε μια αμιγώς εκπαιδευτική κοινότητα',
            'button' => 'Εγγραφή Εκπαιδευτικού Φορέα',
        ],
    ],
    'features' => [
        'title' => 'Τα σημεία υπεροχής μας',
        'section1' => 'Τα δημοφιλέστερα εκπαιδευτικά ιδρύματα.',
        'section2' => 'Καινοτόμες μορφές υποτροφιών.',
        'section3' => 'Ευκαιρίες Σπουδών.',
        'section4' => 'Το πρώτο bot στην εκπαίδευση.',
    ],
    'institutions' => [
        'title' => 'Αναζήτησε ανάμεσα στα πιο πετυχημένα εκπαιδευτικά ιδρύματα.',
        'colleges' => 'Κολλέγια',
        'frontistirio' => 'Φροντιστήρια',
        'languages1' => 'Ξένες',
        'languages2' => 'Γλώσσες',
        'private_schools1' => 'Ιδιωτικά',
        'private_schools2' => 'Σχολεία',
        'playground' => 'Παιδικοί Σταθμοί',
        'iek1' => 'ΙΕΚ & Επαγγελματικές ',
        'iek2' => 'Σχολές',
        'button' => 'Αναζητηση',
    ],
    'statistics' => [
        'title' => 'Στο Schol.io θα βρείς τη μεγαλύτερη εκπαιδευτική κοινότητα',
        'studies' => 'Αντικείμενα Σπουδών',
        'scholarships' => 'Υποτροφίες',
        'students' => 'Γονείς & Μαθητές',
        'institutions' => 'Καθηγητές & Εκπαιδευτικά Ιδρύματα',
    ],
    'footer' => [
        'contact' => 'Επικοινωνία',
        'blog' => 'Blog',
        'terms' => 'Όροι Χρήσης',
        'message' => '© 2017 schol.io Με την επιφύλαξη κάθε δικαιώματος.',
    ],
];
