<?php

return [
    'navigation' => [
        'about' => 'ΣΧΕΤΙΚΑ',
        'features' => 'ΣΗΜΕΙΑ ΥΠΕΡΟΧΗΣ',
        'institutions' => 'ΕΚΠΑΙΔΕΥΤΗΡΙΑ',
        'contact' => 'ΕΠΙΚΟΙΝΩΝΙΑ',
        'login' => 'Σύνδεση',
        'register' => 'Εγγραφή',
        'logout' => 'Αποσύνδεση',
        'admin' => 'Διαχείριση',
    ],
    'first' => [
        'title' => '',
        'subtitle' => 'Διεκδίκησε τώρα την υποτροφία που σου ταιριάζει.',
        'searchbar' => [
            'scholarships' => [
                'title' => 'Υποτροφίες',
                'placeholder' => 'Αναζήτησε Υποτροφία πχ Νομική Bachelor, ή Αγγλικά, ή Ιδιωτικό Λύκειο',
                'button' => 'Αναζήτηση',
            ],
            'institutions' => [
                'title' => 'Εκπαιδευτικά Ιδρύματα',
                'placeholder' => 'Αναζήτησε Εκπαιδευτικά Ιδρύματα πχ Κολλέγιο, ή Γαλλικά, ή Δημοτικό',
                'button' => 'Αναζήτηση',
            ],
        ],
    ],
    'about' => [
        'title' => 'Βρες τη δική σου υποτροφία με 3 βήματα',
        'section1' => [
            'title' => 'Αναζήτησε Υποτροφίες',
            'subtitle' => 'Επέλεξε την κατηγορία όπως Κολλέγιο, ΙΕΚ , Ιδιωτικό Λύκειο ή Φροντιστήριο και την πόλη που σε ενδιαφέρει.',
        ],
        'section2' => [
            'title' => 'Διεκδίκησε',
            'subtitle' => 'Περιέγραψε το προφίλ και τις δεξιότητες σου με μια απλή φόρμα και διεκδίκησε όσες υποτροφίες σε ενδιαφέρουν.',
        ],
        'section3' => [
            'title' => 'Ξεκίνα τις σπουδές σου',
            'subtitle' => 'Ο εκπαιδευτικός φορέας εξετάζει το αίτημα σου και σε ενημερώνει αναλυτικά για τις περαιτέρω λεπτομέρειες.',
        ],
        'institutions' => [
            'title' => 'Η ολοκληρωμένη λύση προβολής για κάθε εκπαιδευτικό ίδρυμα',
            'section1' => 'Δημιουργήστε και διαθέστε εύκολα καινότομες υποτροφίες',
            'section2' => 'Διαχειριστείτε το δυναμικό σας',
            'section3' => 'Προβληθείτε σε μια αμιγώς εκπαιδευτική κοινότητα',
            'button' => 'Εγγραφή Εκπαιδευτικού Φορέα',
        ],
    ],
    'features' => [
        'title' => 'Τα σημεία υπεροχής μας',
        'section1' => 'Τα δημοφιλέστερα εκπαιδευτικά ιδρύματα.',
        'section2' => 'Καινοτόμες μορφές υποτροφιών.',
        'section3' => 'Ευκαιρίες Σπουδών.',
    ],
    'institutions' => [
        'title' => 'Αναζήτησε ανάμεσα στα πιο πετυχημένα εκπαιδευτικά ιδρύματα.',
        'colleges' => 'Κολλέγια',
        'frontistirio' => 'Φροντιστήρια',
        'languages' => 'Ξένες Γλώσσες',
        'private_schools' => 'Ιδιωτικά Σχολεία',
        'playground' => 'Παιδικοί Σταθμοί',
        'iek' => 'ΙΕΚ και Επαγγελματικές Σχολές',
        'button' => 'Αναζήτηση',
    ],
    'statistics' => [
        'title' => 'ΥποτροφίεςΣτο Schol.io θα βρείς τη μεγαλύτερη εκπαιδευτική κοινότητα',
        'studies' => 'Αντικείμενα Σπουδών',
        'scholarships' => 'Υποτροφίες',
        'students' => 'Γονείς & Μαθητές',
        'institutions' => 'Καθηγητές & Εκπαιδευτικά Ιδρύματα',
    ],
    'footer' => [
        'contact' => 'Επικοινωνία',
        'blog' => 'Blog',
        'terms' => 'Όροι Χρήσης',
        'message' => '© 2017 schol.io Με την επιφύλαξη κάθε δικαιώματος.',
    ],
];
