<?php

return [
    'create' => [
        'step' => 'Βήμα',
        'financial' => 'Οικονομική Προσφορά',
        'study' => 'Σπουδές/Ειδικότητα',
        'criteria' => 'Κριτήρια/Όροι',
        'tags' => 'Λέξεις Κλειδιά',
        'terms' => 'Όροι και Προϋποθέσεις',
        'financial1' => 'Μείωση Διδάκτρων',
        'financial2' => 'Ποσό Επιδότησης',
        'financial3' => 'Χρόνος Δωρεάν Φοίτησης',
        'months' => 'Μήνες',
        'criteria1' => 'Υποτροφία Ταλέντου/Δεξιοτήτων',
        'criteria2' => 'Υποτροφία Αριστείας',
        'criteria3' => 'Υποτροφια με Κοινωνικά Κριτήρια',
        'criteria4' => 'Υποτροφία για Φίλους/Αδέλφια',
        'criteria5' => 'Υποτροφία Ανοιχτού Τύπου',
        'winners' => 'Πλήθος Νικητών Υποτροφίας',
        'multiple_winners' => 'Πολλαπλοί Νικητές',
        'active' => 'Υποτροφία ενεργή μέχρι',
        'exams' => 'Υποτροφία με εξετάσεις',
        'remaining' => 'Υπολοιπο Χαρακτήρων',
        'previous' => 'Προηγούμενο',
        'next' => 'Επόμενο',
        'reset' => 'Επαναφορά',
        'save' => 'Οριστικοποίηση',
        'close' => 'Κλείσιμο',

    ],

    'view' => [
        'title' => 'Πίνακας Υποτροφιών',
        'search' => 'Αναζήτηση',
        'financial' => 'Οικονομική Προσφορά',
        'price' => 'Ποσό',
        'studies' => 'Σπουδές',
        'level' => 'Επίπεδο Σπουδών',
        'criteria' => 'Κριτήρια',
        'end_date' => 'Ημερομηνία Λήξης',
        'ended' => 'Έληξε',
        'admitted' => 'Αιτήθηκαν',
        'show' => 'Προβολή',
        'chart' => 'Αιτήσεις σε κάθε υποτρoφία',
        'status' => [
            'active' => 'Ενεργές',
            'ended' => 'Έχουν Λήξει',
        ],
    ],

    'admissions' => [
        'title' => 'Ειδποιήσεις για Αιτήματα Υποτροφιών',
        'subtitle' => 'Όλα τα αιτήματα',
        'name' => ' Όνομα Μαθητη',
        'scholarship' => 'Υποτροφία',
    ],

];
