<?php

return [
    'step1' => 'Βήμα 1: Επιλέξτε Επίπεδο Σπουδών',
    'placeholder1'=>'Αναζητήστε ή Προσθέστε Νέο Επίπεδο Σπουδών',
    'step2' => 'Βήμα 2: Επιλέξτε Τομέα/Κατηγορία Σπουδών',
    'placeholder2'=>'Αναζητήστε ή Προσθέστε Νέο Τομέα/Κατηγορία Σπουδών',
    'step3' => 'Βήμα 3: Επιλέξτε Ειδικότητα/Αντικείμενο Σπουδών',
    'placeholder3'=>'Αναζητήστε ή Προσθέστε Νέα Ειδικότητα/Αντικείμενο Σπουδών',
    'input-delete'=>'Διαγραφή',
    'input-selected'=>'Επιλέχθηκε',
    'save'=>'Οριστικοποίηση',
    'selected'=>'Επιλεγμένες Σπουδές',
    'delete-all'=>'Διαγραφή Σπουδών',
    'modal-message'=>'Επιθυμείτε να διαγράψετε όλες τις επιλογές σπουδών σας μέχρι τώρα ;',
    'modal-reject'=>'Απόρριψη',
    'modal-submit'=>'Αποδοχή',

];
