<?php

return [
    'create' => [
        'step' => 'Βήμα',
        'financial' => 'Οικονομική Προσφορά',
        'study' => 'Σπουδές/Ειδικότητα',
        'criteria' => 'Κριτήρια/Όροι',
        'tags' => 'Λέξεις Κλειδιά',
        'terms' => 'Όροι & Προϋποθέσεις',
        'financial1' => 'Μείωση Διδάκτρων',
        'financial2' => 'Ποσό Επιδότησης',
        'financial3' => 'Χρόνος Δωρεάν Φοίτησης',
        'months' => 'Μήνες',
        'criteria1' => 'Υποτροφία Ταλέντου/Δεξιοτήτων',
        'criteria2' => 'Υποτροφία Αριστείας',
        'criteria3' => 'Υποτροφια με Κοινωνικά Κριτήρια',
        'criteria4' => 'Υποτροφία για Φίλους/Αδέλφια',
        'criteria5' => 'Υποτροφία Ανοιχτού Τύπου',
        'winners' => 'Πλήθος Νικητών Υποτροφίας',
        'multiple_winners' => 'Πολλαπλοί Νικητές',
        'active' => 'Υποτροφία ενεργή μέχρι',
        'exams' => 'Υποτροφία με εξετάσεις',
        'remaining' => 'Υπολοιπο Χαρακτήρων',
        'previous' => 'Προηγούμενο',
        'next' => 'Επόμενο',
        'reset' => 'Επαναφορά',
        'save' => 'Οριστικοποίηση',
        'close' => 'Κλείσιμο',
        'select' => 'Επιλογή',
        'selected' => 'Επιλέχθηκε',
        
        'criteriatext1' => 'Η υποτροφία ταλέντου/δεξιοτήτων είναι η πιο δημοφιλής μορφή υποτροφίας στην κοινότητα του schol.io. 
        Δεν συνδέεται με κάποια διαδικασία διαγωνισμού ή εξετάσεων, αλλά στηρίζεται αποκλειστικά στην αξιολόγηση των ιδιαίτερων ικανοτήτων των συμμετεχόντων. 
        Βασίζεται στο βιογραφικό των υποψηφίων, που ενισχύεται με συνδέσμους από video και κοινωνικά δίκτυα που αναδεικνύουν τις ξεχωριστές δεξιότητες τους. 
        Το ταλέντο είναι δυνατόν να αφορά αθλητικές διακρίσεις, μαγειρικές ικανότητες, κλίση στις τέχνες, στις κατασκευές, στο προγραμματισμό, τη ρομποτική, τις ξένες γλώσσες ή σε ευρύτερα αντικείμενα. 
        Τα ταλέντα μπορεί να είναι σχετικά ή παρεμφερή με το αντικείμενο σπουδών που παρέχεται. 
        Στην συγκεκριμένη μορφή υποτροφίας αυτή το εκπαιδευτικό ιδρυμα θα πρέπει να στείλει μια σύντομη ανατροφοδότηση στον κάθε υποψήφιο για το πως θα μπορούσε να βελτιώσει την αίτηση του. 
        Οι λεπτομέρειες συμμετοχής θα πρέπει να περιγραφούν σύντομα αλλά με σαφήνια στα τελευταίο βήμα.',

        'criteriatext2' => 'Η υποτροφία αριστείας αφορά μια υποτροφία που οι συμμετέχοντες συνήθως διαγωνίζονται σε κάποια μορφή γραπτών σύντομων εξετάσεεων που ορίζει το εκπαιδευτικό ίδρυμα. 
        Πιθανόν να μην υπάρχουν εξετάσεις, αλλά η αριστεία να καθορίζεται από τον βαθμό αποφοίτησης ή το βαθμό της προηγούμενης τάξης, ή από άλλες διακρίσεις αριστείας. 
        Το αν υπάρχουν εξετάσεις ή όχι, η ημερομηνία και οι θεματικές ενότητες των εξετάσεων που που θα διαγωνιστούν οι συμμετέχοντες, ή άλλα κριτηρια αριστείας θα πρεπει να τα περιγράψετε σύντομα αλλα με σαφήνια στα επόμενα βήματα.',

        'criteriatext3' => 'Η υποτροφία με κοινωνικά κριτήρια αφορά συνήθως συμμετέχοντες που ανήκουν σε πολύτεκνες ή μονογονεϊκές οικογένειες, οικογένειες με χαμηλό εισόδημα ή άνεργους γονείς ή που πληρούν άλλα κοινωνικά κριτήρια. 
        Αποτελεί μια προσφορά κοινωνικής ευθύνης για το εκπαιδευτικό ίδρυμα που την προσφέρει και ενδεχεμένως να έχει πολλαπλούς νικητές εφόσον αρκετοί υποψήφιοι πληρούν τα κριτήρια διεκδίκισης. 
        Τα δικαιολογητικά και οι όροι συμμετοχής θα πρέπει να περιγραφούν σύντομα αλλά με σαφήνια στα τελευταίο βήμα.',

        'criteriatext4' => 'Η υποτροφία για φίλους η αδέλφια αφορά φίλους ή αδέλφια που επιθυμούν να σπουδάσουν το ίδιο η παρεμφερή γνωστικά αντικείμενα στο ίδιο εκπαιδευτικό φορέα. 
        Ανάλογα με τα κριτήρια, η υποροφία αυτή ενδεχεμένως να έχει. Λεπτομέρειες και όροι συμμετοχής θα πρέπει να περιγραφούν σύντομα αλλά με σαφήνια στα τελευταίο βήμα.',

        'criteriatext5' => 'Η υποτροφία ανοιχτού τύπου, αφορά ιδιαίτερες κατηγορίες συμμετεχόντων, όπως μαθητές/σπουδαστές που προέχρονται από την επαρχία, ή νησιοτικές περιοχές, ή μαθητές με ιδιαιτέρα ενδιαφέροντα. 
        Ανάλογα με τα κριτήρια, η υποροφία αυτή ενδεχεμένως να έχει πολλαπλούς νικητές. Λεπτομέρειες και όροι συμμετοχής θα πρέπει να περιγραφούν σύντομα αλλά με σαφήνια στα τελευταίο βήμα.'


    ],

    'view' => [
        'title' => 'Πίνακας Υποτροφιών',
        'search' => 'Αναζήτηση',
        'financial' => 'Προσφορά',
        'price' => 'Ποσό',
        'studies' => 'Σπουδές',
        'level' => 'Επίπεδο Σπουδών',
        'criteria' => 'Κριτήρια',
        'end_date' => 'Ημ/νία Λήξης',
        'ended' => 'Έληξε',
        'admitted' => 'Αιτήθηκαν',
        'show' => 'Προβολή',
        'chart' => 'Αιτήσεις σε κάθε υποτρoφία',
        'status' => [
            'active' => 'Ενεργές',
            'ended' => 'Έχουν Λήξει',
        ],
    ],

    'admissions' => [
        'title' => 'Ειδποιήσεις για Αιτήματα Υποτροφιών',
        'subtitle' => 'Όλα τα αιτήματα',
        'name' => ' Όνομα Μαθητη',
        'scholarship' => 'Υποτροφία',
    ],

];
