<?php
return [
    'register'=>'Εγγραφή μέσω',
    'name'=>'Όνομα',
    'last-name'=>'Επώνυμο',
    'email'=>'e-mail',
    'password'=>'Κωδικός',
    'confirm'=>'Επιβεβαίωση Κωδικού',
    'accept'=>'Αποδέχομαι',
    'terms'=>' τους όρους και τις προϋποθέσεις',
    'account'=>'Έχεις ήδη λογαριασμό;',
    'signup'=>'Εγγραφή',
    'login'=>'Συνδέσου',
    'required'=>'Συμπληρώστε προηγουμένως το πεδίο αυτό',

    'school'=>[

        'title'=>'Εγγραφη Εκπαιδευτικού Ιδρύματος στο Schol.io',
        'type'=>'Τύπος Εκπ. Ιδρύματος',
        'name'=>'Όνομα Εκπ. Ιδρύματος',
        'email'=>'email Εκπ. Ιδρύματος',
        'account'=>'Έχετε ήδη λογαριασμό;',
        'login'=>'Συνδεθείτε',

    ],

];
