<?php

return [
    'title' => 'Προφιλ Εκ. Ιδρύματος',
    'subtitle' => 'Συμπληρώστε το προφιλ σας',
    'avatar' => 'Φψτογραφία (κύρια)',
    'website' => 'Ιστοσελίδα',
    'type' => 'Τύπος Εκ. Ιδρύματος',
    'city' => 'Πόλη',
    'name' => 'Όνομα',
    'address' => 'Οδός',
    'email' => 'Ηλεκτρ. Διευθυνση',
    'password' => 'Κωδικός',
    'phone' => 'Αριθμός Τηλεφώνου',
    'manager' => 'Όνομα διαχειριστή',
    'about' => 'Εδώ γράψτε μια σύντομη περιγραφή',
    'button' => 'Αποθήκευση',
];
