<?php
return [
    'navigation' => [
        'search_scholarship' => 'Aναζήτησε Υποτροφίες',
        'login' => 'Σύνδεση',
        'register' => 'Εγγραφή',
        'logout' => 'Αποσύνδεση',
        'admin' => 'Διαχείριση',
    ],
    'cards' => [
        'reviews' => 'Αξιολογήσεις',
        'scholarships' => 'Υποτροφίες',
        'con_teachers' => 'Συνδ. Καθηγητές',
        'con_students' => 'Συνδ. Μαθητές',
        'studies' => 'Ειδικότητες Σπουδών',
        'request' => 'Αίτημα σύνδεσης',
    ],
    'filters' => [
        'title' => 'Φίλτρα Αναζήτησης',
        'categories' => 'Κατηγορίες',
        'cities' => 'Πόλεις',
        'reviews' => 'Αξιολογήσεις',
        'delete' => 'Διαγραφή Φίλτρων',
    ],
    'sortby'=>[
        'title'=>'Ταξινόμηση με:',
        'stars'=>'Υψήλοτερη Αξιολόγηση',
        'scholarships'=>'Περισσότερες Υποτροφίες',
        'students'=>'Περισσότερους Μαθητές'
    ],
    'show_map' => 'Προβολή Χάρτη',
    'search_institution' => 'Αναζήτηση Εκπαιδευτικού Ιδρύματος',
    'error' => 'Δεν βρέθηκαν αποτελέσματα',
    'prev_page' => 'Προηγούμενη Σελίδα',
    'next_page' => 'Επόμενη Σελίδα',
];
