<?php

return [
    'navigation' => [
        'info' => 'Σχετικά',
        'login' => 'Σύνδεση',
        'register' => 'Εγγραφή',
        'logout' => 'Αποσύνδεση',
        'admin' => 'Διαχείριση',
    ],
    'top' => [
        'multiple'=>'Πολλαπλές Σπουδές',
        'title' => 'Υποτροφία που προσφέρεται από',
        'admission' => 'Αιτήθηκαν',
        'interested' => 'Ενδιαφέρθηκαν',
        'posted' => 'Αναρτήθηκε',
        'end' => 'Λήγει',
        'exams' => 'Με εξετάσεις',
        'exam_date' => 'Ημ/νία Εξ.',
        'interested_button' => 'Ενδιαφέρομαι',
        'interested_yes' => 'Ενδιαφέρθηκα',
        'admission_button' => 'Αίτηση',
        'admission_past' => 'Αιτήθηκα',
        'ended'=>'έληξε',
        'ended_text'=>'Η καταλητική ημερομηνία υποβολής αιτήσεων εχει παρέλθει.',
    ],
    'cards' => [
        'study' => 'Σπούδασε',
        'study_message1' => 'Το αντικείμενο σπουδών αφορά τους υποψηφίους που στοχεύουν σε',
        'study_message2' => 'με ειδικότητα',
        'study_message3' => 'με ειδικότητες',
        'terms' => 'Όροι & Δικαίωμα Συμμετοχής',
        'financial' => 'Ο τελικός νικητής από όλους τους συμμετέχοντες για τη συγκεκριμένη υποτροφία, θα αποκτήσει για τις σπουδές του',
    ],
    'yes' => 'Ναι',
    'no' => 'Όχι',


    'edit' => [
        'studies'=>'Αντικείμενα Σπουδών',
        'limit'=>'Υπολ αιτήσεων',
        'selectWinners'=>'Επιλογή Νικητών Υποτροφίας: Επιλέξτε',
        'winners'=>' Νικητές',
        'winner'=>' Νικητή',
        'scholarWinners'=>'Νικητές Υποτροφίας',
        'terms'=>'Όροι και δικαίωμα συμμετοχής',
        'btnSave'=>'Αποθήκευση Αλλαγών',
        'btnEnd'=>'Λήξη Υποτροφίας και Ενημέρωση Νικητών',
        'btnDelete'=>'Διαγραφή Υποτροφίας',



    ]
];
