<?php

return [
    'title' => 'Προφιλ Εκπαιδευτικού Ιδρύματος',
    'subtitle' => 'Συμπληρώστε τα στοιχεία που θα εμφανίζονται στο δημόσιο προφίλ του εκπαιδευτικού ιδρύματος',
    'avatar' => 'Επιλογή κύριας Φωτογραφίας',
    'website' => 'Ιστοσελίδα',
    'type' => 'Τύπος Εκ. Ιδρύματος',
    'city' => 'Πόλη',
    'name' => 'Όνομα',
    'address' => 'Οδός',
    'email' => 'Ηλεκτρ. Διευθυνση',
    'password' => 'Κωδικός',
    'phone' => 'Αριθμός Τηλεφώνου',
    'manager' => 'Όνομα διαχειριστή',
    'about' => 'Εδώ γράψτε μια σύντομη περιγραφή',
    'button' => 'Αποθήκευση',

    'studies' => [
        'title' => 'Επιλογή Ειδικοτήτων Σπουδών',
        'delete' => 'Διαγραφή Επιλογών',
        'level' => 'Επιλογή Επιπέδων Σπουδών',
    ],
];
