<?php
return [
    'navigation' => [
        'search_scholarships' => 'Αναζήτηση Υποτροφιών',
        'login' => 'Σύνδεση',
        'register' => 'Εγγραφή',
        'logout' => 'Αποσύνδεση',
        'admin' => 'Διαχείριση',
    ],
    'cards' => [
        'scholarship_from' => 'Υποτροφία από:',
        'study' => 'Αντικείμενο Σπουδών',
        'level' => 'Επίπεδο Σπουδών',
        'show' => 'Προβολή',
        'admissions' => 'Αιτήθηκαν',
        'interested' => 'Ενδιαφέρθηκαν',
        'exams' => 'Με εξετάσεις',
        'end' => 'Λήγει',
    ],
    'filters' => [
        'title' => 'Φίλτρα Αναζήτησης',
        'institutions' => 'Εκπαιδευτικά Ιδρύματα',
        'cities' => 'Πόλεις',
        'studies' => 'Αντικείμενο Σπουδών',
        'level' => 'Επίπεδο Σπουδών',
        'criteria' => 'Κριτήρια Συμμετοχής',
        'delete' => 'Διαγραφή Φίλτρων',
        'about' => 'Σχετικά',
        'popular' => 'Δημοφιλής',
        'new' => 'Νέες',
    ],

    'show_map' => 'Προβολή Χάρτη',
    'search_institution' => 'Αναζήτηση Εκπαιδευτικού Ιδρύματος',
    'error' => 'Δεν βρέθηκαν αποτελέσματα',
    'prev_page' => 'Προηγούμενη Σελίδα',
    'next_page' => 'Επόμενη Σελίδα',
];
