<?php

return [
    'criteria' => [
        1 => 'Υποτροφία Ταλέντου - Δεξιοτήτων',
        2 => 'Υποτροφία Αριστείας',
        3 => 'Υποτροφία με Κοινωνικά Κριτήρια',
        4 => 'Υποτροφία για Φίλους-Αδέλφια',
        5 => 'Υποτροφία Ανοιχτού Τύπου'
    ],

    'financial' => [
        1 => 'Μείωση Διδάκτρων',
        2 => 'Ποσό Επιδότησης',
        3 => 'Χρόνος Δωρεάν Φοίτησης'
    ],

    'school_types' => [
        1 => 'Κολλέγιο',
        2 => 'ΙΕΚ - Επαγγελματική Σχολή - ΚΔΒΜ',
        3 => 'Φροντιστήριο Μέσης Εκπαίδευσης',
        4 => 'Φροντιστήριο Ξένων Γλωσσών / Πληροφορικής',
        5 => 'Φροντιστήριο Φοιτητικό',
        6 => 'Ιδιωτικό Λύκειο',
        7 => 'Ιδιωτικό Γυμνάσιο',
        8 => 'Ιδιωτικό Δημοτικό',
        9 => 'Παιδικός Σταθμός - Νηπιαγωγίο',
        10 => 'Σχολή Χορού',
        11 => 'Ωδείο',
        12 => 'Κέντρο Δημιουργικής Απασχόλησης'
    ],

    'category' => [
        'fa fa-user' => 'Ανθρώπινο Δυναμικό',
        'fa fa-link' => 'Διασύνδεση με αγορά εργασίας',
        'fa fa-building-o' => 'Εγκαταστάσεις',
        'fa fa-newspaper-o' => 'Ενημέρωση',
        'fa fa-calendar' => 'Ευέλικτα Τμήματα',
        'fa fa-futbol-o' => 'Όμιλοι Ενδιαφέροντος (Clubs)',
        'fa fa-cogs' => 'Οργάνωση',
        'fa fa-book' => 'Πρόγραμμα Σπουδών'
    ]

];