<?php

return [
    'criteria' => [
        1 => 'Υποτροφία Ταλέντου - Δεξιοτήτων',
        2 => 'Υποτροφία Αριστείας',
        3 => 'Υποτροφία με Κοινωνικά Κριτήρια',
        4 => 'Υποτροφία για Φίλους-Αδέλφια',
        5 => 'Υποτροφία Ανοιχτού Τύπου'
    ],

    'financial' => [
        1 => 'Μείωση Διδάκτρων',
        2 => 'Ποσό Επιδότησης',
        3 => 'Χρόνος Δωρεάν Φοίτησης'
    ],

    'school_types' => [
        1 => 'Κολλέγιο',
        2 => 'ΙΕΚ - Επαγγελματική Σχολή - ΚΔΒΜ',
        3 => 'Φροντιστήριο Μέσης Εκπαίδευσης',
        4 => 'Φροντιστήριο Ξένων Γλωσσών / Πληροφορικής',
        5 => 'Φροντιστήριο Φοιτητικό',
        6 => 'Ιδιωτικό Λύκειο',
        7 => 'Ιδιωτικό Γυμνάσιο',
        8 => 'Ιδιωτικό Δημοτικό',
        9 => 'Παιδικός Σταθμός - Νηπιαγωγίο',
        10 => 'Σχολή Χορού',
        11 => 'Ωδείο',
        12 => 'Κέντρο Δημιουργικής Απασχόλησης'
    ],

    'category' => [
        'fa fa-user' => 'Ανθρώπινο Δυναμικό',
        'fa fa-link' => 'Διασύνδεση με αγορά εργασίας',
        'fa fa-building-o' => 'Εγκαταστάσεις',
        'fa fa-newspaper-o' => 'Ενημέρωση',
        'fa fa-calendar' => 'Ευέλικτα Τμήματα',
        'fa fa-futbol-o' => 'Όμιλοι Ενδιαφέροντος (Clubs)',
        'fa fa-cogs' => 'Οργάνωση',
        'fa fa-book' => 'Πρόγραμμα Σπουδών'
    ],


      'criteriaInfo' => [
    1 => 'Η υποτροφία ταλέντου/δεξιοτήτων είναι η πιο δημοφιλής μορφή υποτροφίας στην κοινότητα του schol.io.
        Δεν συνδέεται με κάποια διαδικασία διαγωνισμού ή εξετάσεων, αλλά στηρίζεται αποκλειστικά στην αξιολόγηση των ιδιαίτερων ικανοτήτων των συμμετεχόντων.
        Βασίζεται στο βιογραφικό των υποψηφίων, που ενισχύεται με συνδέσμους από video και κοινωνικά δίκτυα που αναδεικνύουν τις ξεχωριστές δεξιότητες τους.
        Το ταλέντο είναι δυνατόν να αφορά αθλητικές διακρίσεις, μαγειρικές ικανότητες, κλίση στις τέχνες, στις κατασκευές, στο προγραμματισμό, τη ρομποτική, τις ξένες γλώσσες ή σε ευρύτερα αντικείμενα.
        Τα ταλέντα μπορεί να είναι σχετικά ή παρεμφερή με το αντικείμενο σπουδών που παρέχεται.',

    2 => 'Η υποτροφία αριστείας αφορά μια υποτροφία που οι συμμετέχοντες συνήθως διαγωνίζονται σε κάποια μορφή γραπτών σύντομων εξετάσεεων που ορίζει το εκπαιδευτικό ίδρυμα.
          Πιθανόν να μην υπάρχουν εξετάσεις, αλλά η αριστεία να καθορίζεται από τον βαθμό αποφοίτησης ή το βαθμό της προηγούμενης τάξης, ή από άλλες διακρίσεις αριστείας.',

    3 => 'Η υποτροφία με κοινωνικά κριτήρια αφορά συνήθως συμμετέχοντες που ανήκουν σε πολύτεκνες ή μονογονεϊκές οικογένειες, οικογένειες με χαμηλό εισόδημα ή άνεργους γονείς ή που πληρούν άλλα κοινωνικά κριτήρια.
          Αποτελεί μια προσφορά κοινωνικής ευθύνης και ενδεχομένως να έχει πολλαπλούς νικητές εφόσον αρκετοί υποψήφιοι πληρούν τα κριτήρια διεκδίκησης.',

    4 => 'Η υποτροφία για φίλους η αδέλφια αφορά φίλους ή αδέλφια που επιθυμούν να σπουδάσουν το ίδιο η παρεμφερή γνωστικά αντικείμενα στο ίδιο εκπαιδευτικό φορέα.
          Ανάλογα με τα κριτήρια, η υποτροφία αυτή ενδεχομένως να έχει πολλαπλούς νικητές.',

    5 => 'Η υποτροφία ανοιχτού τύπου, αφορά ιδιαίτερες κατηγορίες συμμετεχόντων, όπως μαθητές/σπουδαστές που προέχρονται από την επαρχία, ή νησιοτικές περιοχές, ή μαθητές με ιδιαιτέρα ενδιαφέροντα.
          Ανάλογα με τα κριτήρια, η υποτροφία αυτή ενδεχομένως να έχει πολλαπλούς νικητές.'
],



    'financialInfo' => [
        1 => 'Η μείωση διδάκτρων αφορά ένα % ποσοστό μείωσης των αρχικών διδάκτρων για το αντικείμενο σπουδών της παρεχόμενης υποτροφίας.',

        2 => 'Το ποσό επιδότησης αφορά ένα ποσό σε € που θα \'κερδίσει\' ο υποψήφιος επί των αρχικών διδάκτρων για το αντικείμενο σπουδών της παρεχόμενης υποτροφίας.',

        3 => 'Ο χρόνος δωρεάν φοίτησης αφορά συνήθως ένα \'δοκιμαστικό\' χρονικό διάστημα σπουδών, ή θερινά ή εποχιακά μαθήματα.',
    ],

    'role' => [
        'student' => 'Μαθητής',
        'parent' => 'Γονέας'
    ]




];