<?php
return [
    'terms' => [



        '1'=>'Οι ακόλουθοι Γενικοί Όροι και Προϋποθέσεις (εφεξής οι «Γενικοί Όροι»), έχουν θεσπιστεί από την υπό σύσταση Ι.Κ.Ε. με την επωνυμία Schol.io  Υπηρεσίες Online ΙΚΕ,
        που εδρεύει στη Θεσσαλονίκη με τα παρακάτω στοιχεία επικοινωνίας (αριθμό τηλεφώνου (+30) 6944577505, email scholioApp@gmail.com στο εξής καλούμενη Schol.io.',

        '2'=>'H πλατφόρμα Schol.io έχει στην κυριότητά της και νομίμως λειτουργεί και διαχειρίζεται τη διαδικτυακή Πλατφόρμα που φιλοξενείται στο δικτυακό τόπο schol.io (εφεξής ο «Δικτυακός Τόπος», ή «Ιστότοπος» ή «Τοποθεσία» ή «Πλατφόρμα»),
        την οποία (Πλατφόρμα) θέτει στη διάθεση των Εγγεγραμμένων Μελών/Χρηστών (εκπαιδευτικών ιδρυμάτων/φορέων, καθηγητών, γονέων και μαθητών) αλλά και των εν γένει επισκεπτών για την προσφορά, αναζήτηση, προβολή και διαχείριση υπηρεσιών εκπαίδευσης.',

        '3'=>'Παρακαλούμε διαβάστε προσεκτικά τους παρακάτω όρους χρήσης, πριν ξεκινήσετε ή συνεχίσετε να χρησιμοποιείτε τον ιστότοπο.
        Η χρήση της τοποθεσίας συνεπάγεται την αποδοχή με όλους τους όρους  της παρούσας συμφωνίας, χωρίς τροποποίηση από τον χρήστη.
        Σε περίπτωση που αντιτίθεστε με οτιδήποτε αναφέρεται στους «Όρους Χρήσης» ή στα «Προσωπικά Δεδομένα» , μην χρησιμοποιείτε τον ιστότοπο.
        Οι όροι χρήσης μπορεί να αλλάξουν οποιαδήποτε στιγμή, και τίθενται σε ισχύ άμεσα με την δημοσίευση τους στον ιστότοπο.
        Ο επισκέπτης/χρήστης παρακαλείται να ελέγχει τακτικά το περιεχόμενο των όρων χρήσης για ενδεχόμενες αλλαγές και αναθεωρήσεις.
        Μετά την πάροδο ενός (1) μήνα από τη δημοσίευσή τους, η συνέχιση της χρήσης του ιστότοπου ή η μη ακύρωση της συνδρομής του χρήστη, συνεπάγεται την ανεπιφύλακτη αποδοχή τους.',

        '4'=>'H Πλατφόρμα Schol.io ειδικότερα προσφέρει στις μεν Επιχειρήσεις-Μέλη (εκπαιδευτικά ιδρυμάτα/φορείς) τη δυνατότητα να προβάλουν στην Πλατφόρμα τις υποτροφίες τους και γενικότερα τις εκπαιδευτικές υπηρεσίες τους,
         οι δε Χρήστες – Μέλη(γονείς & μαθητές) μπορούν μέσω οποιασδήποτε συσκευής (κινητού) τηλεφώνου, ηλεκτρονικού υπολογιστή και εν γένει οποιουδήποτε ηλεκτρονικού μέσου,
         να πραγματοποιήσουν μέσω της Πλατφόρμας αίτηση μίας ή περισσότερων online υποτροφιών (εφεξής η «Υπηρεσία Online Υποτροφίας» ή η «Υπηρεσία»),
         γενικές πληροφορίες σε θέματα εκπαίδευσης, συλλογή δεδομένων και κέντρο ενημέρωσης για αγαθά και Υπηρεσίες που παρέχονται από τρίτους που επιθυμούν να προσφέρουν τα Προϊόντα ή τις Υπηρεσίες τους στην Ιστοσελίδα μας (οι «Συνεργάτες»).
         Η Πλατφόρμα μπορεί, ανάλογα με την ανάπτυξη και την εξέλιξη των Υπηρεσιών, να επεκτείνει ή να τροποποιήσει τις Υπηρεσίες της, να συμπεριλάβει καινούργιες ή να προβεί σε αντικατάσταση Υπηρεσιών, δραστηριοτήτων ή περιεχομένου.
         Oι ακόλουθοι Γενικοί Όροι καθορίζουν τους όρους και τις προϋποθέσεις σύμφωνα με τους οποίους η Πλατφόρμα παρέχει αφενός την Υπηρεσία Online Υποτροφίας στα εγγεγραμμένα Μέλη της,
         αφετέρου την πλοήγηση του δικτυακού τόπου και τη χρήση των υπηρεσιών που παρέχονται σε αυτόν χωρίς εγγραφή Μέλους (πχ, υπηρεσίες ενημέρωσης, διαφήμισης, αποστολής newsletter κτλ) (εφεξής οι «λοιπές υπηρεσίες» ),
         και αποτελούν τους νομικά δεσμευτικούς όρους μεταξύ της πλατφόρμας και των επισκεπτών/εγγεγραμμένων Μελών αναφορικά με την Υπηρεσία Online Υποτροφίας και των λοιπών υπηρεσιών που παρέχονται μέσω του δικτυακού τόπου.
         Οι παρόντες Γενικοί Όροι εφαρμόζονται ως ανωτέρω ορίζεται, ανεξαρτήτως ηλεκτρονικού μέσου που ενδέχεται να χρησιμοποιούν οι επισκέπτες και τα Μέλη για την πρόσβασή τους στην Υπηρεσία και στις λοιπές υπηρεσίες της πλατφόρμας Schol.io.',

        '5'=>'Με την πρόσβαση και την πλοήγηση στο δικτυακού τόπο από τον επισκέπτη ή/και την εγγραφή των Χρηστών και των Επιχειρήσεων ως Μέλη στην  Online Υπηρεσία Schol.io, βεβαιώνεται η ανάγνωση, κατανόηση και ανεπιφύλακτη αποδοχή εκ μέρους των επισκεπτών, Χρηστών και των Επιχειρήσεων,
        όπως αυτές νομίμως εκπροσωπούνται, των παρόντων Γενικών Όρων (συμπεριλαμβανομένης της Πολιτικής Προστασίας Προσωπικών Δεδομένων & Cookies και της Πολιτικής Αποδεκτών Χρήσεων ).
        Σε περίπτωση που ο επισκέπτης/ Χρήστης /Επιχείρηση διαφωνεί με οποιονδήποτε όρο ή/και με το σύνολο αυτών, οφείλει να μην κάνει χρήση καμίας εκ των υπηρεσιών της πλατφόρμας που παρέχονται στο Schol.io ή στη Mobile εφαρμογή.
        Οποιαδήποτε χρήση των υπηρεσιών αυτών ή ορισμένων εξ’ αυτών από τα ως άνω πρόσωπα, συνεπάγεται και την ανεπιφύλακτη αποδοχή και συμμόρφωση εκ μέρους τους με τους παρόντες Γενικούς Όρους,
        ενώ κάθε φορά που εισέρχονται στο Schol.io και στην Υπηρεσία μέσω αυτών επιβεβαιώνουν εκ νέου τη συμφωνία τους με τη πλατφόρμα με τους παρόντες Γενικούς Όρους.
        Να σημειωθεί ότι η πλατφόρμα Schol.io δύναται κατά καιρούς να τροποποιήσει ή αντικαταστήσει το σύνολο ή/και μέρος των παρόντων Γενικών Όρων κατά την απόλυτη διακριτική της ευχέρεια ή/και όταν η τροποποίηση/ αντικατάσταση επιβάλλεται από το νόμο, χωρίς προηγούμενη ειδοποίηση.
        Οι τυχόν τροποποιήσεις θα ισχύουν από την ημερομηνία ανάρτησης τους στο δικτυακό τόπο. Οι απλοί επισκέπτες και τα Μέλη θα ενημερωθούν για τυχόν τροποποίηση των παρόντων Γενικών Όρων, κατά την είσοδό τους στο Δικτυακό Τόπο ή στη Mobile εφαρμογή,
        οπότε η συνέχιση της πλοήγησης ή/και η χρήση των υπηρεσιών στο schol.io από τα ως άνω πρόσωπα συνεπάγεται και την αυτόματη και ανεπιφύλακτη αποδοχή των τροποποιημένων Γενικών Όρων εκ μέρους τους.
        Σε περίπτωση που οποιοσδήποτε δε συμφωνεί με τις τροποποιήσεις, οφείλει να μη προβεί σε οποιαδήποτε ενέργεια ή και χρήση των υπηρεσιών της πλατφόρμας,
        δύνανται δε τα Μέλη να ζητήσουν τη διαγραφή του Λογαριασμού τους από την Υπηρεσία ή του email τους από τη λίστα αποστολής των ενημερωτικών newsletters,
        ακολουθώντας τις διαδικασίες που περιγράφονται στο παρόν. Με τη χρήση οποιασδήποτε υπηρεσίας της πλατφόρμας, τα Μέλη/επισκέπτες συναινούν ότι οποιαδήποτε αξίωσή τους κατά οποιουδήποτε τρίτου ή και Μέλους για τυχόν ενέργειες ή/και παραλείψεις τους,
        περιορίζεται στα πρόσωπα αυτά και ουδεμία ευθύνη καταλογίζεται στη πλατφόρμα Schol.io για τις ενέργειες/παραλήψεις των προσώπων αυτών.',



        '6'=>'Η πρόσβαση στην Πλατφόρμα Schol.io είναι ελεύθερη και δωρεάν, εκτός από το κόστος σύνδεσης μέσω των τηλεπικοινωνιακών Υπηρεσιών που σας παρέχει ο πάροχος τηλεφώνου και διαδικτύου της επιλογής σας.
        Η πρόσβαση στην Ιστοσελίδα μας έχει προσωρινό χαρακτήρα. Διατηρούμε το δικαίωμα να καταργήσουμε ή να τροποποιήσουμε χωρίς προηγούμενη ειδοποίηση την Ιστοσελίδα μας (καθώς και να αποσύρουμε ή να τροποποιήσουμε όλα τα Προϊόντα και τις Υπηρεσίες που προσφέρονται εκεί).
        Δεν μπορούμε να θεωρηθούμε υπεύθυνοι για τυχόν μη διαθεσιμότητα της Ιστοσελίδας μας ή οποιουδήποτε μέρους αυτής σε οποιαδήποτε χρονική στιγμή ή για οποιοδήποτε χρονικό διάστημα, όποιος και αν είναι ο λόγος.
        Ενημερώνουμε τακτικά την Ιστοσελίδα μας, το περιεχόμενο της οποίας ενδέχεται να αλλάξει ανά πάσα στιγμή χωρίς προειδοποίηση. Διατηρούμε το δικαίωμα να κλείσουμε, να τροποποιήσουμε ή να αναστείλουμε την Ιστοσελίδα (ή οποιοδήποτε τμήμα της) ανά πάσα στιγμή και χωρίς προειδοποίηση.
        Το υλικό και οι πληροφορίες που δημοσιεύονται στην Ιστοσελίδα μας δεν θα πρέπει να ερμηνεύονται ως συστάσεις ούτε να θεωρούνται ως τέτοιες τις οποίες μπορείτε να εμπιστεύεστε.
        Ως εκ τούτου, στο μέτρο που επιτρέπεται από τους ισχύοντες νόμους, αποποιούμαστε κάθε ευθύνη που προκύπτει από οποιαδήποτε χρήση τέτοιων πληροφοριών. Είναι δική σας η ευθύνη να παράσχετε τις απαραίτητες πληροφορίες για να αποκτήσετε πρόσβαση στην Ιστοσελίδα και να την δείτε,
        καθώς και να διασφαλίσετε ότι έχετε εγκαταστήσει ενημερωμένο λογισμικό προστασίας από ιούς σε όλες τις συσκευές που χρησιμοποιούνται για την πρόσβαση στην Ιστοσελίδα.
        Είναι δική σας η ευθύνη να βεβαιωθείτε ότι όσοι χρησιμοποιούν τη σύνδεσή σας στο διαδίκτυο για να έχουν πρόσβαση στην Ιστοσελίδα μας γνωρίζουν τους Όρους Χρήσης.',

        '7'=>'Δεν επιτρέπεται να χρησιμοποιείτε με ακατάλληλο τρόπο την Ιστοσελίδα : με τη συνειδητή εισαγωγή ιών, trojans, bugs, «λογικές βόμβες», χρονικές βόμβες, καταγραφή πληκτρολόγησης, προγράμματα κατασκοπείας, διαφημιστικό λογισμικό ή άλλα στοιχεία,
        προγράμματα ή κώδικες που επηρεάζουν τη λειτουργία του λογισμικού ή του εξοπλισμού πληροφορικής (ή έχουν σχεδιαστεί με αυτό τον σκοπό) και/ή αποκτώντας ή προσπαθώντας να αποκτήσετε μη εξουσιοδοτημένη πρόσβαση στον διακομιστή που φιλοξενεί την Ιστοσελίδα μας
        ή σε οποιονδήποτε άλλον διακομιστή, υπολογιστή ή βάση δεδομένων που συνδέεται με την Ιστοσελίδα μας, και/ή διακόπτοντας την Υπηρεσία της Ιστοσελίδας μας με μεμονωμένες ή ταυτόχρονες από πολλές πηγές επιθέσεις.
        Θα αναφέρουμε αυτές τις παραβιάσεις στις αρμόδιες δικαστικές αρχές και θα συνεργαστούμε μαζί τους γνωστοποιώντας την ταυτότητά σας. Εάν διαπράξετε αυτές τις παραβιάσεις, θα χάσετε αμέσως το δικαίωμα χρήσης της Ιστοσελίδας μας.',



        '8'=>'Η εγγραφή τόσο των Επιχειρήσεων/Εκπαιδευτικών Ιδρυμάτων όσο και των Χρηστών/Γονέων, Μαθητών & Καθηγητών στην Online Υπηρεσία Schol.io είναι απαραίτητη προϋπόθεση προκειμένου οι μεν Επιχειρήσεις να δημιουργήσουν το Προφίλ τους στην Πλατφόρμα και να προβάλλουν τις υποτροφίες
        και τις υπηρεσίες εκπαίδευσης που παρέχουν αλλά και άλλες σχετικές Πληροφορίες που τις αφορούν, αφετέρου οι Χρήστες να μπορούν να κάνουν πλήρη χρήση της Online Υπηρεσίας Schol.io. Η εγγραφή και η συμμετοχή ως Μέλος ή Επιχείρηση είναι δωρεάν, προσωπική, αμεταβίβαστη και ανεκχώρητη, ενώ για επιπλέον υποτροφίες και ειδικότερες υπηρεσίες παρέχεται προαιρετική μηνιαία συνδρομή.
        Τα Μέλη φέρουν την ευθύνη για τα δεδομένα και στοιχεία που χορηγούν και η Πλατφόρμα Schol.io βασίζεται αποκλειστικώς και μόνον στις δηλώσεις τους αναφορικά με τα δεδομένα και τα στοιχεία τους.
        Τα προσωπικά δεδομένα που τα Μέλη χορηγούν κατά την εγγραφή τους ως Μέλος, η Πλατφόρμα τα επεξεργάζεται σύμφωνα με τους όρους και τις διατάξεις των παρόντων Γενικών Όρων και της Πολιτικής Προστασίας Προσωπικών Δεδομένων της.
        Η εγγραφή του Χρήστη ως Μέλος στην Online Υπηρεσία Schol.io είναι απαραίτητη προκειμένου να κάνει χρήση της. Η διαδικασία εγγραφής είναι γρήγορη και απλή: Αφού ο Χρήστης επιλέξει την υποτροφία που τον ενδιαφέρει συνεχίζει σε online αίτηση αυτής, το σύστημα θα τον καθοδηγήσει αυτόματα στην καρτέλα εγγραφής Νέου Μέλος.
        Εναλλακτικά ο Χρήστης οδηγείται στη φόρμα εγγραφής Νέου Μέλους από την αρχική σελίδα του δικτυακού τόπου.
        Η εγγραφή Νέου Μέλους/Χρήστη μπορεί να γίνει είτε μέσω της προσωπικής σελίδας του Χρήστη στο Facebook ή στη Google, ή με τη συμπλήρωση της φόρμας εγγραφής. Για την εγγραφή του Χρήστη απαιτείται η χορήγηση των παρακάτω προσωπικών του δεδομένων: όνομα και επώνυμο, ισχύουσα διεύθυνση ηλεκτρονικού ταχυδρομείου (email)
        και η αποδοχή εκ μέρους του των παρόντων Γενικών Όρων Χρήσης, και της Πολιτικής Προστασίας Προσωπικών Δεδομένων της Πλατφόρμας.
        Για την εγγραφή μέσω της σελίδας που ενδέχεται να τηρεί ο Χρήστη στο Facebook ή στη Google, η Πλατφόρμα Schol.io θα λάβει από αυτή (σελίδα κοινωνικής δικτύωσης) το όνομα, επίθετο, διεύθυνση ηλεκτρονικού ταχυδρομείου (email), ενώ δε δύναται να αναρτήσει μηνύματα στη σελίδα του Χρήστη στο Facebook.
        Περισσότερες πληροφορίες αναφορικά με το είδος, το σκοπό της επεξεργασίας, τους αποδέκτες των δεδομένων και την άσκηση των δικαιωμάτων των Μελών/Χρηστών αναφορικά με αυτά, περιέχονται στην Πολιτικής Προστασίας Προσωπικών Δεδομένων της Πλατφόρμας.',

        '9'=>'Με την υποβολή της αίτησης εγγραφής, η Πλατφόρμα Schol.io θα αποστείλει ένα μήνυμα ηλεκτρονικού ταχυδρομείου στο δηλωθέν από το Χρήστη e-mail στην αίτηση έγγραφης, το οποίο να ζητά την επιβεβαίωση της εγγραφής του. Μόνο με την επιβεβαίωση της εγγραφής σύμφωνα με τις οδηγίες που παρέχονται στο μήνυμα επιβεβαίωσης της εγγραφής ολοκληρώνεται η εγγραφή του Χρήστη στην Πλατφόρμα Schol.io.
        Με την ολοκλήρωση της εγγραφής του Χρήστη σύμφωνα με τα ανωτέρω, η Πλατφόρμα Schol.io ανοίγει στο Χρήστη δικό του Λογαριασμό Μέλους και Προφίλ (βλ παρακάτω).
        Όλα τα προσωπικά δεδομένα που παρέχετε κατά τη διάρκεια ή μετά τη διαδικασία εγγραφής θα διατηρηθούν και θα χρησιμοποιηθούν σύμφωνα με τα δικαιώματα που σας παραχωρήθηκαν και σύμφωνα με την Πολιτική Προστασίας Προσωπικών Δεδομένων και Cookies.
        Ο Χρήστης θα μπορεί να δημιουργεί έναν μόνο Λογαριασμό Χρήστη, στον οποίο μπορεί να έχει πρόσβαση μέσω του ηλεκτρονικού ταχυδρομείου και του κωδικού πρόσβασής του. Απαγορεύεται ο ίδιος Χρήστης να έχει διάφορους λογαριασμούς χρήστη στην Πλατφόρμα Schol.io (για παράδειγμα, παραποιώντας την ταυτότητά του και χρησιμοποιώντας διαφορετικούς λογαριασμούς ηλεκτρονικού ταχυδρομείου),
        καθώς και δημιουργώντας λογαριασμό για άλλα άτομα, παρόλο που μπορεί χωρίς κανένα πρόβλημα να τους ενημερώσει να χρησιμοποιήσουν την Ιστοσελίδα.
        Αν ένας Χρήστης δημιουργήσει λογαριασμούς παραβιάζοντας οποιοδήποτε από τα παραπάνω (είτε έχει εγγραφεί χρησιμοποιώντας ψεύτικα δεδομένα είτε δεδομένα τρίτων, έχει δημιουργήσει περισσότερους από έναν λογαριασμούς για τον εαυτό του, παραποιώντας την ταυτότητά τους, δημιουργώντας λογαριασμούς για τρίτους κ.λπ.), η Πλατφόρμα Schol.io επιφυλάσσεται του δικαιώματος:
        (i) να αναστείλει την παροχή οποιασδήποτε Υπηρεσίας που παραχωρήθηκε ή αγοράστηκε από τον Χρήστη χωρίς δικαίωμα επιστροφής του ποσού που καταβλήθηκε για την αγορά της
        (ii) να ακυρώσει τους παραπάνω λογαριασμούς, ακυρώνοντας οποιαδήποτε πίστωση μπορεί να έχει δημιουργηθεί σε αυτούς,
        (iii) να απαγορεύσει τη δημιουργία νέων λογαριασμών για τον εν λόγω Χρήστη και/ή να αρνηθεί ή να ακυρώσει την πρόσβασή του στην Πλατφόρμα Schol.io,
        (iv) και, εν πάση περιπτώσει, να αποδώσει στον Χρήστη τυχόν ζημίες που προκλήθηκαν στην Πλατφόρμα Schol.io ως αποτέλεσμα της δόλιας χρήσης του Δικτυακού Τόπου της Πλατφόρμας Schol.io.',

        '10'=>'Διατηρούμε το δικαίωμα να ανακαλέσουμε την εγγραφή στην Ιστοσελίδα ή/και να ακυρώσουμε όλα ή μέρος των δικαιωμάτων του Μέλους. Αποποιούμαστε κάθε ευθύνη για τυχόν απώλεια ή ζημία που προκαλείται από την αδυναμία ενός Μέλους να έχει πρόσβαση στις σελίδες του Δικτυακού Τόπου.
         Έχουμε επίσης το δικαίωμα να απενεργοποιήσουμε ανά πάσα στιγμή όλους τους κωδικούς ταυτοποίησης Χρήστη και τους κωδικούς πρόσβασης που επιλέξατε ή που σας δόθηκαν από εμάς αν θεωρήσουμε ότι δεν συμμορφώνεστε με τους Όρους και τις Πολιτικές μας.
        Όποιος χρησιμοποιεί την Πλατφόρμα Schol.io το πράττει για δικό του λογαριασμό και χωρίς καμία ευθύνη της Πλατφόρμας για τυχόν σφάλματα ή παραλείψεις που ενδέχεται να υπάρχουν στο περιεχόμενο της, ή σε άλλα περιεχόμενα στα οποία μπορείτε να έχετε πρόσβαση μέσω αυτής.
        Συγχρόνως η Πλατφόρμα Schol.io δεν μπορεί να θεωρηθεί υπεύθυνη για τυχόν ζημιές που προκύπτουν από τη χρήση της, ούτε για οποιαδήποτε ενέργεια γίνεται βάσει των πληροφοριών που περιέχονται σε αυτήν.
        Με την αγορά μιας Υπηρεσίας που προσφέρεται από την Πλατφόρμα Schol.io, συμφωνείτε να συμμορφώνεστε με όλες τις απαιτήσεις που η Πλατφόρμα καθορίζει ως απαραίτητες για την σωστή απόδοση της Υπηρεσίας.
        Διαφορετικά, η Πλατφόρμα μπορεί, κατά την κρίση της, να μην σας παράσχει την Υπηρεσία. Ο Χρήστης απαγορεύεται να εκτελεί ενέργειες που ενδέχεται να βλάψουν τη φήμη της Πλατφόρμας Schol.io ή τρίτου μέρους.
        Ο Χρήστης απαλλάσσει από κάθε ευθύνη την Πλατφόρμα Schol.io σε περίπτωση που αυτή ακυρώσει ή αναστείλει τον Λογαριασμό Χρήστη για λόγους παραβίασης των διατάξεων των Όρων και Προϋποθέσεων και ειδικότερα,
        αν ο Χρήστης δεν καταβάλει την τιμή της Υπηρεσίας ή χρησιμοποιεί πλαστούς λογαριασμούς αποδεδειγμένα ή βάσει υποψιών.
        Ο Χρήστης είναι ο μοναδικός και αποκλειστικός υπεύθυνος για τη χρήση της Ιστοσελίδας της Πλατφόρμας Schol.io και του περιεχομένου της και η Πλατφόρμα δεν μπορεί να θεωρηθεί υπεύθυνη για οποιαδήποτε χρήση της Ιστοσελίδας
        κατά παράβαση της ισχύουσας νομοθεσίας. Η Πλατφόρμα Schol.io διατηρεί το δικαίωμα να αρνηθεί την πρόσβαση του Χρήστη στην Ιστοσελίδα της χωρίς να απαιτείται καμία ειδοποίηση, για λόγους οποιασδήποτε παράνομης δραστηριότητας ή παραβίασης των παρόντων όρων και προϋποθέσεων.',



        '11'=>'Η Εγγραφή της Επιχείρησης στην Online Υπηρεσία Schol.io είναι απαραίτητη προϋπόθεση για τη χρήση αυτής. Η διαδικασία είναι εύκολη, γρήγορη και δωρεάν. Η Επιχείρηση θα πρέπει να υποβάλλει στην Πλατφόρμα Schol.io μια αίτηση εγγραφής αφού προηγουμένως συμπληρώσει τα παρακάτω στοιχεία της:
            · - Στοιχεία επιχείρησης (επωνυμία, διακριτικό τίτλο, δραστηριότητα, νομική μορφή, ΑΦΜ, ΔΟΥ),
            · - διεύθυνση έδρας (οδός και αριθμός, ΤΚ, Περιοχή, τηλέφωνα επικοινωνίας),
            · - στοιχεία νομίμου εκπροσώπου (όνομα, επώνυμο, διεύθυνση ηλεκτρονικού ταχυδρομείου) καθώς και έναν κωδικό πρόσβασης της προτίμησής της.
            Με την υποβολή της αίτησης εγγραφής Μέλους θα αποσταλεί από την Πλατφόρμα Schol.io ένα μήνυμα ηλεκτρονικού ταχυδρομείου στη δηλωθείσα από την Επιχείρηση ηλεκτρονική διεύθυνση,
            το οποίο θα ζητά την επιβεβαίωση της εγγραφής της Επιχείρησης. Η εγγραφή της Επιχείρησης ολοκληρώνεται με την επιβεβαίωση εκ μέρους της (δια του νομίμου εκπροσώπου της) της αίτησης εγγραφής της σύμφωνα με τα ανωτέρω.
            Σε περίπτωση που η Επιχείρηση δεν προβεί σε επιβεβαίωση της εγγραφής εντός 48 ωρών από την υποβολή αίτησης εγγραφής της, εκπρόσωπος της Πλατφόρμας Schol.io θα επικοινωνήσει με την Επιχείρηση στα δηλωθέντα από αυτή κατά την αίτηση εγγραφής της στοιχεία επικοινωνίας,
            με σκοπό τη διεκπεραίωση για λογαριασμό της Επιχείρησης της εγγραφής της στην  Online Υπηρεσία σύμφωνα με τα ανωτέρω. Με την ολοκλήρωση της εγγραφής, η Επιχείρηση μπορεί να δημιουργήσει το εταιρικό της προφίλ και να αναρτήσει στην Πλατφόρμα τις Υποτροφίες της, τις υπηρεσίες εκπαίδευσης που παρέχει και τις σχετικές με αυτή και τις υπηρεσίες της πληροφορίες.',

            '12'=>'Με την ολοκλήρωση της εγγραφής στην Online Υπηρεσία Schol.io, ο Χρήστης/Επιχείρηση αποκτά την ιδιότητα του Μέλους. Ως Μέλη αποκτούν Λογαριασμό στην Πλατφόρμα, στον οποίο αποθηκεύονται τα δεδομένα τους και τα στοιχεία τους που δηλώθηκαν κατά τη διαδικασία της εγγραφής.
            Τα δεδομένα και στοιχεία που καταχωρούνται κατά την εγγραφή πρέπει να είναι πλήρη, αληθή και επικαιροποιημένα. Σε περίπτωση που το Μέλος επιθυμεί τυχόν να αλλάξει κάποια από τα δεδομένα του, εισέρχεται στο Λογαριασμό του και αποθηκεύει τα νέα δεδομένα/στοιχεία του.
            Με την εγγραφή του το Μέλος σύμφωνα με τα ανωτέρω, δίνει τη ρητή του συγκατάθεσή για τη συλλογή και επεξεργασία των δεδομένων και των στοιχείων του βάσει των παρόντων Γενικών Όρων και της Πολιτικής Προστασίας Προσωπικών Δεδομένων της Πλατφόρμας,
            τους οποίους Όρους και Πολιτικές δηλώνει ότι έχει διαβάσει, κατανοήσει και αποδέχεται πλήρως και ανεπιφύλακτα. Οποτεδήποτε παρέχεται η δυνατότητα άρσης της συγκατάθεσής για τη συλλογή και επεξεργασία των δεδομένων που το Μέλος έχει χορηγήσει σύμφωνα με τα ανωτέρω, είτε προβαίνοντας σε διαγραφή Μέλους,
            είτε στέλνοντας σχετικό μήνυμα στην Πλατφόρμα στο scholioApp@gmail.com. Οποιαδήποτε στιγμή το Μέλος έχει πρόσβαση στα δεδομένα του ή μπορεί επίσης οποιαδήποτε στιγμή να ζητήσει την άμεση διαγραφή ή διόρθωση τους, (σε περίπτωση που δεν το κάνει το ίδιο το Μέλος μέσω του Λογαριασμού του),
            την προσωρινή μη χρησιμοποίηση τους από την Πλατφόρμα, τη δέσμευση ή μη διαβίβασή τους, αποστέλλοντας σχετικό αίτημα στην ηλεκτρονική διεύθυνση scholioApp@gmail.com. Σε κάθε περίπτωση πάντως τα δεδομένα του Μέλους διατηρούνται από την Πλατφόρμα μόνο για όσο χρόνο αυτό παραμένει εγγεγραμμένο Μέλος της,
            με τη ρητή επιφύλαξη των όσων ρητά ορίζονται στους παρόντες Γενικούς Όρους. Τα δεδομένα του Μέλους δεν ανακοινώνονται σε κανέναν τρίτο για σκοπό πέραν του σκοπού που σαφώς ορίζεται στους παρόντες Γενικούς Όρους και στην Πολιτική Προστασίας Προσωπικών Δεδομένων .
            Αν το Μέλος επιθυμεί τη διαγραφή του Λογαριασμού του, θα πρέπει να αποστείλει στην Πλατφόρμα το σχετικό του αίτημα εγγράφως στην ηλεκτρονική διεύθυνση scholioApp@gmail.com.
            Η Online Υπηρεσία Schol.io θα προβεί σε όλες τις απαραίτητες ενέργειες για τη διαγραφή του Λογαριασμού του εν λόγω Μέλους, το συντομότερο δυνατόν, το αργότερο δε εντός 48 ωρών (λόγω τεχνικών θεμάτων).',

    ],

    'termsOfUse'=>'Όροι Χρήσης',
    'titles'=>[
        'a'=>'I. Γενικά',
        'b'=>'II. Πρόσβαση',
        'c'=>'III. Εγγεγραμμένα Μέλη'
    ],
];
