<?php

return [

        'start' => 'Ξενάγηση',
        'title0' => 'Δημόσια Προβολή',
        'text0' => 'Προβολή τών δημόσιων υπηρεσιών της πλατφόρμας Schol.io',
        'title1' => 'Μαθητές',
        'text1' => 'Παρουσίαση των συνδεδεμένων και μη μαθητών σας.',
        'title2' => 'Καθηγητές',
        'text2' => 'Παρουσίαση των καθηγητών σας.',
        'title3' => 'Σπουδές',
        'text3' => 'Δημιουργία Σπουδών',
        'title4' => 'Φωτογραφίες',
        'text4' => 'Διαχειριστείτε τις φωτογραφιές του δημόσιου προφίλ σας. ',
        'title5' => 'Υποτροφίες',
        'text5' => 'Παρακολουθήστε και διαχειριστείτε τις υποτροφίες σας.',
        'title6' => 'Αιτήσεις',
        'text6' => 'Παρακολουθήστε και διαχειριστείτε τις αιτήσεις των υποτροφιών σας.',
        'title7' => 'Αξιολογήσεις',
        'text7' => 'Παρακολουθήστε τις αξιολογήσεις που έχετε λάβει από μαθητές και γονείς.',

        'titleS' => 'Συντομεύσεις',
        'textS' => 'Προβολή μαθητών, καθηγητών, σπουδών, φωτογραφιών, υποτροφιών, αιτήσεων & αξιολογήσεων.',

        'title8' => 'Ειδοποιήσεις',
        'text8' => 'Παρακολουθήστε τις νέες ειδοποιήσεις για αιτήματα νέων συνδέσων και υποτροφιών.',
        'title9' => '',
        'text9' => '',
        'title10' => '',
        'text10' => '',
        'title11' => '',
        'text11' => '',


    'title12' => 'Πίνακας Ελέγχου',
    'text12' => 'Βασικός πίνακας ελέγχου',
    'title13' => 'Δυναμικο',
    'text13' => 'Μαθητές, Καθηγητές και Αιτήματα Σύνδεσης',
    'title14' => 'Προφίλ',
    'text14' => 'Ρυθμίσεις Προφίλ, Στοιχεία Επικοινωνίας, Διαχείριση Σπουδών & Επιλογή Φωτογραφιών',
    'title15' => 'Υποτροφίες',
    'text15' => '',
    'title16' => 'Αξιολογήσεις',
    'text16' => '',

];
