<?php

use Illuminate\Database\Seeder;

class AdmissionCategoryTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $categories = [
            'Στοιχεία Υποψηφίου',
            'Στοιχεία Επικοινωνίας Μητέρας',
            'Στοιχεία Επικοινωνίας Πατέρα',
            'Στοιχεία Επικοινωνίας Κηδεμόνος',
            'Οικονομικά Στοιχεία Μητέρας',
            'Οικονομικά Στοιχεία Πατέρα',
            'Οικονομικά Στοιχεία Κηδεμόνος',
            'Ικανότητες - Δεξιότητες',
            'Ξένες Γλώσσες',
            'Σημεία Υπεροχής',
            'Προηγούμενες Σπουδές',
            'Έπαινοι - Διακρίσεις',
            'Ενδιαφέροντα - Ασχολίες',
            'Πιστοποιήσεις - Σεμινάρια',
            'Σημειώσεις',
            'Σημειώσεις Εκ. Ιδρύματος',
        ];
    }
}
