<?php

use App\Models\Level;
use Illuminate\Database\Seeder;

class LevelsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        // Αλλαγή: Τμήμα Αρχαρίων, Μέσω και Προχωρημένων σε Α1, Α2, Β1, Β2 κτλ
        $levels = [
            ['id' => 1, 'name' => 'Προπτυχιακές Σπουδές-Bachelor'],
            ['id' => 2, 'name' => 'Επαγγελματικές Σπουδές'],
            ['id' => 1, 'name' => 'Μεταπτυχιακές Σπουδές-Master'],
            ['id' => 3, 'name' => 'Γ Λυκείου'],
            ['id' => 3, 'name' => 'Β Λυκείου'],
            ['id' => 3, 'name' => 'Α Λυκείου'],
            ['id' => 6, 'name' => 'Γ Λυκείου'],
            ['id' => 6, 'name' => 'Β Λυκείου'],
            ['id' => 6, 'name' => 'Α Λυκείου'],
            ['id' => 3, 'name' => 'Γ Γυμνασίου'],
            ['id' => 3, 'name' => 'Β Γυμνασίου'],
            ['id' => 3, 'name' => 'Α Γυμνασίου'],
            ['id' => 7, 'name' => 'Γ Γυμνασίου'],
            ['id' => 7, 'name' => 'Β Γυμνασίου'],
            ['id' => 7, 'name' => 'Α Γυμνασίου'],
            ['id' => 8, 'name' => 'ΣΤ Δημοτικού'],
            ['id' => 8, 'name' => 'Ε Δημοτικού'],
            ['id' => 8, 'name' => 'Δ Δημοτικού'],
            ['id' => 8, 'name' => 'Γ Δημοτικού'],
            ['id' => 8, 'name' => 'Β Δημοτικού'],
            ['id' => 8, 'name' => 'Α Δημοτικού'],
            ['id' => 4, 'name' => 'Τμήμα Αρχαρίων Α1-Α2'],
            ['id' => 4, 'name' => 'Τμήμα Μέσων Β1-Β2'],
            ['id' => 4, 'name' => 'Τμήμα Προχωρημένων C1-C2'],
            ['id' => 10, 'name' => 'Τμήμα Παιδικό-Εφηβικό'],
            ['id' => 10, 'name' => 'Τμήμα Ενηλίκων'],
            ['id' => 10, 'name' => 'Τμήμα Ειδικό - Αγωνιστικό'],
            ['id' => 11, 'name' => 'Τμήμα Αρχαρίων-Κατωτέρα'],
            ['id' => 11, 'name' => 'Τμήμα Μέσων-Μέση'],
            ['id' => 11, 'name' => 'Τμήμα Προχωρημένων-Ανωτέρα'],
            // ['id' => 3, 'name' => 'Κάθε Τάξη'],
            // ['id' => 6, 'name' => 'Κάθε Τάξη'],
            // ['id' => 7, 'name' => 'Κάθε Τάξη'],
            // ['id' => 8, 'name' => 'Κάθε Τάξη'],
            // ['id' => 4, 'name' => 'Κάθε Επίπεδο'],
            // ['id' => 10, 'name' => 'Κάθε Επίπεδο'],
            // ['id' => 11, 'name' => 'Κάθε Επίπεδο'],
            ['id' => 9, 'name' => 'Νήπια'],
            ['id' => 5, 'name' => 'Προπτυχιακές Σπουδές-Bachelor'],
        ];

        foreach ($levels as $level) {
            $studylevel = new Level;
            $studylevel->school_types_id = $level['id'];
            $studylevel->name = $level['name'];
            $studylevel->save();
        }
    }
}
