<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria17 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;



     /*=============== 1 Ανατολικό, Καλαμαριά ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Ανατολικό, Καλαμαριά', 'email' => 'anatoliko@anatoliko.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'anatolikoKalamaria'])->id,
         'address' => 'Κυριακίδου 1, Καλαμαριά',
         'region' => 'Καλαμαριά',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310446816,
         'type_id' => 3,
         'website' => 'anatoliko.edu.gr',
         'approved' => 1,
         'about' => '
              Καθένας μας είναι μοναδικός.
              Έχει διαφορετικά όνειρα, διαφορετικούς στόχους, διαφορετικές ανάγκες. Για τον καθένα μας, η επιτυχία έχει διαφορετικό όνομα. Στα Φροντιστήρια Ανατολικό, κάθε μαθητής και μαθήτρια είναι για εμάς μοναδικός…
              Ο στόχος σου είναι στόχος μας.
              Αν δεν έχεις κατασταλάξει στον στόχο σου, σε βοηθάμε να τον καθορίσεις: με σύγχρονα επιστημονικά εργαλεία, όπως τα online τεστ προσωπικότητας και επαγγελματικών κλήσεων και με συμβουλευτική καθοδήγηση από τον υπεύθυνο σπουδών.
              Οι ανάγκες σου είναι η προτεραιότητά μας.
              Με συστηματική παρακολούθηση από τον Προσωπικό Καθηγητή σου, καταγράφουμε σε συνεχή βάση τις επιδόσεις σου και εντοπίζουμε έγκαιρα τυχόν αδυναμίες. Σε διαρκή συνεννόηση με τους Καθηγητές σου, προτείνουμε το κατάλληλο πρόγραμμα ενίσχυσης και κάλυψης αναγκών, συνδυάζοντας με τον καλύτερο τρόπο το πρόγραμμα του τμήματος με ατομικά υποστηρικτικά μαθήματα.
              Η επιτυχία σου είναι η αποστολή μας.
              Στεκόμαστε δίπλα σου. Μαζί στην προσπάθεια και τις αγωνίες σου, μαζί στις δυσκολίες και στην επιτυχία σου.
              ♦  Διερεύνηση και καθορισμός των στόχων του μαθητή.
              Ο μαθητής συμπληρώνει το ειδικό τεστ προσωπικών κλίσεων και επαγγελματικού προσανατολισμού Horizon της Orientum, μια εξειδικευμένης εταιρείας συμβούλων επαγγελματικού προσανατολισμού. Με βάση τα αποτελέσματα του τεστ και μετά από ανάλυση/συζήτηση με τον μαθητή και τους γονείς καθορίζονται από κοινού οι στόχοι της προετοιμασίας για την Ανώτατη Εκπαίδευση.
              ♦  Διαγνωστικά τεστ.
              Για την καλύτερη αποτύπωση των ιδιαίτερων αναγκών του μαθητή πριν την οριστική ένταξή του στο φροντιστηριακό πρόγραμμα, χρησιμοποιούνται διαγνωστικά τεστ γνώσεων των βασικών αντικειμένων.
              ♦  Ένταξη του μαθητή στην κατάλληλη ομάδα.
              Οι Υπεύθυνοι Σπουδών, με βάση το προφίλ και τα ιδιαίτερα χαρακτηριστικά του μαθητή, τον εντάσσουν στην κατάλληλη ομάδα, στο κατάλληλο τμήμα προετοιμασίας.
              ♦  Εποπτεία της πορείας του μαθητή από τον καθηγητή - Μέντορά του.
              Κάθε μαθητής έχει τον δικό του καθηγητή - Μέντορα, που είναι επιφορτισμένος με την επίβλεψη της πορείας του μαθητή και την άμεση επαφή με τους γονείς για κάθε θέμα που μπορεί να ανακύψει.
              ♦  Πρόγραμμα ενισχυτικών ατομικών μαθημάτων, παράλληλα με τα μαθήματα του τμήματος. Σε συνεργασία Μέντορα με τον μαθητή και τους γονείς του κι εφόσον κριθεί απαραίτητο, είναι δυνατό να προστεθούν ατομικά μαθήματα υποστήριξης για τον μαθητή, είτε για να καλύψει τυχόν κενά προηγουμένων ετών, είτε για να εξασφαλίσει πρόσθετη υποστήριξη σε ειδικά αντικείμενα των μαθημάτων.
              ♦ On-line ενημέρωση γονέων για την πορεία του μαθητή.
              Όλες οι παράμετροι της πορείας του μαθητή είναι συνεχώς στη διάθεση του γονέα: με την υπηρεσία MyAnatoliko έχετε πρόσβαση άμεσα στο κινητό, το laptop, το tablet ή τον υπολογιστή της δουλειάς σας, σε βαθμούς διαγωνισμάτων, απουσίες, σχόλια καθηγητών, συγκριτικά στοιχεία επιδόσεων κτλ.
              ♦  Ατομική συμπλήρωση μηχανογραφικού δελτίου προτιμήσεων ΑΕΙ/ΤΕΙ.
              Κάθε μαθητής συμπληρώνει το μηχανογραφικό του δελτίο μετά τις Πανελλήνιες Εξετάσεις με την υποστήριξη του Υπεύθυνου Σπουδών σε προκαθορισμένο ατομικό ραντεβού.
              Έλα σε έ­να από τα Φροντιστήρια Ανατολικό και κλείσε ραντεβού για να συζητήσουμε.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio', 20);

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/anatoliko.gr/');
     Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/user/AnatolikoFrontistir');



     /*=============== 2 Διαγώνιος, Καλαμαριά ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Διαγώνιος, Καλαμαριά', 'email' => 'niksam208@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'diagoniosKalamaria'])->id,
         'address' => 'Πασαλίδη Ιωάννη 89, Καλαμαριά',
         'region' => 'Καλαμαριά',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310417800,
         'type_id' => 3,
         'website' => 'diagonios-kalamaria.gr',
         'approved' => 1,
         'about' => '
           Φροντιστήρια Διαγώνιος στη Θεσσαλονίκη - Καλαμαριά
           Καλώς ήρθατε στην ανανεωμένη μας ιστοσελίδα, που σκοπό έχει να σας ενημερώνει για τα εκπαιδευτικά δρώμενα και γενικότερα για θέματα της παιδείας.
           Το φροντιστήριό μας, μετά από ΤΡΙΑΝΤΑ(30)ΧΡΟΝΙΑ  συνεχούς πορείας στο χώρο της ιδιωτικής εκπαίδευσης συνεχίζει να προσφέρει στους μαθητές του την αμέριστη βοήθεια και συμπαράσταση στο δύσκολο έργο τους.
           Είμαστε κοντά σας για οτιδήποτε χρειαστείτε ΚΑΙ στον τομέα των Ανθρωπιστικών Σπουδών με μία ομάδα έμπειρων και ικανών φιλολόγων οι οποίοι θα είναι αρωγοί στην πορεία σας προς τα Ανώτατα Εκπαιδευτικά ιδρύματα.
           Πιστεύοντας πως η καλλιέργεια του πνεύματος και της  ψυχής είναι τα στοιχεία εκείνα που διαμορφώνουν και καθορίζουν την ανθρώπινη φύση, οικοδομούμε μια σχέση ζωής με τους μαθητές μας. Μια σχέση που θα οδηγήσει στην ολοκληρωμένη, ηθική και πνευματική μόρφωση. Και όπως είπε ο Σωκράτης:
           “Η παιδεία, καθάπερ ευδαίμων χώρα, πάντα τ’ αγαθά φέρει”. (Η μόρφωση, όπως ακριβώς μια εύφορη γη, φέρνει όλα τα καλά).
           Σωκράτης
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio', 20);

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/%CE%A6%CF%81%CE%BF%CE%BD%CF%84%CE%B9%CF%83%CF%84%CE%AE%CF%81%CE%B9%CE%BF-%CE%94%CE%B9%CE%B1%CE%B3%CF%8E%CE%BD%CE%B9%CE%BF%CF%82-1630990657191454/');




     /*=============== 3 Γράφημα, Συκιές ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Γράφημα, Συκιές', 'email' => 'grafima.thess@gmail.com ', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'grafimaSykies'])->id,
         'address' => 'Κανάρη 27, Συκιές',
         'region' => 'Συκιές',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310208500,
         'type_id' => 3,
         'website' => 'grafima.gr',
         'approved' => 1,
         'about' => '
            Το φροντιστήριο Γράφημα δημιουργήθηκε πριν από 15 χρόνια από καταξιωμένους καθηγητές, οι οποίοι διαθέτουν περισσότερα από 25 χρόνια πολύτιμης διδακτικής εμπειρίας σε κεντρικά φροντιστήρια της Θεσσαλονίκης.
            Με πλούσια εμπειρία, βαθιά γνώση του αντικειμένου και ΞΕΧΩΡΙΣΤΗ μέθοδο οδηγούμε τους μαθητές στην ΕΠΙΤΥΧΙΑ !
            ΦΡΟΝΤΙΣΤΗΡΙΟ ΜΕΣΗΣ ΕΚΠΑΙΔΕΥΣΗΣ για όλες τις ομάδες προσανατολισμού
            Μαθήματα Σχεδίου
            Μαθήματα για τις εξετάσεις των ομογενών ιδιαίτερα και σε μικρά τμήματα.
            ΠΑΝΕΠΙΣΤΗΜΙΑΚΑ , φοιτητικά μαθήματα ΑΕΙ ,ΤΕΙ . Μαθήματα ΕΑΠ , ΑΠΚΥ.
            Εργασίες ΕΑΠ , ΑΠΚΥ , ΑΕΙ , ΤΕΙ .
            Προσφέρουμε μια ολοκληρωμένη πρόταση διδασκαλίας:
            Με ομαδοκεντρική προσέγγιση.
            Αλλά και με εξατομικευμένη στήριξη σε κάθε μαθητή.
            Με δωρεάν βοηθητικό υλικό , που ΑΠΛΟΠΟΙΕΙ και καλύπτει πλήρως τη διδακτέα ύλη των μαθημάτων.
            Με συνεχή έλεγχο της προσπάθειας του μαθητή και τακτική ενημέρωση των κηδεμόνων.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio', 50);

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου','http://grafima.gr/index.php/programata-spoudon/alykeiou');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών','http://grafima.gr/index.php/programata-spoudon/blykeiou');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών','http://grafima.gr/index.php/programata-spoudon/blykeiou');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών','http://grafima.gr/index.php/programata-spoudon/glykeiou');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών','http://grafima.gr/index.php/programata-spoudon/glykeiou');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής','http://grafima.gr/index.php/programata-spoudon/glykeiou');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/grafima.gr/');



     /*=============== 4 Ασλανίδης, Σταυρούπολη ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Μέσης Εκπαίδευσης Ασλανίδης, Σταυρούπολη', 'email' => 'aslanidisfrontistiria@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'aslanidis'])->id,
         'address' => 'Λαγκαδά 293, Σταυρούπολη',
         'region' => 'Σταυρούπολη',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2311244424,
         'type_id' => 3,
         'website' => 'aslanidisfrontistiria.gr',
         'approved' => 1,
         'about' => '
         Γιατί ξεχωρίζουμε:
          - Διδάσκουν κορυφαίοι καθηγητές με πολυετή εμπειρία και σύγχρονες μεθόδους διδασκαλίας.
          - Συνεχής παρακολούθηση της επίδοσης και της προόδου των μαθητών και λεπτομερής ενημέρωση των ιδίων και των γονέων τους.
          - Συνεργασία με εξειδικευμένο ψυχολόγο και ειδικό Σύμβουλο Επαγγελματικού Προσανατολισμού για την καταλληλότερη προετοιμασία των Υποψήφιων των Πανελλαδικών
          - Εξαιρετική προσφορά σε συνεργασία με κορυφαία ομάδα Στίβου της Θεσσαλονίκης προς όλους τους μαθητές του Φροντιστηρίου μας για αθλητική προετοιμασία Υποψηφίων για Στρατιωτικές και Αστυνομικές Σχολές, ΤΕΦΑΑ και Πυροσβεστική σε ασύγκριτη τιμή.
          -Λειτουργούν ειδικά προγράμματα ιδιαίτερων μαθημάτων σε όλα τα μαθήματα Γυμνασίου και Λυκείου για ανεπανάληπτες επιδόσεις
          -Αναλαμβάνουμε το καθημερινό διάβασμα και την προετοιμασία των μαθητών του Δημοτικού σε ολιγομελή τμήματα σχολικής μελέτης.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio', 30);

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/aslanidis.frontistiria/');


     /*=============== 5 Άνοδος, Ηλιούπολη ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Άνοδος, Ηλιούπολη', 'email' => 'info@anodos-edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'anodosHlioupoli'])->id,
         'address' => 'Μακρυγιάννη 47, Ηλιούπολη',
         'region' => 'Ηλιούπολη',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310609200,
         'type_id' => 3,
         'website' => 'anodos-edu.gr',
         'approved' => 1,
         'about' => '
             Αγαπητοί μαθητές,
             Τώρα που φτάσατε στην κυριότερη φάση της μελλοντικής σας πορείας, η εκλογή του κατάλληλου φροντιστηρίου θα πρέπει να σας προβληματίσει.
             Ενισχυμένοι από τις συνεχείς επιτυχίες και από την ποιότητα της δουλειάς μας ευελπιστούμε και στη δική σας συμμετοχή στο φροντιστήριό μας για την επιτυχία σας στις Πανελλαδικές ΕΞΕΤΑΣΕΙΣ
             Με βάση την πολύχρονη εμπειρία μας, κατορθώνουμε ώστε ο κάθε μαθητής να μπορεί να μαθαίνει να διαβάζει σωστά και να σκέφτεται αναπτύσσοντας όχι μόνο τη μνήμη αλλά και την κρίση του.
             Επιτυγχάνουμε άριστη αφομοίωση της ύλης, καλύτερη επίδοση στο σχολείο, τόνωση της αυτοπεποίθησης του μαθητή για τη τελική επιτυχία του στις ΕΞΕΤΑΣΕΙΣ.
             Με ζήλο και πάθος για τη δουλειά μας ξεκινάμε με τις ίδιες αρχές:
             Αυστηρά καθορισμένος αριθμός μαθητών σε κάθε τμήμα.
             Έμπειροι – καταξιωμένοι ειδικοί καθηγητές φροντιστές.
             Ειδικές φροντιστηριακές σημειώσεις για κάθε μάθημα.
             Εβδομαδιαία εξέταση τεστ και διαγωνίσματα.
             Καθιέρωση συχνής επικοινωνίας και συνεργασίας με τους γονείς.
             Ειδική φροντίδα και μέριμνα για τους μαθητές που υστερούν.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio', 20);

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

//     Scholio::portalSocial($fake, 'facebook', '');



     /*=============== 6 Γρηγοριάδης, Εύοσμος ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Γρηγοριάδης, Εύοσμος', 'email' => 'info@grigoriadis.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'grigoriadis'])->id,
         'address' => 'Γοργοποτάμου 22, Νέα Πολιτεία',
         'region' => 'Εύοσμος',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310603643,
         'type_id' => 3,
         'website' => 'grigoriadis.edu.gr',
         'approved' => 1,
         'about' => '
            Καλώς ήρθατε στα Φροντιστήρια Μέσης Εκπαίδευσης Γρηγοριάδη, στον Εύοσμο!
            Φροντιστήρια Εύοσμος ; Φροντιστήρια Μέσης Εκπαίδευσης Γρηγοριάδη με Προτεραιότητα τη Γνώση Σας!
            Δημιουργήσαμε τα Φροντιστήρια Γρηγοριάδη ως μία διαφορετική εκπαιδευτική πρόταση, για εσάς που επιθυμείτε ένα σύγχρονο και αξιόπιστο φροντιστήριο στην τοποθεσία Εύοσμος Θεσσαλονίκης και συγκεκριμένα στην Νέα Πολιτεία.
            Στόχο έχουμε να προσφέρουμε εκπαιδευτικές υπηρεσίες υψηλής ποιότητας σε προσιτές τιμές.
            Επιλέγουμε αποκλειστικά καθηγητές με διδακτορικές ή/και μεταπτυχιακές σπουδές με σκοπό τη δημιουργία ενός κύκλου συνεργατών που κατέχουν άριστα την επιστήμη τους και διαθέτουν ακαδημαϊκή γνώση.
            Πρωτοπορούμε χρησιμοποιώντας στη διδασκαλία εποπτικά μέσα (διαδραστικό πίνακα και βιντεοπροβολέα) τα οποία μετατρέπουν το κλασσικό “μάθημα” σε μία άμεση και αλληλεπιδραστική για το μαθητή διαδικασία.
            Παρέχουμε προγράμματα για Λύκειο, Γυμνάσιο και ΕΠΑΛ
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio', 48);

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου','http://grigoriadis.edu.gr/%CE%B3%CF%85%CE%BC%CE%BD%CE%AC%CF%83%CE%B9%CE%BF/');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου','http://grigoriadis.edu.gr/%CE%B3%CF%85%CE%BC%CE%BD%CE%AC%CF%83%CE%B9%CE%BF/');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου','http://grigoriadis.edu.gr/%CE%B3%CF%85%CE%BC%CE%BD%CE%AC%CF%83%CE%B9%CE%BF/');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου','http://grigoriadis.edu.gr/%CF%80%CF%81%CE%BF%CE%B3%CF%81%CE%AC%CE%BC%CE%BC%CE%B1%CF%84%CE%B1/%CE%B1-%CE%BB%CF%85%CE%BA%CE%B5%CE%B9%CE%BF%CF%85/');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών','http://grigoriadis.edu.gr/%CF%80%CF%81%CE%BF%CE%B3%CF%81%CE%AC%CE%BC%CE%BC%CE%B1%CF%84%CE%B1/%CE%B2-%CE%BB%CF%85%CE%BA%CE%B5%CE%AF%CE%BF%CF%85/');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών','http://grigoriadis.edu.gr/%CF%80%CF%81%CE%BF%CE%B3%CF%81%CE%AC%CE%BC%CE%BC%CE%B1%CF%84%CE%B1/%CE%B2-%CE%BB%CF%85%CE%BA%CE%B5%CE%AF%CE%BF%CF%85/');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών','http://grigoriadis.edu.gr/%CF%80%CF%81%CE%BF%CE%B3%CF%81%CE%AC%CE%BC%CE%BC%CE%B1%CF%84%CE%B1/%CE%B3-%CE%BB%CF%85%CE%BA%CE%B5%CE%AF%CE%BF%CF%85/');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών','http://grigoriadis.edu.gr/%CF%80%CF%81%CE%BF%CE%B3%CF%81%CE%AC%CE%BC%CE%BC%CE%B1%CF%84%CE%B1/%CE%B3-%CE%BB%CF%85%CE%BA%CE%B5%CE%AF%CE%BF%CF%85/');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής','http://grigoriadis.edu.gr/%CF%80%CF%81%CE%BF%CE%B3%CF%81%CE%AC%CE%BC%CE%BC%CE%B1%CF%84%CE%B1/%CE%B3-%CE%BB%CF%85%CE%BA%CE%B5%CE%AF%CE%BF%CF%85/');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/FrontistiriaGrigoriadi/');
     Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/GrigoriadisFro');
     Scholio::portalSocial($fake, 'google-plus', 'https://plus.google.com/+GrigoriadisEduGr');
     Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCDMNFvASVuw2uGhWSLU-mhg');





     /*=============== 7 Δομή, Σταυρούπολη ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Δομή, Σταυρούπολη', 'email' => 'info@domi-edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'domiStayroupoli'])->id,
         'address' => 'Σίνα 17, Σταυρούπολη',
         'region' => 'Σταυρούπολη',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310587070,
         'type_id' => 3,
         'website' => 'domi-edu.gr',
         'approved' => 1,
         'about' => '
             Διδάσκουμε με συγκριτικό πλεονέκτημα στον κάθε μαθητή προσωπικά, αναπληρώνοντας κενά, προσφέροντας χώρο και χρόνο μελέτης εκτός τμήματος.
             Στα Φροντιστήρια ΔΟΜΗ, παρακολουθούμε συστηματικά τη πρόοδο κάθε μαθητή μέσα από τακτικά τεστ σε φύλλα εργασίας.
             Ο Σύμβουλος Σπουδών, σε συνεργασία με τους καθηγητές, μελετά την εκπαιδευτική πορεία κάθε μαθητή και, όπου κρίνεται απαραίτητο, σχεδιάζεται πλάνο βελτίωσης με στόχο τη μεγιστοποίηση της απόδοσής του.
             Στα φροντιστήρια ΔΟΜΗ σας παρέχουμε:
             Ομογενή και ολιγομελή τμήματα με συστηματική παρακολούθηση  στην εκπαιδευτική πορεία κάθε μαθητή.
             Σύμβουλο Σπουδών, ο οποίος σε συνεργασία με τους καθηγητές ενημερώνεται για κάθε μαθητή και, όπου κρίνεται απαραίτητο, σχεδιάζει εξατομικευμένα προγράμματα μελέτης και προκαθορισμένες συναντήσεις συμβουλευτικής υποστήριξης και διερεύνησης δεξιοτήτων.
             Πρόσθετη διδακτική στήριξη σε κάθε μαθητή όπου χρειάζεται, για κάλυψη κενών από προηγούμενα χρόνια.
             Διαρκή έλεγχο του βαθμού αφομοίωσης της ύλης καθημερινά και μέσα από τρίωρα διαγωνίσματα επιπέδου πανελλαδικών εξετάσεων επιβεβαιώνεται βήμα-βήμα η πορεία προς την επιτυχία.
             Διαγωνίσματα  ανά δύο εβδομάδες σε ώρες και ημέρες πέραν του βασικού προγράμματος που μας δίνουν τη δυνατότητα ελέγχου της εμπέδωσης της ύλης που έχει διδαχτεί.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio', 47);

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου','https://domi-edu.gr/%CF%80%CF%81%CE%BF%CE%B3%CF%81%CE%B1%CE%BC%CE%BC%CE%B1%CF%84%CE%B1-%CF%83%CF%80%CE%BF%CF%85%CE%B4%CF%89%CE%BD/%CE%B3%CF%85%CE%BC%CE%BD%CE%B1%CF%83%CE%B9%CE%BF/');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου','https://domi-edu.gr/%CF%80%CF%81%CE%BF%CE%B3%CF%81%CE%B1%CE%BC%CE%BC%CE%B1%CF%84%CE%B1-%CF%83%CF%80%CE%BF%CF%85%CE%B4%CF%89%CE%BD/%CE%B3%CF%85%CE%BC%CE%BD%CE%B1%CF%83%CE%B9%CE%BF/');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου','https://domi-edu.gr/%CF%80%CF%81%CE%BF%CE%B3%CF%81%CE%B1%CE%BC%CE%BC%CE%B1%CF%84%CE%B1-%CF%83%CF%80%CE%BF%CF%85%CE%B4%CF%89%CE%BD/%CE%B3%CF%85%CE%BC%CE%BD%CE%B1%CF%83%CE%B9%CE%BF/');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου','https://domi-edu.gr/%CE%B1-%CE%BB%CF%85%CE%BA%CE%B5%CE%B9%CE%BF%CF%85/');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών','https://domi-edu.gr/%CE%B2-%CE%BB%CF%85%CE%BA%CE%B5%CE%B9%CE%BF%CF%85/');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών','https://domi-edu.gr/%CE%B2-%CE%BB%CF%85%CE%BA%CE%B5%CE%B9%CE%BF%CF%85/');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών','https://domi-edu.gr/%CE%B3-%CE%BB%CF%85%CE%BA%CE%B5%CE%B9%CE%BF%CF%85/');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών','https://domi-edu.gr/%CE%B3-%CE%BB%CF%85%CE%BA%CE%B5%CE%B9%CE%BF%CF%85/');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής','https://domi-edu.gr/%CE%B3-%CE%BB%CF%85%CE%BA%CE%B5%CE%B9%CE%BF%CF%85/');





     /*=============== 8 Φροντιστήρια Επιλέγειν ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Επιλέγειν Νεοχωρούδα', 'email' => 'epilegein@hotmail.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'epilegein'])->id,
         'address' => 'Ι.Ν. Αγίου Νικολάου, Νεοχωρούδα',
         'region' => 'Νεοχωρούδα',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310787550,
         'type_id' => 3,
         'website' => 'facebook.com/frontistirioepilegein',
         'approved' => 1,
         'about' => '
             Νέο Φροντιστήριο στη Νεοχωρούδα,Θεσσαλονίκης
            ',
         'background' => $background,
     ]);

     new Portal($fake, 8, 'frontistirio', 30);

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistirioepilegein/');



     /*=============== 9 Επιστημονικό Σαχπεκίδη Τούμπα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Επιστημονικό Σαχπεκίδη Τούμπα', 'email' => 'info@epistimoniko.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'epistimoniko'])->id,
         'address' => 'Γρηγορίου Λαμπράκη 214, Τούμπα',
         'region' => 'Άνω Τούμπα',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310950127,
         'type_id' => 3,
         'website' => 'epistimoniko.gr',
         'approved' => 1,
         'about' => '
             Λίγα λόγια για τον μικρό αλλά θαυματουργό κόσμο του φροντιστηρίου μας...
             Η παιδεία είναι ένα κομμάτι της ζωής μας και αυτήν υπηρετούμε εδώ και 45 χρόνια. Ως φροντιστές, φροντίζουμε με αγάπη και σεβασμό, ώστε οι έφηβοι που έρχονται κοντά μας να κάνουν τα όνειρά τους πραγματικότητα. Εδώ, στο δεύτερο σπίτι τους, το φροντιστήριο!
             Σπουδάζουμε γιατί το πνεύμα μας θέλει τροφή και η προσωπικότητά μας θέλει να ανθίσει. Οι σπουδές στο πανεπιστήμιο είναι όσο ποτέ άλλοτε απαραίτητες. Η σημασία τους όμως δεν εξαντλείται στην αξία που έχουν τα πτυχία στην αγορά εργασίας.
             Πολλές φορές τα παιδιά στη διάρκεια της σχολικής τους πορείας χάνουν το ενδιαφέρον τους για το διάβασμα, απαξιώνουν τις σπουδές και εγκαταλείπουν τα παιδικά τους όνειρα. Ξεχνάνε ακόμα και τα ενδιαφέροντά τους, τα πράγματα που τους δίνουν χαρά και ικανοποίηση. Στόχος μας είναι όλα αυτά να τα ξυπνήσουμε και να τα αξιοποιήσουμε. Ό, τι μπορεί να κάνει ένα παιδί με πάθος, θα μας δείξει το δρόμο προς την επιτυχία, γιατί όχι και προς την ευτυχία.
             Δίνουμε στα παιδιά μας κίνητρο, έμπνευση, υποστήριξη. Έχουν ανάγκη να τα ακούσουμε, να τα σεβαστούμε και να γίνουμε συνοδοιπόροι και όχι καθοδηγητές τους σε αυτό τους το ταξίδι. Γιατί όταν τους δείχνουμε εμπιστοσύνη, κάνουν θαύματα!
             Διδάσκουμε την αξία του λόγου, της έκφρασης και την τέχνη της επιχειρηματολογίας (Γλώσσα), την αξία της ιστορικής μνήμης και γνώσης (Ιστορία), την αξία του πολιτισμού, της φιλοσοφίας και του πολιτικού ήθους των αρχαίων προγόνων μας (Αρχαία), την αξία της σχέσης μας με το περιβάλλον και το σώμα μας (Βιολογία), την αξία ενός κοφτερού μυαλού που παίζει με τους αριθμούς (Μαθηματικά), για να καλλιεργήσουμε στους μαθητές μας ένα γνήσιο ενδιαφέρον για τα όλα μαθήματα.
             Η κατανόηση και η εμβάθυνση είναι τα κλειδιά, για να ξεχωρίσουν με την ποιότητα του διαβάσματός τους και να κατακτήσουν πολύ υψηλές επιδόσεις. Σκοπός μας είναι να φτάσει κάθε μαθητής στο μέγιστο των δυνατοτήτων του, κάνοντας τον αγώνα του με τις δυνάμεις που διαθέτει και χωρίς υπερβολές, σε ένα ζεστό, οικογενειακό περιβάλλον. Πάνω απ\' όλα η προετοιμασία μας γίνεται με θετική διάθεση και υγεία.
             Η απόλυτη εξειδίκευσή μας στο πεδίο των θεωρητικών και ανθρωπιστικών σπουδών και η μακρόχρονη παράδοση του φροντιστηρίου, μας δίνουν ένα ασυναγώνιστο πλεονέκτημα, και γι\' αυτό είχαμε την τιμή να σταθούμε δίπλα σε χιλιάδες μαθητές, κερδίζοντας έτσι την αναγνώριση όλου του εκπαιδευτικού κόσμου της πόλης μας. Και συνεχίζουμε. Δίπλα στα ανήσυχα πνεύματα των εφήβων μας...
             Εμπιστευτείτε μας και θα είμαστε μαζί σας μέχρι την επιτυχία!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio', 50);

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');





     /*=============== 10 Επιτομή Εύοσμος ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Επιτομή Εύοσμος', 'email' => 'epitomi2010@yahoo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'epitomi'])->id,
         'address' => 'Μεγ. Αλέξάνδρου 63, Εύοσμος',
         'region' => 'Εύοσμος',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310758658,
         'type_id' => 3,
         'website' => 'https://www.facebook.com/%CE%A6%CF%81%CE%BF%CE%BD%CF%84%CE%B9%CF%83%CF%84%CE%AE%CF%81%CE%B9%CE%BF-%CE%9C%CE%AD%CF%83%CE%B7%CF%82-%CE%95%CE%BA%CF%80%CE%B1%CE%AF%CE%B4%CE%B5%CF%85%CF%83%CE%B7%CF%82-%CE%95%CE%A0%CE%99%CE%A4%CE%9F%CE%9C%CE%97-166468506725691/',
         'approved' => 1,
         'about' => '
              Σας υποδεχόμαστε στα φροντιστήρια μας προσφέροντας έκπτωση 30% στα δίδακτρα όλων των τάξεων του Λυκείου για τη νέα σχολική χρονιά.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio', 15);

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/%CE%A6%CF%81%CE%BF%CE%BD%CF%84%CE%B9%CF%83%CF%84%CE%AE%CF%81%CE%B9%CE%BF-%CE%9C%CE%AD%CF%83%CE%B7%CF%82-%CE%95%CE%BA%CF%80%CE%B1%CE%AF%CE%B4%CE%B5%CF%85%CF%83%CE%B7%CF%82-%CE%95%CE%A0%CE%99%CE%A4%CE%9F%CE%9C%CE%97-166468506725691/');






    }



}
