<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria9 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;




        /*=============== 1  Υποδομή Αγ. Πρασκευή ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Υποδομή Αγ. Πρασκευή', 'email' => 'info@upodomi.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'upodomi'])->id,
            'address' => 'Λ. Μεσογείων 406, Αγ. Παρασκευή',
            'city' => 'Αθήνα',
            'phone' => 2106392203,
            'type_id' => 3,
            'website' => 'upodomi.gr',
            'approved' => 1,
            'about' => '
            Τα Φροντιστήρια Υποδομή από το 1991 έχουν βοηθήσει εκατοντάδες μαθητές να επιτύχουν τους στόχους και τα όνειρά τους. Με έμπειρο και εξειδικευμένο επιτελείο καθηγητών που στέκεται δίπλα στο μαθητή και μάχεται μαζί του για το όραμά του και με Διεύθυνση σπουδών που αφήνει το γραφείο της διοίκησης, για να ασκήσει το λειτούργημα του Δασκάλου, προετοιμάζει τα παιδιά με επιμονή και υπομονή, ώστε να πετύχουν τους στόχους που έχουν θέσει.
            Η πορεία μας έχει στηριχτεί στη θέληση, το μεράκι και την αγάπη που τρέφουμε για το αντικείμενό μας και οφείλεται, κυρίως, στη χαρά που εισπράττουμε με την επιτυχία του κάθε μαθητή μας.
            Τα Φροντιστήρια Υποδομή παρέχουν αφενός τις υπηρεσίες ενός μεγάλου και οργανωμένου φροντιστηρίου και αφετέρου  την ανθρώπινη προσέγγιση του μαθητή.
            Στα Φροντιστήρια Υποδομή ο μαθητής θα βρει πλήρη υλικοτεχνική και εκπαιδευτική υποστήριξη.
            Με προσεγμένα βιβλία σημειώσεων, γραμμένα από τους καθηγητές μας, απόσταγμα της πολυετούς διδακτικής εμπειρίας μας.
            Με πρόγραμμα σπουδών που ανταποκρίνεται στις ανάγκες των μαθητών μας, οι οποίοι κατατάσσονται σε ολιγομελή και απόλυτα ομοιογενή τμήματα.
            Με μελετημένο, ετήσιο πρόγραμμα διαγωνισμάτων ώστε να αφομοιώνεται η ύλη, να εξασκούνται οι μαθητές σε πραγματική προσομοίωση των εξετάσεων, αλλά  και να διαπιστώνονται έγκαιρα, ώστε να αντιμετωπίζονται τυχόν κενά.
            Με άρτια καταρτισμένους, στο αντικείμενο που διδάσκουν, καθηγητές.
            Στα Φροντιστήρια Υποδομή ο μαθητής θα βρεθεί σ\'ένα σύγχρονο περιβάλλον, διαμορφωμένο στις απαιτήσεις της  εποχής, εξοπλισμένο με όλες τις νέες διαδραστικές τεχνολογίες.
            Δεν στεκόμαστε, όμως, μόνο σε αυτά.
            Κύριο μέλημά μας είναι η παιδαγωγική προσέγγιση του μαθητή, τον οποίο θεωρούμε ξεχωριστή προσωπικότητα και οντότητα, με ιδιαίτερες κλίσεις και ταλέντα.
             Έτσι, στεκόμαστε δίπλα του, οργανώνοντας τη μελέτη του και στηρίζοντας τον ψυχολογικά καθ’ όλη τη διάρκεια της φοίτησής του.
            Θέλουμε ο μαθητής να νιώθει ότι είμαστε συμπαραστάτες και συνοδοιπόροι του.
            Στα παραπάνω κρίσιμο ρόλο παίζει η επικοινωνία και η συνεργασία με τους γονείς.
            Πέρα από τις τρεις προγραμματισμένες ενημερώσεις, που οργανώνονται από το Φροντιστήριό μας στη διάρκεια της χρονιάς, ο γονιός μπορεί να ενημερώνεται, όποτε αυτός επιθυμεί, από τους διδάσκοντες για τις επιδόσεις του παιδιού του, με προσωπικά ραντεβού που μπορεί να κλείσει στη γραμματεία μας.
            Παράλληλα, εμείς από την πλευρά μας προβαίνουμε σε ενημέρωση του γονιού, όταν το κρίνουμε απαραίτητο, ώστε να επιλύσουμε τυχόν προβλήματα έγκαιρα.
            Στα Φροντιστήρια  Υποδομή μεγάλη βαρύτητα δίνουμε στον επαγγελματικό προσανατολισμό των μαθητών μας, καθώς θεωρούμε ότι η προσπάθεια που καταβάλλουν θα πρέπει να συνδυαστεί με τη σωστότερη επιλογή σχολής. Επιλογή που θα είναι απόλυτα ταιριαστή στα θέλω και στις δεξιότητες του παιδιού, ενώ παράλληλα θα ανοίγει τις πόρτες για το μέλλον που ονειρεύεται το ίδιο και οι γονείς του.
            Εδώ και αρκετά χρόνια συνεργαζόμαστε στον τομέα αυτό με την ΟRIENTUM, μια από τις πλέον έγκυρες εταιρείες συμβούλων Επαγγελματικού Προσανατολισμού στη χώρα μας. Σε συνεργασία μαζί τους, κάθε χρόνο διοργανώνουμε δωρεάν,  ημερίδα, στην οποία οι μαθητές μας και οι γονείς τους  πληροφορούνται για όλα τα νέα δεδομένα στο χώρο της Τριτοβάθμιας Εκπαίδευσης και της αγοράς εργασίας.
            Ταυτόχρονα, δίνουμε τη δυνατότητα στους μαθητές μας να κάνουν Τεστ Επαγγελματικού Προσανατολισμού, ώστε να αποκτήσουν πιο ολοκληρωμένη εικόνα για τις επιλογές που τους ταιριάζουν.
            Εμείς στην Υποδομή δίνουμε πολύ μεγάλη σημασία στη συμπλήρωση του μηχανογραφικού δελτίου των μαθητών μας, που συμμετέχουν στις Πανελλαδικές εξετάσεις.
            Αφού ανακοινωθούν τα αποτελέσματα, η Διεύθυνση Σπουδών, σε κατ’ιδίαν συνάντηση με το μαθητή και τους γονείς του αφιερώνει όσο χρόνο απαιτείται, ώστε να επιλυθούν απορίες, να ιεραρχηθούν σωστά οι στόχοι και να αποφευχθούν λάθη.
            Δεν ξεχνάμε φυσικά ότι οι μαθητές μας είναι...παιδιά. Έφηβοι στην μεγάλη τους πλειοψηφία οι οποίοι έχουν ανάγκη να αποφορτίζονται από την πίεση της μαθητικής τους καθημερινότητας, και εμείς προσπαθούμε να τους δώσουμε ευκαιρίες για κάτι τέτοιο.
            Θεσμός είναι πλέον ο μεγάλος Χριστουγεννιάτικος χορός μας, όπως και η διοργάνωση αγώνων ποδοσφαίρου ανάμεσα στα δυο μας εκπαιδευτήρια. Πρωτοπόρες ιδέες μαθητών μας, έχουν βρει θετική ανταπόκριση από τους ανθρώπους της Υποδομής, όπως οι δύο συναυλίες που έχουν διοργανωθεί στους χώρους μας.
            Στο πρόγραμμα είναι πάντα και εκπαιδευτικές εκδρομές, όπως αυτές στο μουσείο της Ακρόπολης ή η επίσκεψη των μαθητών μας της Α\'Λυκείου στο Πλανητάριο.
            Μεγάλη και αναγνωρίσιμη είναι η κοινωνική δράση των Φροντιστηρίων μας.
            Στην Υποδομή, συναισθανόμενοι τη δύσκολη θέση στην οποία έχει βρεθεί η Ελληνική οικογένεια τα τελευταία χρόνια, έχουμε προσαρμόσει τα δίδακτρά μας, ώστε αυτά να είναι προσιτά και να μην στερούνται οι μαθητές την ευκαιρία να έχουν ουσιαστική βοήθεια στην προσπάθεια που καταβάλλουν ώστε, μέσα από τη μόρφωση να ανοίξουν καλύτερες προοπτικές.
            Παράλληλα, ειδικές τιμές έχουν θεσπιστεί για τις τρίτεκνες και πολύτεκνες οικογένειες, όπως επίσης και για τις οικογένειες που έχουν αδέλφια στο Φροντιστήριό μας.
            Πιστεύοντας ότι η νεολαία μας πρέπει να βρίσκει υγιείς διεξόδους ενασχόλησης, στηρίζουμε με τις ετήσιες χορηγίες μας, αθλητικούς συλλόγους, όπως ο  ΠΗΓΑΣΟΣ ΑΓ.ΠΑΡΑΣΚΕΥΗΣ και η ΑΕ ΓΑΛΑΤΣΙΟΥ.
            Ιδιαίτερης δε, αναγνώρισης έτυχε η συγκέντρωση τροφίμων που επιχειρήσαμε με μεγάλη επιτυχία, για το ΧΑΜΟΓΕΛΟ ΤΟΥ ΠΑΙΔΙΟΥ.
            Στα Φροντιστήρια Υποδομή ο κάθε μαθητής, σε οποιαδήποτε τάξη, είναι, ο καθένας ξεχωριστά, το κέντρο στο "μικρόκοσμό" μας. Για όλους εμάς, η εμπιστοσύνη με την οποία μας περιβάλλουν τα παιδιά και οι οικογένειές τους μετατρέπεται σε αίσθημα ευθύνης το οποίο αποτελεί παράλληλα, στάση ζωής.
            Στόχος μας είναι τόσο ο μαθητής όσο και οι γονείς να νιώθουν ότι έχουν κοντά τους ανθρώπους ικανούς να τους βοηθήσουν πραγματικά και ουσιαστικά.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 13, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/upodomi.gr');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/upodomi');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/upodomigr');



        /*=============== 2 Περαντινός  ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Περαντινός', 'email' => 'frontistirioperantinos@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'perantinos'])->id,
            'address' => 'Κων. Παλαιολόγου 14, Ν.Σμύρνη',
            'city' => 'Αθήνα',
            'phone' => 2109310606,
            'type_id' => 3,
            'website' => 'perantinos.gr',
            'approved' => 1,
            'about' => '
                Ο Γιάννης Περαντινός Φυσικός του Α.Π.Θ. από το 1986 είναι φροντιστής. Στα τριάντα χρόνια δουλειάς συνεργάστηκε με πολλά φροντιστήρια στο κέντρο της Αθήνας και της περιφέρειας σαν εργαζόμενος καθηγητής αλλά και σαν μέτοχος. Το 1994 ιδρύει το φροντιστήριο Πρωτόνιο. Το 2000 ιδρύει το φροντιστήριο ΠΕΡΑΝΤΙΝΟΣ Γ. Στην Νέα Σμύρνη όπου σήμερα με την βοήθεια των παιδιών του Παντελή απόφοιτου Φ.Μ.Σ. του ΕΚΠΑ Γιώργου τελειόφοιτου τμήματος φυσικής του ΕΚΠΑ και Ίριδας στατιστική στο ΟΠΑ. Και με ένα επιτελείο έμπειρων και ειδικευμένων καθηγητών μέχρι σήμερα συνεχίζει να προσφέρει ποιοτική εκπαίδευση. Στα 30 χρόνια διδασκαλίας χιλιάδες σημερινοί επιστήμονες ήταν μαθητές μας.
                Η Διδασκαλία για μας είναι μεράκι και λειτούργημα
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistirioperantinos');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 3 Το Σύμβολο  ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Το Σύμβολο', 'email' => 'm68@tosymbolo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'tosymbolo'])->id,
            'address' => 'Μακρυγιάννη 68, Μοσχάτο',
            'city' => 'Αθήνα',
            'phone' => 2109425181,
            'type_id' => 3,
            'website' => 'tosymbolo.gr',
            'approved' => 1,
            'about' => '
                Οι μαθητές μας, δίνουν εξετάσεις μία φορά το χρόνο. Εμείς καθημερινά από το 1972! Δίνουμε τις δικές μας εξετάσεις ποιότητας, αξιοπιστίας και επαγγελματισμού.
                Σε κάθε διδακτική μας ώρα, σε κάθε διαγώνισμα προετοιμασίας, σε κάθε μας απάντηση στα ερωτήματα των μαθητών μας, σε κάθε μηχανογραφικό που συμπληρώνουμε μαζί, πρέπει να αποδεικνύουμε ένα και μόνο πράγμα. Την ποιότητα που συνοδεύει τις υπηρεσίες διδασκαλίας των Φροντιστηρίων Μέσης Εκπαίδευσης «το Σύμβολο».
                Αυτή η ποιότητα πηγάζει από τον κυριότερο κρίκο στην αλυσίδα της μάθησης. Τον ανθρώπινο παράγοντα.
                Έχουμε επενδύσει πολλά σε υλικοτεχνικές υποδομές, αλλά περισσότερο από τα εκπαιδευτικά μέσα, έχουμε δώσει έμφαση στο εκπαιδευτικό μας προσωπικό, με το οποίο έχουμε μακρόχρονη συνεργασία. Στους ανθρώπους δηλαδή που γονείς και μαθητές εμπιστεύονται τους στόχους και τα όνειρά τους.  Άνθρωποι με πολύχρονη εκπαιδευτική και παιδαγωγική εμπειρία. Άνθρωποι που ξέρουν να βρίσκονται όχι μόνο απέναντι από τα μαθητικά θρανία σαν καθηγητές, αλλά και δίπλα σε αυτά, σαν συμμαθητές των παιδιών.
                Πίσω από κάθε μελλοντικό πτυχίο που επιθυμεί να κατακτήσει και κατακτά κάποιος μαθητής μας, υπάρχει και το πρόσωπο που με τις γνώσεις και το πάθος του, βοήθησε στην κατάκτηση αυτού του στόχου.
                Tο πρόσωπο κάποιου καθηγητή μας.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 4  Γραμματούπολη ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Δημιουργ. Απασχ. Γραμματούπολη', 'email' => 'info@grammatoupoli.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'grammatoupoli'])->id,
            'address' => 'Ευριπίδου 41-45, Πειραιάς',
            'city' => 'Αθήνα',
            'phone' => 2104224588,
            'type_id' => 12,
            'website' => 'grammatoupoli.gr',
            'approved' => 1,
            'about' => '
                Η Γραμματούπολη δημιουργήθηκε μέσα από την τεράστια αγάπη μας για τα παιδιά και τους νέους!
                Δημιουργήθηκε μέσα από τον απρόσκοπτο αγώνα δύο γονέων να δώσουν στα παιδιά τους τα κατάλληλα εφόδια για το μέλλον, μέσα από την ισχυρή μας θέληση και επιθυμία ως γονείς να μεταδώσουμε στα παιδιά μας γνώσεις και δεξιότητες, να τους παρέχουμε όλα εκείνα τα απαραίτητα πνευματικά εφόδια, να καμαρώσουμε τα παιδιά μας άξιους ανθρώπους και επιτυχημένους επαγγελματίες!
                Αυτή είναι και η φιλοσοφία μας!
                Μάθηση, Γνώση και Κοινωνικοποίηση, ένας ιδανικός συνδυασμός που επιτρέπει σε κάθε μαθητή να μάθει και να κατανοήσει την έννοια της ομαδικότητας και της υπευθυνότητας, την έννοια της συνεργασίας και της δημιουργίας, να καλλιεργήσει τις προσωπικές του δεξιότητες και να εμπλουτίσει τις γνώσεις του! Ένας ιδανικός συνδυασμός γνώσης και μάθησης σε ένα δημιουργικό, παραμυθένιο περιβάλλον που ηρεμεί και διασκεδάζει, με έμπειρο εξειδικευμένο παιδαγωγικό προσωπικό που εμπνέει με το παράδειγμα και την γνώση του τους μικρούς και μεγάλους φίλους μας!
                Η κατάκτηση γνώσεων παράλληλα με την ανάπτυξη της κοινωνικοποίησης, της συνεργασίας και της αλληλεγγύης είναι άρρηκτα συνδεδεμένη με την φιλοσοφία μας!
                Η άψογη και συνεχής συνεργασία με τους γονείς όλων των μαθητών μας είναι άρρηκτα συνδεδεμένη με την αγάπη μας για τα παιδιά.
                Η παροχή συμβουλευτικών λύσεων και προτάσεων σε κάθε ιδιαίτερη περίπτωση μικρών και μεγάλων είναι συνυφασμένη με την θέληση μας να προσφέρουμε έγκυρα και έγκαιρα κάθε δυνατή υποστήριξη, είναι συνυφασμένη με το όραμα μας.
                Η επαγγελματική κατάρτιση των νέων και κάθε ενήλικα με τις κατάλληλες πιστοποιημένες γνώσεις πληροφορικής, αδιαμφισβήτητο ανταγωνιστικό πλεονέκτημα σήμερα στην αγορά εργασίας,  είναι για εμάς, όχι απλά υπόσχεση, αλλά κυρίως δέσμευση.
                Κινητήριος δύναμη μας Η τεράστια αγάπη μας για τα παιδιά και τον άνθρωπο!
                Δέσμευση μας.. Ο εμπλουτισμός των γνώσεων μικρών και μεγάλων και η ολοκληρωμένη προετοιμασία και κατάκτηση γνώσεων!
                Φιλοσοφία μας… Να καλλιεργήσουμε ανθρώπους αξίας, που θα γίνουν αύριο άνθρωποι επιτυχίας!
                Γίνετε και εσείς κομμάτι αυτής της φιλοσοφίας! Σας περιμένουμε!
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'kdap');

        Scholio::portalStudy($fake, 'Δημοτικό', 'Δημιουργική Απασχόληση', 'Προγράμματα εκπαιδευτικών παιχνιδιών');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δημιουργική Απασχόληση', 'Θεατρικό εργαστήρι');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δημιουργική Απασχόληση', 'Μουσικοκινητική αγωγή');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δημιουργική Απασχόληση', 'Εργαστήρι δημιουργικής έκφρασης');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Grammatoupoli');



        /*=============== 5  Ρόμβος Αργυρούπολη ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Ρόμβος Αργυρούπολη', 'email' => 'romvok@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'romvok'])->id,
            'address' => 'Κύπρου 51, Αργυρούπολη',
            'city' => 'Αθήνα',
            'phone' => 2109941471,
            'type_id' => 3,
            'website' => 'romvos.edu.gr',
            'approved' => 1,
            'about' => '
                    Στο τέλος της δεκαετίας του 1970, ένα μικρό συνοικιακό φροντιστήριο τριών (3) αιθουσών, που έφερε το όνομα «ΡΟΜΒΟΣ» και βρισκόταν στην περιοχή της Αργυρούπολης (Φλέμιγκ 1), αγοράστηκε από τους μαθηματικούς, Γιάννη Τσαρπαλή και Βασίλη Δριμιλή.
                    Ο «ΡΟΜΒΟΣ», λοιπόν, ξεκίνησε στις αρχές της δεκαετίας του 1980 στην Αργυρούπολη, με στόχο να προσφέρει Φροντιστηριακή  Εκπαίδευση υψηλού επιπέδου στους μαθητές της ευρύτερης περιοχής που στόχευαν στην εισαγωγή τους σε ΑΕΙ- ΤΕΙ.
                    Ο ΕΚΠΑΙΔΕΥΤΙΚΟΣ ΟΡΓΑΝΙΣΜΟΣ «ΡΟΜΒΟΣ»  σηματοδότησε την έναρξη μιας νέας εποχής στα εκπαιδευτικά δεδομένα της Νότιας Αθήνας. Η συστηματική και οργανωμένη προσπάθεια, οι υψηλοί στόχοι, η επιλογή άξιων συνεργατών, η εφαρμογή πρωτοποριακών προγραμμάτων σπουδών συνετέλεσαν σε μια εντυπωσιακά ανοδική πορεία, που είχε σαν αποτέλεσμα την επέκταση των δραστηριοτήτων του από το 1993 και στην περιοχή της Ηλιούπολης. Ενώ από το 2013 δριαστηριοποιούμαστε ενεργά και στις περιοχές της Γλυφάδας, της Βάρης, της Βούλας και της Βουλιαγμένης με το νέοτερο διδακτήριο μας που άνοιξε τις πόρτες του στην Γλυφάδα επεκτείνοντας κι άλλο το ΡΟΜΒΟ και μεταδίδοντας ακόμα πιο μκαριά τη γνωστή σε όλους "Μέθοδο Επιτυχίας"
                    Εδώ και 36 επιτυχημένα χρόνια ο οργανισμός μας αναπτύχθηκε όχι μόνο ποσοτικά, αλλά πάνω από όλα ποιοτικά. Γνωρίζουμε ότι οι απαιτήσεις συνεχώς αυξάνονται, και για το λόγο αυτό χρησιμποιώντας ένα  ειδικό σύστημα δεικτών αποτελεσματικότητας, καταφέραμε να αξιολογούμε τα αποτελέσματα της δουλειάς μας, με αποτέλεσμα  να έχουμε φτάσει όχι απλά σε υψηλότατα ποσοστά επιτυχίας, αλλά και σε επίτευξη επιτυχίας των μαθητών στις πρώτες σχολές επιθυμίας (πάνω από το 80% των μαθητών επιτυγχάνουν στις πρώτες σχολές επιθυμίας τους).
                    Το όνομα «ΡΟΜΒΟΣ» αντιπροσωπεύει τον μεγαλύτερο και αρτιότερο Εκπαιδευτικό Οργανισμό της Νότιας Αθήνας που διεξάγει πολλαπλές δραστηριότητες, οι οποίες απευθύνονται τόσο σε μαθητές όσο και σε ενήλικες.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalStudy($fake, 'Πανεπιστημιακό Φροντιστήριο', 'Προπτυχιακά', 'Φοιτητικά Μαθήματα');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');


        /*=============== 6  Συμμετρία Ζωγράφου ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Συμμετρία Ζωγράφου', 'email' => 'zografou@simmetria.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'simmetria'])->id,
            'address' => 'Αγίου Θεράποντος 2, Ζωγράφου',
            'city' => 'Αθήνα',
            'phone' => 2107473800,
            'type_id' => 3,
            'website' => 'simmetria.edu.gr',
            'approved' => 1,
            'about' => '
                    Δωρεάν ενισχυτική διδασκαλία
                    Προσδιορίζονται οι αδυναμίες κάθε μαθητή και καθορίζεται επιπλέον διδασκαλία σε ατομικό ή σε ομαδικό επίπεδο
                    για τη κάλυψη των κενών.
                    Ενημερώσεις γονέων και κηδεμόνων
                    Η αξιολόγηση των μαθητών πραγματοποιείται σε εβδομαδιαία βάση .
                    Η ενημέρωση των γονέων και των κηδεμόνων γίνεται άμεσα με πολλές προγραμματισμένες συναντήσεις,
                    με έκτακτα ραντεβού και συχνές τηλεφωνικές επικοινωνίες.
                    Επαγγελματικός προσανατολισμός
                    Ετήσια διοργάνωση ημερίδας επαγγελματικού προσανατολισμού με ομιλητές ειδικούς επιστήμονες στα θέματα σύνδεσης
                    των πανεπιστημίων με την αγορά εργασίας .

                    Εβδομαδιαία Test
                    Εβδομαδιαία αξιολόγηση με 5λεπτα test στην παραδοτέα ύλη
                    και επανάληψη της διαδικασίας σε περίπτωση ανεπαρκών
                    αποτελεσμάτων

                    Διαγωνίσματα υψηλών απαιτήσεων
                    Πολλοί κύκλοι διαγωνισμάτων στα πρότυπα των πανελληνίων εξετάσεων.
                    Άμεση ενημέρωση των μαθητών για τις απαντήσεις των θεμάτων με τον
                    προσωπικό τους κωδικό από την ιστοσελίδα του φροντιστηρίου.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Frontistiria.Simmetria');





        /*=============== 7  Δημόκριτος Πετρούπολη ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Δημόκριτος Πετρούπολη', 'email' => 'info@dimokritos.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'dimokritos'])->id,
            'address' => 'Αγίας Τριάδος 4, Πετρούπολη',
            'city' => 'Αθήνα',
            'phone' => 2105060700,
            'type_id' => 3,
            'website' => 'dimokritos.gr',
            'approved' => 1,
            'about' => '
                Γνωρίζετε πως η απόκτηση ενός πτυχίου αποτελεί πρωταρχικό στόχο των νέων, τόσο για την επαγγελματική τους αποκατάσταση ,αλλά και για την κοινωνική τους καταξίωση. Αναγκαίο, λοιπόν, είναι να γίνει σωστή και ολοκληρωμένη προετοιμασία των μαθητών για την εισαγωγή στην τριτοβάθμια εκπαίδευση.
                Οι αυξημένες εξεταστικές απαιτήσεις αλλά και τα νέα γνωστικά και εκπαιδευτικά δεδομένα οδηγούν περισσότερο από ποτέ στην ανάγκη έγκαιρης, οργανωμένης και ουσιαστικής φροντιστηριακής προετοιμασίας. Θεωρούμε ότι η επιλογή ποιοτικού φροντιστηρίου χωρίς να είναι η μοναδική είναι αναγκαία συνθήκη επιτυχίας.
                Με την πεποίθηση ότι τα φροντιστήριά μας ανταποκρίνoται απόλυτα στις εκπαιδευτικές ανάγκες και των πιο απαιτητικών υποψηφίων,- θέση που επιβεβαιώνεται από τους χιλιάδες επιστήμονες που υπήρξαν μαθητές μας,- συνεχίζουμε να υλοποιούμε στην οργάνωση και λειτουργία τους, τις βασικές αρχές μιας ουσιαστικής φροντιστηριακής προετοιμασίας που συνοψίζονται:
                Άριστο επιτελείο καθηγητών όλων των ειδικοτήτων .
                Ολιγομελή και ομοιογενή τμήματα(5 έως 8 μαθητών)
                Αποτελεσματικά προγράμματα διδασκαλίας που υποστηρίζονται από δωρεάν βιβλία
                Προγραμματισμός για έγκαιρη ολοκλήρωση ύλης και πολλές επαναλήψεις.
                Επαναληπτικά προγραμματισμένα διαγωνίσματα τύπου πανελλαδικών εξετάσεων.
                Συνεχή ενημέρωση γονέων για την πρόοδο των μαθητών και μέσω διαδικτύου.
                Επαγγελματικό προσανατολισμό και υπεύθυνη συμπλήρωση μηχανογραφικού.
                Αντιμετώπιση κάθε μαθητή μας ως ξεχωριστής προσωπικότητας
                Προετοιμασία από Β Λυκείου για Πανελλαδικές (Διετής Κύκλος Προετοιμασίας )
                Οι προσεχτικά μελετημένες αρχές των φροντιστηρίων μας αποτελούν εγγύηση για την επιτυχία του κοινού σκοπού μας.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/demokritos.gr');




        /*=============== 8  Ευσταθόπουλος ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Ευσταθόπουλος', 'email' => 'info@efstathopoulos.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'efstathopoulos'])->id,
            'address' => 'Λεωφ. Ιωνίας 75, Άλιμος',
            'city' => 'Αθήνα',
            'phone' => 2109952114,
            'type_id' => 3,
            'website' => 'efstathopoulos.edu.gr',
            'approved' => 1,
            'about' => '
                Σήμερα, που όλα αλλάζουν ραγδαία γύρω μας, πιστεύοντας ακράδαντα ότι η αξία της μόρφωσης είναι αδιαπραγμάτευτη και με την εμπειρία σαράντα και πλέον χρόνων, έχουμε διαμορφώσει την ικανότητα να βλέπουμε μακριά!
                Όλα αυτά τα χρόνια παρουσίας μας στον φροντιστηριακό χώρο των Νοτίων Προαστίων, έχουμε προσφέρει πληθώρα υπηρεσιών και εφοδίων προς τους χιλιάδες μαθητές μας, που μας εμπιστεύτηκαν το μέλλον τους και σήμερα είναι καταξιωμένοι επιστήμονες και επιτυχημένοι επαγγελματίες.
                Πρωτοπορούμε στο χώρο της Ιδιωτικής Εκπαίδευσης, παρακολουθώντας τις γρήγορες εξελίξεις που διαμορφώνονται, προσφέροντας πολλαπλές και ολοκληρωμένες εκπαιδευτικές υπηρεσίες, που συνιστούν αυτό που εμείς αντιλαμβανόμαστε ως «εκπαίδευση»: εκπαίδευση υποδομής, προετοιμασία για το Πανεπιστήμιο και Διά Βίου Μάθηση. Και οι τρεις αυτές παράμετροι αποσκοπούν στη διαμόρφωση όχι μόνο καταρτισμένων επαγγελματιών, αλλά και στη σφυρηλάτηση του πνευματικού και ηθικού δυναμικού τους, ώστε ν’ αντεπεξέλθουν επαρκώς και με αξίες στις σύγχρονες απαιτήσεις, επιδιώκοντας πάντα τη βελτίωση του εαυτού τους, αλλά και του κόσμου εν γένει, πιστοί στα ιδανικά και το προσωπικό τους όραμα.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 13, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Φροντιστήριο-Ευσταθόπουλος-456455154464729');




        /*=============== 9  Φιλομάθεια ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Φιλομάθεια', 'email' => 'filomathia@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'filomathia'])->id,
            'address' => 'Κουταΐση 34, Νίκαια',
            'city' => 'Αθήνα',
            'phone' => 2104910408,
            'type_id' => 3,
            'website' => 'filomathia.gr',
            'approved' => 1,
            'about' => '
                Ο μοναδικός και απόλυτος στόχος των σπουδών μας είναι η επιτυχία του κάθε μαθητή μας:
                επιτυχία στην ολοκλήρωση της προσωπικότητάς του
                στις επαγγελματικές του επιλογές
                στους σπουδαστικούς του στόχους
                στη διαδρομή της αυτοσυνειδησίας του
                Για εμάς, για τον Εκπαιδευτικό Όμιλο ΦΙΛΟΜΑΘΕΙΑ ®, ο κάθε μαθητής και το οικογενειακό του πλαίσιο, είναι αντικείμενο σεβασμού και με την εκπαιδευτική εμπειρία των 24 ετών, το υψηλό ακαδημαϊκό επίπεδο και τις γνώσεις παιδαγωγικής ψυχολογίας, θέτουμε ως χρέος μας την ολιστική υποστήριξη των μαθητών της περιοχής μας! Ας τονίσουμε ότι ο Εκπαιδευτικός Όμιλος ΦΙΛΟΜΑΘΕΙΑ ® έχει δημιουργική πορεία τα τελευταία 24 χρόνια  και αναγνωρίζεται ως το κορυφαίο φροντιστήριο στις περιοχές της Νίκαιας και του Κορυδαλλού. Επιπλέον, έχει τη χαρά να παρουσιάζει πάνω από 3000 επιστήμονες – πρώην μαθητές.
                Η επιτυχία δεν έχει μυστικά: είναι αποτέλεσμα της αγάπης μας για την εκπαίδευση και της συνεχούς προσπάθειάς μας για παροχή υψηλής ποιότητας υπηρεσιών.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 7, 'frontistirio');

        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalStudy($fake, 'Πανεπιστημιακό Φροντιστήριο', 'Προπτυχιακά', 'Φοιτητικά Μαθήματα');





        /*=============== 10  Λουκίδη ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Λουκίδη', 'email' => 'info@loukidi.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'loukidi'])->id,
            'address' => 'Κράτητος 49, Νέα Σμύρνη',
            'city' => 'Αθήνα',
            'phone' => 2109344300,
            'type_id' => 3,
            'website' => 'loukidi.edu.gr',
            'approved' => 1,
            'about' => '
               1968-2016, 48 χρόνια φροντιστηριακής εμπειρίας. Στη μακρόχρονη αυτή πορεία μας βρισκόμαστε στο πλευρό των υποψηφίων, παρά τις συνεχείς μεταρρυθμίσεις του εκπαιδευτικού συστήματος και της γενικότερης αστάθειας της εκπαιδευτικής κοινότητας. Ο στόχος μας συμπίπτει με τον στόχο των μαθητών μας, την εισαγωγή τους στη σχολή της προτίμησής τους. Η εμπειρία μας, οι γνώσεις μας, ο επαγγελματισμός μας, η αγάπη μας για τα παιδιά σε συνδυασμό με τη θέληση, την επιμονή και υπομονή, τις ιδιαίτερες ικανότητες και δεξιότητες των μαθητών, μας οδηγούν με σιγουριά στην επίτευξη του κοινού μας στόχου.
               Η οργάνωση και η λειτουργία του φροντιστηρίου μας στηρίζεται κυρίως στο εξειδικευμένο και άρτια καταρτισμένο διδακτικό προσωπικό και στην αντιμετώπιση κάθε μαθητή μας ως ξεχωριστής προσωπικότητας με ιδιαίτερες απαιτήσεις και ανάγκες. Η συνεχής καθοδήγηση και στήριξη των μαθητών με συνέπεια, εντιμότητα και αφοσίωση από το έμψυχο δυναμικό μας αποτελούν τα κύρια χαρακτηριστικά της δομής μας. Η συστηματική προσπάθεια για να προσφέρουμε ολοκληρωμένες εκπαιδευτικές υπηρεσίες συντελείται με τη συνεχή προσαρμογή μας στα νέα εκπαιδευτικά δεδομένα και με την αδιάλειπτη ενημέρωση και κατάρτιση του διδακτικού προσωπικού μας.
               Σε ένα περιβάλλον σύγχρονο, άνετο και πρωτοποριακό η διδασκαλία γίνεται ευχάριστη διαδικασία και η σχέση καθηγητή – μαθητή καλλιεργείται σ’ ένα χώρο προσεχτικά σχεδιασμένο για τον σκοπό αυτό. Η διαφορετική παιδαγωγική μας αντίληψη στηρίζεται σε μεγάλο βαθμό στην ψυχολογία των μαθητών. Για τον σκοπό αυτό απαιτούνται ειδικά διαμορφωμένοι χώροι όπως αυτοί που διαθέτουμε καθώς και επιπλέον παροχές που ανταποκρίνονται στις ανάγκες του σήμερα. Παράλληλα λοιπόν με τη διδασκαλία οι μαθητές έχουν την ευκαιρία να εξασκηθούν σε αίθουσες με σύγχρονους υπολογιστές ενισχύοντας τη διαδικασία της μάθησης και ενσωματώνοντας τη χρήση τους στην καθημερινή δραστηριότητα τους.
               Οι χιλιάδες μαθητές μας και σημερινοί επιστήμονες είναι οι μάρτυρες του έργου και των προσπαθειών μας. Οι επιτυχίες τους η δικαίωση μας. Η μεγάλη οικογένεια των φροντιστηρίων Λουκίδη μετά από 45 χρόνια ενεργής παρουσίας στο χώρο της εκπαίδευσης συνεχίζει έχοντας τον ίδιο στόχο και το ίδιο όραμα με την πρώτη χρονιά. Επιτυχημένους επιστήμονες – ολοκληρωμένες προσωπικότητες.

               ΑΙΘΟΥΣΕΣ
               Τοποθέτηση μαθητών σε διάταξη ομάδας εξασφαλίζοντας:
               αμεσότητα
               αδιάλειπτη συνεργασία καθηγητή – μαθητή
               ουσιαστική συνεργασία μεταξύ των μαθητών
               Αίθουσες με σύγχρονους υπολογιστές και πρόσβαση υψηλής ταχύτητας στο internet.
               Αίθουσες άνετες, σύγχρονες, πρωτοποριακές όπου η διδασκαλία μετατρέπεται σε ευχάριστη διαδικασία.
               Μελετητήρια όπου οι μαθητές διαβάζουν με την επίβλεψη και βοήθεια των καθηγητών τους.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalStudy($fake, 'Πανεπιστημιακό Φροντιστήριο', 'Προπτυχιακά', 'Φοιτητικά Μαθήματα');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/loukidi.edu.gr');





        /*=============== 11  Θεμέλειο Πειραιάς ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Θεμέλειο Πειραιάς', 'email' => 'them53@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'themelioPeiraias'])->id,
            'address' => 'Ηρώων Πολυτεχνείου 23 Α, Πειραιάς',
            'city' => 'Αθήνα',
            'phone' => 2104134374,
            'type_id' => 3,
            'website' => 'themelio.com.gr',
            'approved' => 1,
            'about' => '
            κάνουμε κάτι περισσότερο από το να διδάσκουμε... συμμετέχουμε
            Τμήματα ολιγομελή
            Στο ΘΕΜΕΛΙΟ λειτουργούν ομοιογενή ολιγομελή τμήματα που σχηματίζονται με βάση τις επιδόσεις αλλά και τους στόχους των μαθητών.
            Β\' Λυκείου, Γ\' Λυκείου και αποφοίτων όλων των ομάδων προσανατολισμού.
            Α\' Λυκείου
            Η Ά\' Λυκείου είναι καθοριστική τάξη, γιατί θεμελιώνονται οι γνώσεις στα μαθηματικά, τις Φυσικές Επιστήμες και στην Ελληνική Γλώσσα θέτοντας τις βάσεις για τις επόμενες τάξεις. Η ύλη της Α\' Λυκείου με βάση το νέο αναλυτικό πρόγραμμα είναι ιδιαίτερα απαιτητική και χρειάζεται ειδική εκπαιδευτική αντιμετώπιση. Η εμπειρία και το πρόγραμμα του ΘΕΜΕΛΙΟΥ εξασφαλίζουν το επιθυμητό αποτέλεσμα.
            Γυμνασίου
            Με στόχο την δημιουργία της κατάλληλης υποδομής.
            ΕΠΑ.Λ.
            Λειτουργούν τμήματα όλων των ειδικοτήτων.
            Καθηγητές
            Οι έμπειροι καθηγητές μας επιμένουν ιδιαίτερα στην μεθοδική κάλυψη της ύλης και την συμπλήρωση των κενών των μαθητών. Η ύλη ολοκληρώνεται έγκαιρα, επεκτείνεται σε θέματα αυξημένης δυσκολίας και υπάρχει ο απαιραίτητος χρόνος για τις τελικές επαναλήψεις.
            Ατομική Παρακολούθηση
            Οι υπεύθυνοι μαθημάτων σε συνεργασία με τη διεύθυνση παρακολουθούν διαρκώς την πρόοδο κάθε μαθητή, την επίδοσή του στα διαγωνίσματα και στο σχολείο, και όπου χρειάζεται παρέχεται δωρεάν πρόσθετη διδακτική στήριξη.
            Ιδιαίτερα Μαθήματα
            Παρέχεται η δυνατότητα του ιδιαίτερου μαθήματος με τους καθηγητές του ΘΕΜΕΛΙΟΥ για όσο χρονικό διάστημα απαιτείται.
            Ενημέρωση Γονέων
            Οι γονείς ενημερώνονται σε τακτά χρονικά διαστήματα για την πρόοδο και τις παρουσίες των μαθητών, ενώ υπάρχει η δυνατότητα καθημερινής επαφής με τη διεύθυνση και τους καθηγητές.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 9, 'frontistirio');



        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Φροντιστήριο-Θεμελιο-892885500732726');





     /*=============== 12  Πυρήνας  ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Πυρήνας', 'email' => 'info@frontpirinas.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'pirinas'])->id,
         'address' => 'Ταϋγέτου 95, Άνω Πατήσια',
         'city' => 'Αθήνα',
         'phone' => 2102288301,
         'type_id' => 3,
         'website' => 'frontpirinas.gr',
         'approved' => 1,
         'about' => '
           Το Φροντιστήριο “Πυρήνας” ιδρύθηκε το 2009 από τη φιλόλογο, πτυχιούχο της κλασσικής φιλολογίας του Εθνικού και Καποδιστριακού Πανεπιστημίου Αθηνών, Γκορτσαλή Κωνσταντίνα.
           Πυρήνας μάθησης και αγωγής για μαθητές που θέλουν οι ίδιοι να διαμορφώσουν το μέλλον τους, να κοιτάζουν το μέλλον κατάματα με σιγουριά και να μη γυρίζουν τις πλάτες τους…
           Απέναντι από το μεγάλο σχολικό συγκρότημα της Γκράβας, στο Γαλάτσι, σε ένα κτήριο εξ αρχής φτιαγμένο για αυτό τον σκοπό…  Χώρος προσεγμένος, φτιαγμένος με αγάπη, με μεράκι. Φως, άπλετο κ θέα ο ουρανός και τα τουρκοβούνια… Αίθουσες λειτουργικές, κλιματιζόμενες, όχι μεγάλες,… γιατί εδώ είμαστε λίγοι σε κάθε τμήμα.
           Τα προγράμματα σπουδών είναι πλήρη κ΄ευέλικτα. Σε αυτά προστίθενται ενισχυτικά μαθήματα, εξατομικευμένα, δωρεάν, για να βοηθηθεί ο μαθητής. Σε πολλά μαθήματα η διδασκαλία ενισχύεται διαδραστικά. Η αξιολόγηση στην κατάκτηση της γνώσης γίνεται πρώτα στην ψυχή, στα μάτια του παιδιού… Σε εκείνα τα μάτια που κοιτάζουν με έκπληξη,θαυμασμό και περηφάνεια τη νέα γνώση που κατέκτησαν… αλλά και πιο αυστηρά, για να συνηθίζουμε και τις εξετάσεις,  με φύλλα αξιολόγησης μικρής χρονικής διάρκειας, σχεδόν καθημερινά αλλά και με διαγωνίσματα “προσομοίωσης” των μεγάλων εξετάσεων, προαγωγικών κ πανελληνίων, παρότι οι μεγαλύτερες είναι μέσα στο ταξίδι της ζωής….
           Εφόδια λοιπόν, δυνάμεις πνευματικές αλλά και ψυχικές για να είναι ” ο πηγαιμός”  όμορφος, απολαυστικός, συναρπαστικός, και τελειωμό να μην έχει…. Συνοδοιπόροι σε όλη τη διαδρομή μας, οι γονείς, απαραίτητοι συνεργάτες μας.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio');


     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistiriopirinas');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/frontpirinas');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/frontpirinas');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/company/%CF%86%CF%81%CE%BF%CE%BD%CF%84%CE%B9%CF%83%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%BC-%CE%B5-%CF%80%CF%85%CF%81%CE%AE%CE%BD%CE%B1%CF%82/');




     /*=============== 13  Το Μέλλον ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Το Μέλλον', 'email' => 'info@tomellon.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'tomellon'])->id,
         'address' => 'Πριάμου 46, Ίλιον',
         'city' => 'Αθήνα',
         'phone' => 2102693200,
         'type_id' => 3,
         'website' => 'tomellon.edu.gr',
         'approved' => 1,
         'about' => '
           Οι καθηγητές μας είναι άνθρωποι καταξιωμένοι, με εμπειρία ετών, πρόθυμοι να μεταδώσουν τις γνώσεις τους, στους μαθητές τους, που τους έχουν ανάγκη.
           Όσον αφορά το καθημερινό πρόγραμμα, φροντίζουμε να το οργανώνουμε το συντομότερο δυνατόν και να συμφωνεί με τις ανάγκες των μαθητών μας. Βασικό μας μέλημα είναι να εφοδιαστούν με τις απαραίτητες γνώσεις και κατ’ επέκταση να αριστεύσουν στα διαγωνίσματα και τις εξετάσεις. Είναι μεγάλη η χαρά μας κάθε φορά που ανακοινώνονται τα αποτελέσματα των εξετάσεων και βλέπουμε τα δικά μας παιδιά να ξεκινούν το ταξίδι των σπουδών τους. Για να τους οδηγήσουμε στην επιτυχία, τους παρέχουμε βιβλία επιμελημένα από τους καθηγητές μας και εξετάζουμε τις επιδόσεις τους στα προγραμματισμένα διαγωνίσματα που γίνονται σχεδόν κάθε Κυριακή.
           Κάθε νέος μαθητής που ξεκινάει το ταξίδι του στο «Μέλλον» πραγματοποιεί ένα τεστ επαγγελματικού προσανατολισμού για να ερευνήσει τα «θέλω» του και να καταλάβουν οι καθηγητές του καλύτερα τους στόχους του και τις επιθυμίες του.
           Σημαντικό κομμάτι της εκπαίδευσης του φροντιστηρίου είναι το «Μελετητήριο» το οποίο ανοίγει νέους δρόμους στην εκπαιδευτική διαδικασία. Συγκεκριμένα, στις ειδικά διαμορφωμένες αίθουσές μας, καθηγητές με μεράκι βοηθούν μαθητές Δημοτικού και Γυμνασίου να μάθουν τους σωστούς τρόπους να διαβάζουν, βοηθώντας τους να κατανοήσουν τη διδακτέα ύλη και όχι να αποστηθίσουν αδρά το μάθημα της επόμενης μέρας.
           Ακόμη, για τους μαθητές της Β’ και Γ’ Λυκείου πραγματοποιούνται ειδικές συνεδρίες με ψυχολόγο για την καταπολέμηση του σχολικού άγχους. Επιπλέον, δύο φορές το χρόνο γίνονται οι προγραμματισμένες ενημερώσεις γονέων, όπου οι καθηγητές συζητούν τις επιδόσεις των μαθητών. Βέβαια, καθ’ όλη τη διάρκεια της χρονιάς οι γονείς είναι ευπρόσδεκτοι να συζητήσουν ό,τι τους απασχολεί με τους καθηγητές.
           Κάθε Σάββατο πραγματοποιείται Εξατομικευμένη Εκπαιδευτική Υποστήριξη σε όλους τους μαθητές, ασχολούμαστε με τον κάθε μαθητή προσωπικά και λύνουμε τις δικές του απορίες.
           Φυσικά ένας ζωντανός οργανισμός όπως το φροντιστήριο, δε θα μπορούσε να αναπτυχθεί χωρίς ενημερωτικές ημερίδες και σεμινάρια, είτε εορταστικές εκδηλώσεις και εκδρομές για τη χαλάρωση των μαθητών.
           Κλείνοντας, μέσα από αυτή τη μικρή παρουσίαση του χώρου και της δουλειάς μας, θα θέλαμε να επισημάνουμε πως βασικό μας μέλημα είναι οι μαθητές μας, δουλεύοντας σαν ομάδα, τους βοηθάμε να εκπληρώσουν τις επιθυμίες τους και να πραγματοποιήσουν τα όνειρά τους.
           Να δουν το «Μέλλον» τους με τα δικά τους μάτια!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 8, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/tomellonedu');




     /*=============== 14  Ορόσημο Ίλιον ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Ορόσημο Ίλιον', 'email' => 'info@oroshmo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'oroshmo'])->id,
         'address' => 'Μενελάου 101, Ίλιον',
         'city' => 'Αθήνα',
         'phone' => 2102629295,
         'type_id' => 3,
         'website' => 'oroshmo.gr',
         'approved' => 1,
         'about' => '
           Oι συντελεστές του φροντιστηρίου
           είναι καθηγητές με πολύχρονη και αποκλειστική ειδίκευση στο αντικείμενο που διδάσκουν.

           Ολιγομελή τμήματα
           Ο περιορισμένος αριθμός μαθητών ανά τμήμα δίνει τη δυνατότητα για άμεση επαφή καθηγητή - μαθητή και διαρκή παρακολούθηση της επίδοσης του.
           Ενημέρωση γονέων και κηδεμόνων
           Ο περιορισμένος αριθμός μαθητών ανά τμήμα δίνει τη δυνατότητα για άμεση επαφή καθηγητή - μαθητή και διαρκή παρακολούθηση της επίδοσης του.
           Λειτουργούν τμήματα αριστούχων
           Επαγγελματικός προσανατολισμός
           Διαθέτουμε ένα ευχάριστο και άνετο περιβάλλον, πλήρως ανακαινισμένο, για το μαθητή με κλιματιζόμενες αίθουσες.
           Αξιολογηση
           Όλα τα στοιχεία αξιολογησης του μαθητή κατά την διάρκεια της φοίτησης του, καταχωρούνται και γίνεται δυνατός ο έλεγχος προόδου του μαθητή με σκοπό τη συνεχή βελτίωση του.
           Παρέχονται δωρεάν σημειώσεις
           Οργάνωση
           α. Συγκρότηση τμημάτων με τρόπο τέτοιο ώστε να διασφαλίζεται η ομοιογένεια.
           β. Διαρκής παρακολούθηση της επίδοσης και παρουσίας του μαθητή στο φροντιστήριο.
           γ. Ωράρια μαθημάτων που προσφέρουν στους μαθητές την δυνατότητα επιλογής ανάλογα με τις απαιτήσεις και τις ανάγκες τους.
           Διδακτικός προσανατολισμός
           α. Έγκαιρη ολοκλήρωση της ύλης που παρέχει την δυνατότητα πολλών επαναλήψεων.
           β. Διαγωνίσματα. Οι μαθητές πέρα από την προφορική εξέταση συμμετέχουν υποχρεωτικά σε γραπτά τεστ και σε διαγωνίσματα που δίνουν την δυνατότητα εμπέδωσης της ύλης.
           γ. Επιπλέον δωρεάν ώρες μαθημάτων για την αντιμετώπιση των αναγκών κάθε μαθητή ξεχωριστά.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');





     /*=============== 14  Μεθοδικό Καλογρέζα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Μεθοδικό Καλογρέζα', 'email' => 'contact@methodikal.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'methodikal'])->id,
         'address' => 'Ανδρέου Δημητρίου 81, Καλογρέζα',
         'city' => 'Αθήνα',
         'phone' => 2102775360,
         'type_id' => 3,
         'website' => 'methodikal.gr',
         'approved' => 1,
         'about' => '
              Στους αδιαμφισβήτητα δύσκολους καιρούς που διανύουμε, μιας κρίσης οικονομικής αλλά και κοινωνικής, πολιτισμικής, ηθικής, η γνώση είναι το σημαντικότερο μέσο που οφείλουμε να διαφυλάξουμε και να μεταλαμπαδεύσουμε στους νέους ανθρώπους, τόσο για την ατομική τους όσο και για τη συλλογική πρόοδο.
              Το φροντιστήριο ΜΕΘΟΔΙΚΟ με την πολυετή και συνεχή του παρουσία στο χώρο της εκπαίδευσης, με οργάνωση, μεθοδικότητα και διαρκή βελτίωση στους τρόπους και τις μεθόδους διδασκαλίας, προσφέρει υπεύθυνη και αξιόπιστη υποστήριξη στους μαθητές στον δύσκολο αγώνα για την κατάκτηση της γνώσης και της επιτυχίας.
              Ξεκίνησε την προσφορά του στο χώρο της φροντιστηριακής εκπαίδευσης πριν από 28 χρόνια στην Καλογρέζα και με τη σταθερή του παρουσία στην περιοχή, έχει στηρίξει τα όνειρα εκατοντάδων οικογενειών της τοπικής κοινωνίας, καλύπτοντας πάντα τις αυξημένες απαιτήσεις του εκπαιδευτικού συστήματος.
              Έχοντας επίγνωση της αγωνίας των παιδιών και των γονέων τους για το μέλλον όπως και του ρόλου μας ως δασκάλων και παιδαγωγών, προσφέρουμε πάντα τον καλύτερό μας εαυτό, στηρίζοντας τους μαθητές και υπηρετώντας το όραμα της Παιδείας.
              Η επιτυχία τους είναι για εμάς η καλύτερη ανταμοιβή!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');



     /*=============== 15  Καλλιθεϊκό ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστηριακός Οργανισμός Καλλιθεϊκό', 'email' => 'kallithe@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'kallitheiko'])->id,
         'address' => 'Ι. Γρυπάρη 143, Καλλιθέα',
         'city' => 'Αθήνα',
         'phone' => 2109561241,
         'type_id' => 3,
         'website' => 'kallitheiko.gr',
         'approved' => 1,
         'about' => '
            Καλωσήρθατε σε μια μοναδική εκπαιδευτική εμπειρία .
            Καλωσήρθατε στη διδακτική εμπειρία του Καλλιθεϊκού…
            Του φροντιστηρίου που το γέννησε η πίστη στο μαθητή. Στις φανερές και κυρίως στις κρυμμένες του δυνατότητες.
            Δυνατότητες που έρχονται στην επιφάνεια μόνο μέσα από τους χειρισμούς και τη δυναμική ενός χαρισματικού δασκάλου.
            Ενός δασκάλου που έχει την εμπειρία και το χάρισμα να αναδείξει δεξιότητες. Να αποδημήσει αδυναμίες.
            Να ενδυναμώσει τη μαγεία που υπάρχει μέσα του και να τη μετουσιώσει σε συνειδητό όραμα, υψηλούς στόχους και επιμονή για την νίκη.
            Όχι μόνο στις σπουδές αλλά και στη ζωή…
            Bρισκόμαστε κοντά στους μαθητές μας με έναν εντελώς ιδιαίτερο τρόπο: καταθέτουμε ψυχή έχοντας επίγνωση του παιδαγωγικού μας ρόλου και έτσι πετυχαίνουμε να ελευθερωθεί… « ο άγγελος που κρύβεται μέσα τους.»
            Ο άγγελος της επιτυχίας και της καταξίωσης.
            Κοντά μας, το ονειρεύομαι γίνεται μεγαλύτερο από το φοβάμαι.
            Κοντά μας, το προχωρώ γίνεται μεγαλύτερο από το σταματώ.
            Κοντά μας, το καταφέρνω γίνεται μεγαλύτερο από το αποφεύγω.
            Μαζί μεγαλώνουμε το θέλω και το κάνουμε μπορώ.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/kallitheiko');



     /*=============== 16  Παρακίνηση - Αναγνωστήριο ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Παρακίνηση - Αναγνωστήριο', 'email' => 'info@anagnostirio.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'anagnostirio'])->id,
         'address' => 'Ελ. Βενιζέλου 104, Πετρούπολη',
         'city' => 'Αθήνα',
         'phone' => 2105054330,
         'type_id' => 3,
         'website' => 'anagnostirio.edu.gr',
         'approved' => 1,
         'about' => '
       Το όραμά μας

       Να αναπτύσσουμε πολύπλευρα τις γνωστικές ικανότητες των μαθητών μας, συμβάλλοντας στη διαμόρφωση της προσωπικότητας τους.

       Αποστολή μας

       Μία επιτυχημένη πορεία μετά το σχολείο, δεν είναι αποτέλεσμα μόνο «στείρας γνώσης».
       Εμείς, στο φροντιστήριο «ΠΑΡΑΚΙΝΗΣΗ» – ΑΝΑΓΝΩΣΤΗΡΙΟ επενδύουμε στην ισχυροποίηση της προσωπικότητας των μαθητών μας, μέσα από ένα σύνολο στρατηγικών δράσεων, που περιλαμβάνουν την παροχή ολοκληρωμένων υπηρεσιών Συμβουλευτικής, προσαρμοσμένο στις ανάγκες τόσο των γονέων, όσο και των παιδιών.
       Αποστολή μας λοιπόν είναι να κτίζουμε άξιους σημερινούς μαθητές – αυριανούς πετυχημένους ανθρώπους με:

       Οργανωτικό πνεύμα,
       Ανεπτυγμένο αίσθημα υπευθυνότητας,
       Συναισθηματική νοημοσύνη & αντίληψη,
       Αυτοπεποίθηση & πνεύμα δημιουργίας.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 13, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Φροντιστήρια-Αναγνωστήριο-Παρακίνηση-124919070931071');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



     /*=============== 17  Σαλτερής- Σαββάλας ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Σαλτερής- Σαββάλας', 'email' => 'edu@salteris-savalas.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'salteris'])->id,
         'address' => 'Αγ. Κωνσταντίνου 51, Μαρούσι',
         'city' => 'Αθήνα',
         'phone' => 2106122284,
         'type_id' => 3,
         'website' => 'salteris-savalas.gr',
         'approved' => 1,
         'about' => '
             Στα Φροντιστήρια Σαλτερής | Σαββάλας θέτουμε τον μαθητή και τις ανάγκες του στο επίκεντρο της εκπαιδευτικής μας πρότασης. Με στόχο τη δική του επιτυχία διδάσκουμε με αρτιότητα τα γνωστικά αντικείμενα, σε συγκεκριμένο χρονικό πλαίσιο, έχοντας ως βάση την εικοσαετή και πλέον πείρα μας στο χώρο της εκπαίδευσης. Με την υπεύθυνη καθοδήγησή μας και τη διαρκή υποστήριξη σ’ ένα περιβάλλον σεβασμού της ξεχωριστής προσωπικότητας του κάθε μαθητή, στέκουμε αρωγοί για την εκπλήρωση των φιλόδοξων και υψηλών στόχων του.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
//     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
//     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/salteris.savalas');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





     /*=============== 18  Βαφειαδάκης ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Βαφειαδάκης', 'email' => 'info@vafeiadakis.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'vafeiadakisAigaleo'])->id,
         'address' => 'Ν. Πλαστήρα 9, Αιγάλεω',
         'city' => 'Αθήνα',
         'phone' => 2105314014,
         'type_id' => 3,
         'website' => 'vafeiadakis.gr',
         'approved' => 1,
         'about' => '
           Από το 1998 υποστηρίζουμε αυτά που οι άλλοι υπόσχονται. Πάνω απ\'όλα ο Σύγχρονος φροντιστηριακός Όμιλος Βαφειαδάκης είναι ένας εκπαιδευτικός οργανισμός με ανθρώπινο πρόσωπο.
           Μία πραγματικότητα που αποδεικνύεται στα τόσα χρόνια επιτυχημένης πορείας του αλλά και των μαθητών μας. Όλο το έμψυχο δυναμικό του Ομίλου μας, από τη διοίκηση έως το καταξιωμένο εκπαιδευτικό προσωπικό, βρίσκεται πάντα κοντά στους νέους, στις ανάγκες τους και στον τρόπο σκέψης τους.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 11, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frodvaf');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/vafeiadakis');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/c/VafeiadakisGr');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/company/%CF%86%CF%81%CE%BF%CE%BD%CF%84%CE%B9%CF%83%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%B2%CE%B1%CF%86%CE%B5%CE%B9%CE%B1%CE%B4%CE%AC%CE%BA%CE%B7%CF%82/?trk=company_logo');



     /*=============== 19  Ανέλιξη Κάτω Ηλιούπολη ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Ανέλιξη Κάτω Ηλιούπολη', 'email' => 'anelixi2@hotmail.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'anelixi2'])->id,
         'address' => 'Φαρμακίδου 2, Κάτω Ηλιούπολη',
         'city' => 'Αθήνα',
         'phone' => 2109946945,
         'type_id' => 3,
         'website' => 'anelixi-edu.com',
         'approved' => 1,
         'about' => '
            Σήμερα, αγαπητοί μας φίλοι, δεν αρκεί να περάσει κανείς σε κάποια Σχολή. Πρέπει η Σχολή αυτή, παράλληλα με τις κλίσεις και τα όνειρα του καθενός, να παρέχει και εχέγγυα επαγγελματικής αποκατάστασης και ανέλιξης.
            Εμείς, τα Φροντιστήρια ΑΝΕΛΙΞΗ, κάνουμε το παν για να ανταποκριθούμε στη διπλή αυτή απαίτηση. Στη σωστή επιλογή της Σχολής και στη δυνατότητα εισαγωγής σου σ’ αυτήν.
            Το πρώτο το πετυχαίνουμε με την υπεύθυνη εξατομικευμένη καθοδήγηση και καθοδήγηση που παρέχουμε στους μαθητές μας.
            Το δεύτερο, την εισαγωγή στη Σχολή προτίμησής σου, το πετυχαίνουμε με τα εξειδικευμένα προγράμματά μας, το νεωτερικό τρόπο διδασκαλίας, τα φιλικά βοηθήματα και βιβλία και κυρίως με το κορυφαίου επιπέδου καταξιωμένο και έμπειρο εκπαιδευτικό δυναμικό του Φροντιστηρίου μας.
            Κι όπως είναι γνωστό, αυτά δεν τα διακηρύσσουμε απλώς, αλλά τα πραγματώνουμε εδώ και χρόνια. Μείνε, λοιπόν, με αυτή την ακλόνητη βεβαιότητα. Η επιτυχία είναι στο χέρι σου, αφού κυριότατα εξαρτάται από τις δικές σου εύστοχες επιλογές
            Συνυπολόγισε, τώρα, επιπλέον και τούτο: το Φροντιστήριό μας, δε ζητάει από τους μαθητές του γνώσεις. Αυτές, έχουμε τον τρόπο και τις προσφέρουμε εμείς. Ζητάει όμως, ζήλο και ενθουσιασμό για τη μεγάλη χαρά και τη μεγάλη αμοιβή στο τέρμα της πορείας τους μαζί μας.
            Γι’ αυτό, δε θα παύσουμε να το υπενθυμίζουμε ευθαρσώς, απλά και καθαρά: Είμαστε παρόντες για τους εν δυνάμει επιτυχημένους!
            Διαβάστε περισσότερα: https://www.anelixi-edu.com/%ce%ba%ce%b1%ce%b8%ce%b7%ce%b3%ce%b7%cf%84%ce%b5%cf%83/
            ',
         'background' => $background,
     ]);

     new Portal($fake, 11, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');




     /*=============== 20 Τρίπτυχο ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Τρίπτυχο', 'email' => 'triptyxo@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'triptyxo'])->id,
         'address' => 'Ελ. Βενιζέλου 142, Νέα Σμύρνη',
         'city' => 'Αθήνα',
         'phone' => 2109315119,
         'type_id' => 3,
         'website' => 'triptyxo.edu.gr',
         'approved' => 1,
         'about' => '
            Το καλοκαίρι του 1999 λειτουργεί το πρώτο κτήριο των Φροντιστηρίων «Τρίπτυχο» στην Νέα Σμύρνη (Ελ. Βενιζέλου 142).
            Με το σύνθημα «νέοι άνθρωποι κοντά στους νέους», καταθέσαμε μια νέα πρόταση στα φροντιστηριακά δεδομένα της περιοχής.
            Η ανταπόκριση των μαθητών και των γονέων, στη πρόταση αυτή, υπήρξε κάτι παραπάνω από ικανοποιητική από την πρώτη μέρα λειτουργίας.
            Το 2001 λειτουργεί το δεύτερο κτήριο στο Παλαιό Φάληρο (Ελ. Βενιζέλου 271).
            Σήμερα, δεκαοκτώ ολόκληρα χρόνια μετά, στα Φροντιστήρια «Τρίπτυχο», με το σύνθημα «η επιλογή σου», έχουμε πετύχει να εξελίξουμε σε υψηλό επίπεδο, τόσο την κατάρτιση, την εμπειρία και τη διαθεσιμότητα του εκπαιδευτικού προσωπικού μας όσο και τη συνεργασία, την ενημέρωση και την επικοινωνία με τους γονείς των μαθητών μας.
            Έχοντας προσθέσει καινούρια στοιχεία στον τρόπο λειτουργίας μας, όπως το γραφείο σχολικού επαγγελματικού προσανατολισμού και τη μηχανοργάνωση σε όλα τα επίπεδα (γραμματεία, βιβλία εκδόσεις των φροντιστηρίων, λογιστήριο κ.α.), προσπαθούμε να παραμένουμε σύγχρονοι και ευέλικτοι.
            Η συνεχής αύξηση εγγραφών μαθητών, στα Φροντιστήρια «Τρίπτυχο», καθώς και οι επιτυχίες των μαθητών μας σε σχολές Α.Ε.Ι. και Τ.Ε.Ι., την εκπαιδευτική περίοδο που μας πέρασε το 82% των μαθητών μας πέτυχε σε σχολή πρώτης προτίμησης, μας δίνει κουράγιο να συνεχίσουμε να προσφέρουμε στους νέους της περιοχής μας.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook',  'https://www.facebook.com/Triptixo');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/triptyxo');
       Scholio::portalSocial($fake, 'twitter',   'https://twitter.com/triptyxo');
       Scholio::portalSocial($fake, 'google-plus', 'https://plus.google.com/109219969165174059935');



     /*=============== 21 Φάσμα Νέα Σμύρνη ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτικός Οργανισμός Φάσμα', 'email' => 'info@fasmaedu.net', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'fasmaedu'])->id,
         'address' => 'Βυζαντίου 58, Νέα Σμύρνη',
         'city' => 'Αθήνα',
         'phone' => 2109409568,
         'type_id' => 3,
         'website' => 'fasmaedu.net',
         'approved' => 1,
         'about' => '
             O εκπαιδευτικός οργασνισμός ΦΑΣΜΑ στη Νέα Σμύρνη δραστηριοποιείται από το 1987 στο χώρο της μέσης εκπαίδευσης. Από το 2013 λειτουργεί και η νέα φροντιστηριακή μονάδα στο Παλαιό Φάληρο με το ίδιο πρόγραμμα και τους ίδιους καθηγητές.
             Το ΦΑΣΜΑ και οι συνεργάτες του με εφόδια την εκπαιδευτική πείρα, την επαγγελματική συνέπεια και την πολύ καλή επικοινωνία με τα παιδιά, που πάντα τους διέκρινε, απευθύνονται σε συνειδητοποιημένους μαθητές και ενεργούς γονείς. Η συμπόρευση με τους μαθητές μας στην πραγματοποίηση των ονείρων τους είναι επιλογή ζωής και τρόπος έκφρασης.
             Τα τμήματά μας είναι αυστηρά ολιγομελή, στα οποία ο κάθε μαθητής αποτελεί μια μοναδική περίπτωση με ξεχωριστές ικανότητες και φιλοδοξίες. Μέλημά μας είναι η διαμόρφωση των συνθηκών σε συνδυασμό με το άρτιο και σύγχρονο εκπαιδευτικό πρόγραμμα, ώστε ο μαθητής, πέρα από την απόκτηση γνώσεων, να διαμορφώσει μια ολοκληρωμένη προσωπικότητα.
             Σε αυτή τη διαδρομή οι μαθητές που μας εμπιστεύονται, εισάγονται σε σχολές πρώτης προτίμησης και πολλοί ήδη διαπρέπουν στον επιστημονικό και επιχειρηματικό χώρο.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Εκπαιδευτικός-Οργανισμός-Φάσμα-1519722471604499');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/fiorisfasma');



     /*=============== 22 Εκπαίδευση Βεργιόπουλος ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Εκπαίδευση Βεργιόπουλος', 'email' => 'ekpaideyshvergiopoulos@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ekpaideyshvergiopoulos'])->id,
         'address' => 'Θουκυδίδου 47, Άλιμος',
         'city' => 'Αθήνα',
         'phone' => 2109824543,
         'type_id' => 3,
         'website' => 'ekpaideysh.gr',
         'approved' => 1,
         'about' => '
              Τα Φροντιστήρια ΕΚΠΑΙΔΕΥΣΗ από το 1980 έως σήμερα στέκονται με επιτυχία στο πλευρό των μαθητών προετοιμάζοντάς τους για την εισαγωγή τους στα Πανεπιστήμια. Με έμπειρους και καταξιωμένους καθηγητές εκπαιδεύουν, στηρίζουν, επιβραβεύουν και επιτυγχάνουν τον τελικό στόχο. Άνετοι, κλιματιζόμενοι χώροι, με σύγχρονα εποπτικά μέσα. Ιστορικό Έτος ίδρυσης: 1980 στην Αθήνα από τον Γ. Βεργιόπουλο. Στα χρόνια που μεσολάβησαν πέρασαν από τις τάξεις των φροντιστηρίων μας, ως υποψήφιοι για πανελλήνιες εξετάσεις, 3.642 μαθητές που σήμερα είναι επιτυχημένοι επιστήμονες και επαγγελματίες. Τώρα μας εμπιστεύονται τα παιδιά τους. Παράλληλα σ’ αυτά τα χρόνια της εκπαιδευτικής μας δραστηριότητας τα Φροντιστήρια ΕΚΠΑΙΔΕΥΣΗ κατάφεραν να αρθρώσουν ολοκληρωμένο εκπαιδευτικό λόγο με συνέπεια λόγου και πράξης, με καινοτόμες προτάσεις και εφαρμογές που συνέβαλαν στον εκσυγχρονισμό της ιδιωτικής εκπαίδευσης. Ενδεικτικά αναφέρουμε: 1983: Αρχίζουμε τη διανομή στους μαθητές μας προσωπικών σημειώσεων – βιβλίων. 1985: Αυτές οι σημειώσεις επεκτείνονται σε όλα τα πανελλαδικώς εξεταζόμενα μαθήματα 1986: Καθιερώνονται 3-ωρα διαγωνίσματα όλων των μαθημάτων που διδάσκονται στο φροντιστήριο με ύλη, δομή και συνθήκες πανελληνίων εξετάσεων. 1988: Σύγχρονες εκπαιδευτικές και διοικητικές δομές με ένταξη διακεκριμένων εκπαιδευτικών ως υπεύθυνων ανά μάθημα. 1991: Επέκταση του προγράμματος σπουδών, ώστε να καλύπτεται και η ύλη των Τεχνικών Επαγγελματικών Λυκείων. Ειδικά τμήματα για όλα τα μαθήματα ειδικοτήτων. 1992: Εισάγεται στον τρόπο διδασκαλίας η Μηχανή Προβολής "Projector" όπου αυτό κρίνεται απαραίτητο, με σκοπό την ευκολότερη αφομοίωση της Ύλης. 1993: Όλοι οι καθηγητές του Φροντιστηρίου παίρνουν μέρος σε σειρά Σεμιναρίων Στα Σεμινάρια διδάσκουν και μέλη του Παιδαγωγικού Ινστιτούτου καθώς και συγγραφείς των Νέων Σχολικών Βιβλίων. 1995: Προστίθεται στο δυναμικό του Φροντιστηρίου μας Σχολικός Σύμβουλος "Συμβουλευτική Υπηρεσία" με σκοπό να βοηθήσει τους μαθητές στη σωστή επιλογή Επιστημονικού Πεδίου, εκμεταλλευόμενοι στο έπακρο τις δεξιότητές τους. 1996: Πρώτοι εμείς εισάγαμε το τεστ επαγγελματικού προσανατολισμού, εξαιρετικό εργαλείο, ώστε ο κάθε μαθητής να αναδύει τις δεξιότητές του. 1998: Οι Γονείς μπορούν να ενημερώνονται για την πορεία του παιδιού τους ανά δεκαπενθήμερο από το σπίτι τους ή την δουλειά τους μέσω Η/Υ. 1999: Συνεργασία του Φροντιστηρίου μας με τον Ραδιοφωνικό Σταθμό 9.84 μέσω του οποίου εκφωνεί τις λύσεις των Θεμάτων όλων των μαθημάτων. Συνεργασία επίσης για την έντυπη λύση των Θεμάτων με την Εφημερίδα "ΝΙΚΗ". Τηλεοπτική Παρουσίαση των θέσεων της Ο.Ε.Φ.Ε για την εκπαιδευτική μεταρρύθμιση από τον κ. Βεργιόπουλο. 2000: Δημιουργία ομάδας με υπεύθυνο τον κ. Βεργιόπουλο με αντικείμενο την εκπαίδευση στους Η/ Υ και το Internet. 2003: Εισαγωγή του Ελεύθερου και Γραμμικού Σχεδίου στο πρόγραμμα σπουδών του Φροντιστηρίου μας. Χορηγία ομάδας ποδοσφαίρου του 15ου Γυμνασίου Αθηνών, και ομάδων μπάσκετ και βόλεϊ του 15ου     και του 60ου Λυκείου Αθηνών. 2004: Χορηγία θεατρικής ομάδας 60ου Λυκείου Αθηνών. Χορηγία ομάδων μπάσκετ και βόλεϊ του 15ου και του 60ου Λυκείου Αθηνών. 2005: Εισαγωγή των ξένων γλωσσών στα προγράμματά μας για τα ειδικά μαθήματα. 2006: Ίδρυση του διδακτηρίου στον Άλιμο και εισαγωγή της   μουσικής στα προγράμματά μας για το ειδικό μάθημα.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/vergiopoulos');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




     /*=============== 23 Νίκα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Νίκα', 'email' => 'nika-edu@ath.forthnet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'nika'])->id,
         'address' => 'Φιλαδελφείας 33, Νίκαια',
         'city' => 'Αθήνα',
         'phone' => 2104250253,
         'type_id' => 3,
         'website' => 'nika.edu.gr',
         'approved' => 1,
         'about' => '
             Τα φροντιστήρια μέσης εκπαίδευσης «ΝΙΚΑ» λειτουργούν στη Νίκαια από το 1995. Διασφαλίζοντας την υψηλότερη ποιότητα διδασκαλίας και ακολουθώντας τις πιο σύγχρονες μεθόδους φέρνουν πρώτους τους μαθητές τους με πολύ υψηλά ποσοστά επιτυχίας στις πανελλήνιες εξετάσεις.
             Το εξειδικευμένο και άρτια καταρτισμένο διδακτικό προσωπικό στέκεται δίπλα στους μαθητές, ενισχύοντας στο μέγιστο τις δυνατότητες τους.
             Όλοι οι καθηγητές είναι κάτοχοι μεταπτυχιακών ή διδακτορικών τίτλων.
             Το κτίριο μας αποτελεί πρότυπο εγκαταστάσεων, είναι πρόσφατα ανακαινισμένο και διαθέτει αίθουσες οι οποίες είναι άρτια εξοπλισμένες με διαδραστικούς πίνακες και πλήθος εποπτικών μεσών.
             Τα φροντιστήρια «ΝΙΚΑ», θέλοντας να διασφαλίσουν την ποιότητα των παρεχόμενων υπηρεσιών τους, είναι μέλος της Ομοσπονδίας Φροντιστών Ελλάδος (ΟΕΦΕ) και του Συλλόγου Φροντιστών Αττικής (ΣΕΦΑ).
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');





     /*=============== 24 Αριστεύειν Ελληνικό ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Αριστεύειν Ελληνικό', 'email' => 'info2@aristevein.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'aristevein2'])->id,
         'address' => 'Ιασωνίδου 63, Ελληνικό',
         'city' => 'Αθήνα',
         'phone' => 2109607832,
         'type_id' => 3,
         'website' => 'aristevein.gr',
         'approved' => 1,
         'about' => '
            Αγαπητοί μαθητές, γονείς,
            τα πρότυπα εκπαιδευτικά κέντρα αριστεύειν σας καλωσορίζουν και σας εύχονται ολόψυχα καλή σχολική χρονιά.
            Τα φροντιστήρια αριστεύειν καθιερώνουν ένα νέο ποιοτικό πρότυπο στο χώρο της δευτεροβάθμιας εκπαίδευσης, προωθώντας ένα μαθητοκεντρικό μοντέλο μάθησης και εστιάζοντας προσεκτικά σε κάθε μαθητή ξεχωριστά.
            Από το 2004 (έτος έναρξης της λειτουργίας μας)έως και σήμερα τα φροντιστήρια αριστεύειν βαθμολογούνται με "άριστα" στην εξωτερική αξιολόγηση της ποιότητας υπηρεσιών και φιλοδοξούν να επαναλάβουν την ίδια επιτυχία και τη νέα σχολική περίοδο.
            Συνεχίζουν τις επιτυχίες στην εισαγωγή των μαθητών τους στην 3-βάθμια εκπαίδευση με άριστο ποσοστό εισαγωγής στις πρώτες σχολές επιλογής κάθε υποψηφίου (πίνακας επιτυχιών).
            Αυτές οι επιτυχίες βασίζονται στους εξής κύριους άξονες:
            Ολιγομελή και ομοιογενή τμήματα
            Σεβασμό στη διαφορετικότητα κάθε μαθητή μας
            Στοχευμένη επιλογή καθηγητών: Oι περισσότεροι με Master, ορισμένοι και με Διδακτορικό και εμπειρία τουλάχιστον 10 ετών με αγάπη για το εκπαιδευτικό έργο και τα παιδιά. Η επιλογή τους έχει γίνει μετά από εξέταση εκατοντάδων βιογραφικών και δεκάδων υποψηφίων
            Καινοτόμο σύστημα μελέτης ώστε ο μαθητής να διδάσκεται πως να μαθαίνει.
            Μοναδικό σύστημα οργάνωσης-επίβλεψης μελέτης (coaching) ώστε ο μαθητής να οργανώνει σωστά το χρόνο του
            Διατμηματικά προγράμματα εφαρμογής των δομικών εννοιών συγκεκριμένων μαθημάτων σε άλλα
            Ψυχολογική υποστήριξη των μαθητών και συνεχής ενημέρωση των γονέων.
            Συνεχής ενημέρωση των γονέων για την πρόοδο των μαθητών
            Υλικοτεχνική υποδομή υψηλών προδιαγραφών
            Στα φροντιστήρια αριστεύειν ο μαθητής μαθαίνει να εργάζεται εποικοδομητικά και έντονα απολαμβάνοντας στο τέλος τους καρπούς της προσπάθειάς του.
            Μέσω ενός τηλεφωνήματος στην γραμματεία μας μπορείτε να προγραμματίσετε συνάντηση με το διευθυντή σπουδών στο φροντιστήριο (ή και άμεση τηλεφωνική επαφή) για να συζητήσουμε χωρίς καμία δέσμευση για οποιοδήποτε θέμα σας απασχολεί ή να σας ενημερώσουμε για το εκπαιδευτικό σύστημα.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');



     /*=============== 25 Αριστεύειν  Αργυρούπολη ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Αριστεύειν Αργυρούπολη', 'email' => 'info@aristevein.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'aristevein'])->id,
         'address' => 'Εθνάρχου Μακαρίου 13, Αργυρούπολη',
         'city' => 'Αθήνα',
         'phone' => 2109919803,
         'type_id' => 3,
         'website' => 'aristevein.gr',
         'approved' => 1,
         'about' => '
            Αγαπητοί μαθητές, γονείς,
            τα πρότυπα εκπαιδευτικά κέντρα αριστεύειν σας καλωσορίζουν και σας εύχονται ολόψυχα καλή σχολική χρονιά.
            Τα φροντιστήρια αριστεύειν καθιερώνουν ένα νέο ποιοτικό πρότυπο στο χώρο της δευτεροβάθμιας εκπαίδευσης, προωθώντας ένα μαθητοκεντρικό μοντέλο μάθησης και εστιάζοντας προσεκτικά σε κάθε μαθητή ξεχωριστά.
            Από το 2004 (έτος έναρξης της λειτουργίας μας)έως και σήμερα τα φροντιστήρια αριστεύειν βαθμολογούνται με "άριστα" στην εξωτερική αξιολόγηση της ποιότητας υπηρεσιών και φιλοδοξούν να επαναλάβουν την ίδια επιτυχία και τη νέα σχολική περίοδο.
            Συνεχίζουν τις επιτυχίες στην εισαγωγή των μαθητών τους στην 3-βάθμια εκπαίδευση με άριστο ποσοστό εισαγωγής στις πρώτες σχολές επιλογής κάθε υποψηφίου (πίνακας επιτυχιών).
            Αυτές οι επιτυχίες βασίζονται στους εξής κύριους άξονες:
            Ολιγομελή και ομοιογενή τμήματα
            Σεβασμό στη διαφορετικότητα κάθε μαθητή μας
            Στοχευμένη επιλογή καθηγητών: Oι περισσότεροι με Master, ορισμένοι και με Διδακτορικό και εμπειρία τουλάχιστον 10 ετών με αγάπη για το εκπαιδευτικό έργο και τα παιδιά. Η επιλογή τους έχει γίνει μετά από εξέταση εκατοντάδων βιογραφικών και δεκάδων υποψηφίων
            Καινοτόμο σύστημα μελέτης ώστε ο μαθητής να διδάσκεται πως να μαθαίνει.
            Μοναδικό σύστημα οργάνωσης-επίβλεψης μελέτης (coaching) ώστε ο μαθητής να οργανώνει σωστά το χρόνο του
            Διατμηματικά προγράμματα εφαρμογής των δομικών εννοιών συγκεκριμένων μαθημάτων σε άλλα
            Ψυχολογική υποστήριξη των μαθητών και συνεχής ενημέρωση των γονέων.
            Συνεχής ενημέρωση των γονέων για την πρόοδο των μαθητών
            Υλικοτεχνική υποδομή υψηλών προδιαγραφών
            Στα φροντιστήρια αριστεύειν ο μαθητής μαθαίνει να εργάζεται εποικοδομητικά και έντονα απολαμβάνοντας στο τέλος τους καρπούς της προσπάθειάς του.
            Μέσω ενός τηλεφωνήματος στην γραμματεία μας μπορείτε να προγραμματίσετε συνάντηση με το διευθυντή σπουδών στο φροντιστήριο (ή και άμεση τηλεφωνική επαφή) για να συζητήσουμε χωρίς καμία δέσμευση για οποιοδήποτε θέμα σας απασχολεί ή να σας ενημερώσουμε για το εκπαιδευτικό σύστημα.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');



     /*=============== 26 Σύγχρονο Αγία Παρασκευή ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Σύγχρονο Αγία Παρασκευή', 'email' => 'aparaskevi@synchrono.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'synchronoAgiaParaskevi'])->id,
         'address' => 'Ηρώων Πολυτεχνείου 8, Αγία Παρασκευή',
         'city' => 'Αθήνα',
         'phone' => 2106000682,
         'type_id' => 3,
         'website' => 'synchrono.gr',
         'approved' => 1,
         'about' => '
             Όραμα & Στόχος
             Στο Σύγχρονο προετοιμάζουμε τους μαθητές για τις πανελλαδικές εξετάσεις εδώ και τρεις δεκαετίες. Γνωρίζουμε ότι πρωταγωνιστές στην προσπάθεια αυτή είναι οι μαθητές, όμως αναγνωρίζουμε ότι η επιτυχία είναι αποτέλεσμα συνεργασίας.
             Γι’ αυτό είμαστε υπεύθυνα δίπλα τους σε όλα τα στάδια της προσπάθειάς τους με ένα δοκιμασμένο σύστημα εκπαιδευτικών πρακτικών και επιλογών που περιλαμβάνει:
             συστηματική καθοδήγηση για μελέτη
             κάλυψη κενών
             γραπτές δοκιμασίες
             διαχείριση του χρόνου
             συνεχή συνεργασία και ενημέρωση.
             Με γνώση, εμπειρία και αποτελεσματική εκπαιδευτική μεθοδολογία καθοδηγούμε τους νέους, ώστε να αποκτήσουν γνώσεις, ικανότητες και δεξιότητες που τους οδηγούν στη σχολή της πρώτης επιλογής τους, τους δίνουν τη δυνατότητα να ακολουθήσουν καλές σπουδές και να εξασφαλίσουν την επαγγελματική τους εξέλιξη.

            Ιστορία
            Το Σύγχρονο ιδρύθηκε στην πλατεία Κάνιγγος το 1988 και  επεκτάθηκε:
            1998:  στην Αγία Παρασκευή και στη Γλυφάδα
            2004: στα Γλυκά Νερά
            2006: στην Παλλήνη
            30 χρόνια ποιοτικής εκπαίδευσης, επιτυχίας χιλιάδων μαθητών
            Τα θετικά αποτελέσματα μάς ωθούν να συνεχίζουμε με το ίδιο πάθος και τις ίδιες αρχές.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/synchrono.gr');



     /*=============== 27 Σύγχρονο Γλυκά Νερά ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Σύγχρονο Γλυκά Νερά', 'email' => 'glykanera@synchrono.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'synchronoGlykaNera'])->id,
         'address' => 'Χρυσανθέμων 3, Γλυκά Νερά',
         'city' => 'Αθήνα',
         'phone' => 2106658218,
         'type_id' => 3,
         'website' => 'synchrono.gr',
         'approved' => 1,
         'about' => '
             Όραμα & Στόχος
             Στο Σύγχρονο προετοιμάζουμε τους μαθητές για τις πανελλαδικές εξετάσεις εδώ και τρεις δεκαετίες. Γνωρίζουμε ότι πρωταγωνιστές στην προσπάθεια αυτή είναι οι μαθητές, όμως αναγνωρίζουμε ότι η επιτυχία είναι αποτέλεσμα συνεργασίας.
             Γι’ αυτό είμαστε υπεύθυνα δίπλα τους σε όλα τα στάδια της προσπάθειάς τους με ένα δοκιμασμένο σύστημα εκπαιδευτικών πρακτικών και επιλογών που περιλαμβάνει:
             συστηματική καθοδήγηση για μελέτη
             κάλυψη κενών
             γραπτές δοκιμασίες
             διαχείριση του χρόνου
             συνεχή συνεργασία και ενημέρωση.
             Με γνώση, εμπειρία και αποτελεσματική εκπαιδευτική μεθοδολογία καθοδηγούμε τους νέους, ώστε να αποκτήσουν γνώσεις, ικανότητες και δεξιότητες που τους οδηγούν στη σχολή της πρώτης επιλογής τους, τους δίνουν τη δυνατότητα να ακολουθήσουν καλές σπουδές και να εξασφαλίσουν την επαγγελματική τους εξέλιξη.

            Ιστορία
            Το Σύγχρονο ιδρύθηκε στην πλατεία Κάνιγγος το 1988 και  επεκτάθηκε:
            1998:  στην Αγία Παρασκευή και στη Γλυφάδα
            2004: στα Γλυκά Νερά
            2006: στην Παλλήνη
            30 χρόνια ποιοτικής εκπαίδευσης, επιτυχίας χιλιάδων μαθητών
            Τα θετικά αποτελέσματα μάς ωθούν να συνεχίζουμε με το ίδιο πάθος και τις ίδιες αρχές.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/synchrono.gr');





     /*=============== 28 Νεόραμα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Νεόραμα', 'email' => 'info@neorama.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'neorama'])->id,
         'address' => 'Δημητρακοπούλου 86, Κορυδαλλός',
         'city' => 'Αθήνα',
         'phone' => 2105691694,
         'type_id' => 3,
         'website' => 'neorama.gr',
         'approved' => 1,
         'about' => '
               Ίδρυση
               Το Φροντιστήριο Νεόραμα ιδρύθηκε το 2000 στον Κορυδαλλό.
               Ο σκοπός μας είναι, η παροχή ολοκληρωμένων υπηρεσιών εκπαίδευσης Γυμνασίου, Λυκείου και συμβουλευτικής υποστήριξης.
               Η διαρκής ανάπτυξη του Φροντιστηρίου απαιτούσε την απόκτηση μεγαλύτερων υποδομών. Έτσι το 2005 μεταφερθήκαμε από την οδό Καυκάσου στις ιδιόκτητες εγκαταστάσεις μας, στην οδό Δημητρακοπούλου 86 και Αμοργού, στον Κορυδαλλό.
               Το Φροντιστήριο Νεόραμα εμπιστεύτηκαν και εμπιστεύονται πολλοί μαθητές και σπουδαστές. Οι περισσότεροι από αυτούς είναι σήμερα φοιτητές ή απόφοιτοι των ΑΕΙ των ΤΕΙ και των Στρατιωτικών Σχολών.
               Όραμα
               Από την αρχή της ίδρυσής μας οραματιστήκαμε να αποτελέσουμε μία δυναμική και πρωτοποριακή εκπαιδευτική μονάδα που θα δημιουργεί επιτυχημένους ανθρώπους.
               Όραμα
               Φροντίζουμε γι αυτό συνεχώς:

               Είμαστε συνεχώς εξελισσόμενοι, ενημερωμένοι για τις σύγχρονες εκπαιδευτικές μεθόδους και ανθρώπινοι.
               Πρωτοπορούμε σε εκπαιδευτικές ιδέες χρησιμοποιώντας τουλάχιστον 10 χρόνια πριν τα υπόλοιπα φροντιστήρια, μεθόδους που σήμερα οι άλλοι τις θεωρούν «σύγχρονες» ή δεν τις γνωρίζουν καν. Ας δούμε μερικές τέτοιες:
               2000: τηλεκπαίδευση, εικονικά εργαστήρια
               2002: διαδραστικός πίνακας
               2003: ηλεκτρονικό φροντιστήριο
               2010. θερινό σχολείο (μέρος της προετοιμασίας γίνεται στη Φοινικούντα Μεσσηνίας σε κατάλληλα διαμορφωμένο χώρο κοντά στη θάλασσα),
               Δεν είμαστε απρόσωπη επιχείρηση. Αποτελούμε μια δυνατή ομάδα καθηγητών. Συνεργαζόμαστε από την αρχή της ίδρυσής μας και συγκεντρώνουμε τις δυνάμεις μας σε ένα φροντιστήριο, το ΝΕΟΡΑΜΑ, με επίκεντρο την επιτυχημένη πορεία των μαθητών μας στο σχολείο τους και την εισαγωγή τους στην ανώτατη εκπαίδευση,
               Η διεύθυνση του φροντιστηρίου, συμμετέχει ενεργά και επικοινωνεί με τους γονείς και τους μαθητές σε όλα τα στάδια της εκπαίδευσης των παιδιών μας.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 14, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/NEOPAMA-116182126530');
       Scholio::portalSocial($fake, 'twitter',  'https://twitter.com/NEOPAMA');




     /*=============== 29 Παπαδέα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Παπαδέα', 'email' => 'papadeaefi@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'papadeaefi'])->id,
         'address' => 'Θηβών 399, Αιγάλεω',
         'city' => 'Αθήνα',
         'phone' => 2105909095,
         'type_id' => 3,
         'website' => 'papadea.gr',
         'approved' => 1,
         'about' => '
                Οι εγγραφές στα Φροντιστήρια Παπαδέα γίνονται όλο το χρόνο. Θα συμπληρώσετε ένα έντυπο με τα στοιχεία σας και ενδεχομένως -ανάλογα με το πρόγραμμα που σας ενδιαφέρει- θα κάνετε ένα διαγνωτσικό τέστ για να ενταχθείτε στο καταλληλο τμήμα.
                Οι γραμματείες των Φροντιστηρίων Παπαδέα λειτουργούν
                καθημερινά 09:00-13:00 και 15:00-21:00.
                Ενημερωθείτε για τα προγράμματα και τις ώρες μαθημάτων.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματ', 'Εκπαιδευτική Ρομποτική', ' Ρομποτική & STEM');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/papadea.gr');



     /*=============== 30 Εκμάθηση Γαλάτσι ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Εκμάθηση Γαλάτσι', 'email' => 'info@ekmathisi.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
         'address' => 'Αστέρων 13, Γαλάτσι',
         'city' => 'Αθήνα',
         'phone' => 2102139438,
         'type_id' => 4,
         'website' => 'ekmathisi.edu.gr',
         'approved' => 1,
         'about' => '
              H ekmathisi είναι ο εκπαιδευτικός οργανισμός που αλλάζει τα δεδομένα στην εκμάθηση ξένων γλωσσών. Τώρα όλοι μπορούν να μάθουν ξένες γλώσσες στο χώρο τους (σπίτι ή εργασία) από καταξιωμένους καθηγητές που ακολουθούν το εκπαιδευτικό πρόγραμμα που ορίζεται από την ekmathisi σε τιμέςίσες ή και χαμηλότερες από ένα μέσο φροντιστήριο. Οι επιλογές μαθημάτων που έχετε είναι:
              Ιδιαίτερα ατομικά μαθήματα στο χώρο σας
              (για παιδιά, εφήβους ή ενήλικες)
              Μαθήματα στο χώρο σας σε ομάδες 2 ή 3 ατόμων
              (για παιδιά, εφήβους ή ενήλικες)ekmathisi
              Ιδιαίτερα ατομικά μαθήματα στην ψηφιακή αίθουσα διδασκαλίας
              (για εφήβους ή ενήλικες)
              Ομαδικά μαθήματα στην ψηφιακή αίθουσα διδασκαλίας
              (για εφήβους ή ενήλικες)
              Σεμινάρια εξειδικευμένα για επιχειρήσεις
              (για επαγγελματίες)

              Το όραμά μας
              Η ekmathisi είναι η προσπάθεια των ιδρυτών (Βαγγέλης Γωγούσης – Έλενα Χατζηκυριάκου – Ελένη Γωγούση) του κέντρου ξένων γλωσσών Επικοινωνία epikinonia-logo-trans να οργανώσουμε την τεχνική, γνώση και εμπειρία που έχουμε αποκτήσει από τη λειτουργία του φροντιστηρίου (από το 1997) και τα ιδιαίτερα μαθήματα (από το 2008) σε ένα καινούριο οργανισμό που θα συνδιάζει τα πλεονεκτήματα των φροντιστηριακών μαθημάτων και των ιδιαιτέρων μαθημάτων.
              Στην ekmathisi θέλουμε να προσφέρουμε ποιοτικά μαθήματα ξένων γλωσσών και πληροφορικής στο χώρο των μαθητών σε τιμές φροντιστηρίου  έτσι ώστε όλοι να μπορούν να μάθουν ξένες γλώσσες και πληροφορική εύκολα, ευχάριστα και οικονομικά.

              Οι βασικές αρχές μας – μαθαίνω εύκολα, ευχάριστα και οικονομικά
              H ekmathisi είναι ο εκπαιδευτικός οργανισμός που αλλάζει τα δεδομένα στην εκμάθηση ξένων γλωσσών. Τώρα όλοι μπορούν να μάθουν ξένες γλώσσες στο χώρο τους (σπίτι ή εργασία) από καταξιωμένους καθηγητές που ακολουθούν το εκπαιδευτικό πρόγραμμα που ορίζεται από την ekmathisi σε τιμές ίσες ή και χαμηλότερες από ένα μέσο φροντιστήριο.
              Μαθαίνω εύκολα  με τους καταξιωμένους και απόλυτα εκπαιδευμένους καθηγητές που με οδηγούν με ασφάλεια και επιτυχία στην εκμάθηση ξένων γλωσσών και πληροφορικής.
              Μαθαίνω ευχάριστα  μέσα από διαδραστικά προγράμματα που εξασφαλίζουν το ενδιαφέρον και την ενεργητική συμμετοχή των μαθητών, ώστε να αποκτήσουν άριστη γνώση γρήγορα και ευχάριστα.
              Μαθαίνω οικονομικά
            ',
         'background' => $background,
     ]);

     new Portal($fake, 8, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Κινέζικα');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');


     Scholio::portalStudy($fake, 'Παιδικά Τμήματα ', 'Πληροφορική', 'Πληροφορική');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Πληροφορική');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/ekmathisi.edu.gr');
       Scholio::portalSocial($fake, 'google-plus', 'https://plus.google.com/118144029962186042819');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/ekmathisi');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCH7xLCtgF_ORdwfFmoqWZ0A');






    }



}
