<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria10 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;



     /*=============== 1 Πολυχώρος Γνώσης ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Πολυχώρος Γνώσης', 'email' => 'polixorosgnosis@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'polixorosgnosis'])->id,
         'address' => 'Στρατηγού Μακρυγιάννη 56, Άγιος Δημήτριος',
         'city' => 'Αθήνα',
         'phone' => 2109961317,
         'type_id' => 3,
         'website' => 'polixorosgnosis.eu',
         'approved' => 1,
         'about' => '
            Το φροντιστήριο Μ.Ε πολυχώρος ΓΝώΣΗς σε σύντομο χρονικό διάστημα άλλαξε τα δεδομένα του φροντιστηριακού χώρου στη ευρύτερη περιοχή του Αγίου Δημητρίου και Αλίμου, παρέχοντας υψηλού επιπέδου υπηρεσίες εκπαίδευσης σε μαθητές και μαθήτριες Γυμνασίου, Γενικού και Επαγγελματικού Λυκείου.
            Η βελτίωση που παρουσίασαν οι σπουδαστές μας στην επίδοση τους και το ποσοστό των επιτυχιών τους στις Πανελλαδικές Εξετάσεις μας κάνει υπερήφανους.
            Η εκπαίδευση όμως είναι "αλυσίδα" και το Όραμά μας είναι να μεταλαμπαδεύσουμε τη γνώση, τον πολιτισμό , την πνευματική διαφώτιση και στους μικρούς μας φίλους.
            Για τον σκοπό αυτό δημιουργήσαμε  ένα νέο χώρο, ανεξάρτητο, με μοντέρνες ασφαλείς και πλήρως λειτουργικές προδιαγραφές,  για τη μελέτη, την εκπαίδευση, τις δημιουργικές εργασίες των μαθητών του Δημοτικού και Γυμνασίου καθώς και τη βιοματική μάθηση σε παιδιά προσχολικής ηλικίας.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 12, 'frontistirio');

        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', ' Ρομποτική & STEM');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/polixorosgnosis');





     /*=============== 2 Κύτταρο ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτικός Όμιλος Κύτταρο', 'email' => 'info@kuttaro.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'kuttaroNeoHrakleio'])->id,
         'address' => 'Ρούμελης 10, Νέο Ηράκλειο',
         'city' => 'Αθήνα',
         'phone' => 2130245204,
         'type_id' => 3,
         'website' => 'kuttaro.edu.gr',
         'approved' => 1,
         'about' => '

         Γιατί Κύτταρο;

            ΓΙΑΤΙ ΦΡΟΝΤΙΖΟΥΜΕ
            ΤΟΥΣ ΜΑΘΗΤΕΣ ΜΑΣ ΠΑΡΕΧΟΝΤΑΣ:

            Στήριξη και καθοδήγηση με τις Προσωπικές Συνεντεύξεις.
            Ενδιαφέρον για την εικόνα προόδου και φροντίδα για την κάλυψη των "κενών".
            Πρόγραμμα διαχείρισης Χρόνου και Ύλης.
            Σεμινάριο ενημέρωσης Επαγγελματικού Προσανατολισμού και Συμπλήρωση Μηχανογραφικού.
            Test επαγγελματικού προσανατολισμού και την ψυχομετρική ανάλυση αξίας 180ευρώ (στους μαθητές μας δωρεάν).
            Δημιουργώντας πραγματικά ολιγομελή τμήματα ( 6μελή ).
            Όλα τα Θέματα Πανελλαδικών και της Ο.Ε.Φ.Ε. με τις λύσεις τους.
            Συμμετοχή στα Διαγωνίσματα Προσομοίωσης της Ο.Ε.Φ.Ε. (Ομοσπονδία Εκπαιδευτικών Φροντιστών Ελλάδος).
            Οδηγίες για ατομική προστασία και ασφαλή εγκατάλειψη του κτιρίου σε περίπτωση πυρκαγιάς ή σεισμού.
            Πληροφορίες για τα προνόμια της Φοιτητικής Ζωής και τις εξωδιδακτικές παροχές και δυνατότητες των φοιτητών.
            Πρόγραμμα Διατροφής για την περίοδο των Πανελλαδικών Εξετάσεων.
            Ενημερωτικά έντυπα επίσημων φορέων για τις επιπτώσεις των ουσιών εξάρτησής [αλκοόλ, νικοτίνη, ναρκωτικά κ.λ.π].
            Τη δυνατότητα 2 φορές το χρόνο να πουν ελευθέρα και ανώνυμα τη γνώμη τους για το Φροντιστήριό μας , με το Δελτίο Αξιολόγησης του Φροντιστηρίου από τους Μαθητές.

            ΓΙΑΤΙ ΕΝΔΙΑΦΕΡΟΜΑΣΤΕ
            ΓΙΑ ΤΙΣ ΟΙΚΟΓΕΝΕΙΕΣ ΤΟΥΣ
            Ενημέρωση Γονέων.
            Ατομικός Κωδικός Πρόσβασης.
            Συμβουλευτική Διαχείρισης των παιδιών.
            Άμεση ειδοποίηση σε περίπτωση απουσίας του παιδιού.
            Τη δυνατότητα 2 φορές το χρόνο να πουν ελευθέρα και ανώνυμα τη γνώμη τους για το Φροντιστήριό μας , με το Δελτίο Αξιολόγησης του Φροντιστηρίου από τους Γονείς.
            Αγάπη και Φροντίδα για τα παιδιά μας.

            ΓΙΑΤΙ ΕΙΜΑΣΤΕ ΕΠΑΓΓΕΛΜΑΤΙΕΣ ΤΟΥ ΧΩΡΟΥ...

            ΚΑΙ ΜΑΘΑΙΝΟΥΜΕ ΤΑ ΠΑΙΔΙΑ ΜΑΣ

            Να εργάζονται και να "λειτουργούν" μέσα στην τάξη αξιοποιώντας τη δυναμική της.
            Να διαχειρίζονται σωστά το χρόνο τους.
            Να οργανώνουν το διάβασμά τους.
            Να μετασχηματίζουν την πληροφορία σε γνώση.
            Να αξιοποιούν τις συνεχείς γραπτές δοκιμασίες του Φροντιστηρίου μας προκειμένου να βελτιστοποιηθούν στην αντιμετώπιση των τελικών εξετάσεων.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', ' Ρομποτική & STEM');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/profile.php?id=100012377208460');




        /*=============== 3 Αριστοβάθμιο ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Αριστοβάθμιο', 'email' => 'aristovathmio@gmail.com ', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'aristovathmio'])->id,
            'address' => 'Τζαβέλλα 55, Καστέλλα',
            'city' => 'Αθήνα',
            'phone' => 2104125440,
            'type_id' => 3,
            'website' => 'aristovathmio.gr',
            'approved' => 1,
            'about' => '
                    Τo Αριστοβάθμιο Φροντιστήριο συνεχίζει δυναμικά μετά από μια διετή επιτυχημένη λειτουργία ,σε νέο ανανεωμένο και λειτουργικό χώρο, να πρωταγωνιστεί στο χώρο της φροντιστηριακής εκπαίδευσης. Τα υψηλά ποσοστά επιτυχίας και η επίτευξη υψηλών βαθμολογιών επιβεβαιώνουν τις άριστες εκπαιδευτικές υπηρεσίες μας.

                    Προσηλωμένοι στους στόχους μας διατηρούμε πιστά τις εκπαιδευτικές μας αρχές :

                    Συστηματικό και οργανωμένο πρόγραμμα προσαρμοσμένο στις ανάγκες των μαθητών
                    Ολιγομελή και ομοιογενή τμήματα
                    Έλεγχος των γνώσεων με συχνά επαναληπτικά διαγωνίσματα
                    Επιπλέον διδακτικές ώρες για την κάλυψη κενών
                    Προσωπική σχέση με τους μαθητές μας
                    Άνετο και ευχάριστο περιβάλλον
                    Εξειδικευμένο και άρτια καταρτισμένο εκπαιδευτικό προσωπικό
                    Χρήση Νέων Τεχνολογιών
                    Πλατφόρμα e-learning
                    Επαγγελματικός προσανατολισμός
                    Φύλλα εργασίας  με εποπτεία στο φροντιστήριο σε προκαθορισμένες ημέρες , στο πλαίσιο του προγράμματος σπουδών.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/aristovathmio');





        /*=============== 4 Δυναμικό Πεύκη ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Δυναμικό Πεύκη', 'email' => 'dynamico@dynamico.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'dynamico'])->id,
            'address' => 'Λεωφόρος Ειρήνης 43, Πεύκη',
            'city' => 'Αθήνα',
            'phone' => 2106125082,
            'type_id' => 3,
            'website' => 'dynamico.gr',
            'approved' => 1,
            'about' => '
                Η φιλοσοφία μας
                Η φιλοσοφία μας ως εκπαιδευτικοί υπηρετεί μόνο έναν στόχο: τη δημιουργική, αποδοτική και ευχάριστη πορεία του μαθητή μας από την Α΄ Λυκείου μέχρι και την κατάθεση του μηχανογραφικού στο τέλος της Γ΄ Λυκείου.

                Οι στόχοι μας

                Η δημιουργία και διατήρηση ενός υγιούς περιβάλλοντος μάθησης, στο οποίο τα παιδιά δεν αντιλαμβάνονται τη γνώση σαν καταναγκασμό αλλά σαν προσωπική ευχαρίστηση.
                Η ανάπτυξη δεξιοτήτων από την πλευρά των μαθητών και η ουσιαστική απόκτηση γνώσεων.
                Η κατανόηση της σχολικής ύλης σε βάθος ώστε οι μαθητές να αντιλαμβάνονται το ΓΙΑΤΙ και το ΠΩΣ κάθε γνωστικής ενότητας.
                Η επιτυχία των παιδιών στις εξετάσεις τους με τρόπο που να αντικατοπτρίζει τις γνώσεις τους και να τα γεμίζει σιγουριά και αυτοπεποίθηση για το μέλλον.
                Η επιτυχία των μαθητών στις Πανελλήνιες εξετάσεις και η εισαγωγή τους σε σχολές της επιλογής τους έτσι ώστε ταυτόχρονα να τους εξασφαλίσουν και εφόδια στην αγορά εργασίας.
                Τα μέσα μας

                Οι καθηγητές του εκπαιδευτικού μας οργανισμού είναι άρτια καταρτισμένοι στο γνωστικό τους αντικείμενο , έχουν πολυετή παρουσία στην εκπαίδευση και αξιόλογο συγγραφικό έργο.
                Παροχή βιβλίων που καλύπτουν με ολοκληρωμένο και πρωτότυπο περιεχόμενο την διδακτέα ύλη σε όλα τα μαθήματα. Τα συγγράμματα αυτά συμπληρώνουν την ύλη των σχολικών εγχειριδίων και μέσα από παραδείγματα και πρωτότυπες ασκήσεις εμπεδώνεται σε βάθος το εκάστοτε γνωστικό αντικείμενο.
                Σύνδεση εκπαίδευσης και νέων τεχνολογιών: η διδασκαλία συνοδεύεται από την χρήση οπτικοακουστικών μέσων (διαδραστικοί πίνακες και  κατάλληλα ψηφιακά προγράμματα) συμπληρώνοντας τον αναντικατάστατο παραδοσιακό τρόπο διδασκαλίας.
                Ομοιογένεια στα τμήματα: από την αρχή της σχολικής χρονιάς εξασφαλίζεται μέγιστη δυνατή ομοιογένεια μέσα από συνέντευξη και διαγνωστικά τεστ. Κατά τη διάρκεια της σχολικής περιόδου το φροντιστήριο έχει τη δυνατότητα αναδιάρθρωσης των τμημάτων ανάλογα με την επίδοση των μαθητών.
                Ολοκληρωμένο σύστημα αξιολόγησης: συνεχής παρακολούθηση της επίδοσης των μαθητών μέσα από ένα σύστημα αξιολόγησης που περιλαμβάνει τεστ, διαγωνίσματα, εργασίες στο σπίτι, κ.τ.λ. Ιδιαίτερη έμφαση δίνεται στα υποχρεωτικά τρίωρα διαγωνίσματα καθ΄ όλη τη διάρκεια της χρονιάς βάσει καθορισμένου προγράμματος που καθορίζεται από την έναρξή της. Η μορφή και το περιεχόμενό τους εξασφαλίζει, μεταξύ των άλλων, την εξοικείωση των μαθητών με τις Πανελλήνιες εξετάσεις.
                Επαγγελματικός προσανατολισμός: συμμεριζόμενοι την αγωνία των παιδιών μας,  ανταποκριθήκαμε ερχόμενοι σε συνεργασία με την έγκυρη εταιρία Επαγγελματικού Προσανατολισμού Edu Job (www.edujob.gr) , προσφέροντας στους μαθητές μας τη δυνατότητα διερεύνησης των κλίσεων, των ικανοτήτων και των προτιμήσεών τους. Οι ειδικοί της Edu Job αναλύουν τις απαντήσεις των παιδιών και η έκθεση παρουσιάζεται στους γονείς και το μαθητή. Η συνολική εκτίμηση των αποτελεσμάτων, διευκολύνουν και θωρακίζουν το μαθητή ώστε να κάνει τη σωστή επιλογή.
                Ομάδες συμβουλευτικής: κάτω από την επίβλεψη καταρτισμένου επιστημονικού δυναμικού οι ομάδες συμβουλευτικής έχουν ως σκοπό τη διαχείριση του άγχους κατά τη διάρκεια της προετοιμασίας των εξετάσεων. Στο ίδιο πλαίσιο δίνεται και η δυνατότητα δημιουργίας ομάδας γονέων ώστε να μπορούν να σταθούν κατάλληλα δίπλα στα παιδιά διαχειριζόμενοι και αυτοί με τη σειρά τους τις αγωνίες και το άγχος τους.
                Παράλληλα το Δυναμικό Φροντιστήριο Πεύκης   διοργανώνει κοινωνικές εκδηλώσεις, συζητήσεις, εκθέσεις φωτογραφίας ,  εκδρομές συμβάλλοντας στην ενημέρωση και τη ψυχαγωγία και επενδύοντας σε αρκετές πτυχές της ανθρώπινης προσωπικότητας.

                Σας ευχαριστούμε για την αγάπη που μας περιβάλλει όλα αυτά τα χρόνια της λειτουργίας μας και δεσμευόμαστε πως θα συνεχίσουμε με αμείωτο ρυθμό να μοχθούμε προς όφελος των μαθητών μας.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 7, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


        /*=============== 5 Μαθητική Επιλογή ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Μαθητική Επιλογή', 'email' => 'info@mathepilogi.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'mathepilogi'])->id,
            'address' => 'Αγιού Νικολάου 108,  Ίλιον',
            'city' => 'Αθήνα',
            'phone' => 2155556191,
            'type_id' => 3,
            'website' => 'mathepilogi.gr',
            'approved' => 1,
            'about' => '
                Η Μαθηματική Επιλογή βοηθάει τον μαθητή να αποκτήσει σωστές βάσεις από το γυμνάσιο, να καλύψει τυχόν κενά προηγούμενων ετών στο λύκειο, με σκοπό την επιτυχία του στις πανελλήνιες. Είμαστε δίπλα στο  μαθητή σε ατομικό επίπεδο αντιμετωπίζοντας οποιαδήποτε δυσκολία του, επιβραβεύοντας και ενισχύοντας κάθε προσπάθειά του.
                Πραγματοποιείται διετής προετοιμασία για τις πανελλήνιες εξετάσεις. Οι μαθητές διδάσκονται παράλληλα με την ύλη της Β΄ Λυκείου και ένα τμήμα ύλης της Γ΄ Λυκείου. Με αυτό τον τρόπο οι μαθητές έχουν πολύ χρόνο στη διάθεσή τους να αφομοιώσουν την ύλη για τις πανελλήνιες αποφεύγοντας το άγχος και το πανικό.
                Το φροντιστήριο διοργανώνει  τρεις κύκλους διαγωνισμάτων προγραμματισμένους από την αρχή της σχολικής χρονιάς και επιπλέον συμμετέχει στις εξετάσεις της Ο.Ε.Φ.Ε.(Ομοσπονδία εκπαιδευτικών φροντιστηρίων Ελλάδος), στις οποίες οι μαθητές μας διαγωνίζονται την ίδια μέρα στα ίδια θέματα με μαθητές πολλών φροντιστηρίων σε όλη την Ελλάδα. Η διαδικασία αυτή αποτελεί προσομοίωση πανελληνίων εξετάσεων.
                Σας περιμένουμε στο χώρο μας για μια προσωπική επικοινωνία.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/mathepilogi');




        /*=============== 6 Άξονας Ταύρος ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Άξονας Ταύρος', 'email' => 'info@axonas.fro.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'axonasTayros'])->id,
            'address' => 'Πειραιώς 200, Ταύρος',
            'city' => 'Αθήνα',
            'phone' => 2103463816,
            'type_id' => 3,
            'website' => 'axonas.fro.gr',
            'approved' => 1,
            'about' => '
               Στα Φροντιστήρια ΑΞΟΝΑΣ Σ.ΒΑΡΑΤΑΣΗΣ η εκπαιδευτική φιλοσοφία υλοποιείται μέσα από μια σειρά ολοκληρωμένων προγραμμάτων διδασκαλίας και διαγωνισμάτων, διαφορετικών για κάθε τύπο λυκείου και για κάθε τάξη, με συγκεκριμένα χρονοδιαγράμματα ύλης, ώστε να αξιοποιείται ο χρόνος του μαθητή και η εξεταστέα ύλη να ολοκληρώνεται έγκαιρα προσφέροντας επαρκή χρόνο εποικοδομητικών επαναλήψεων και κατανόησης.
               Από την έναρξη της λειτουργίας των Φροντιστηρίων ΑΞΟΝΑΣ Σ.ΒΑΡΑΤΑΣΗΣ στην Αθήνα στη περιοχή του Ταύρου ήδη από το 1991 στόχος μας είναι η υπεύθυνη υποστήριξη της μαθητικής προσπάθειας, η απερίσπαστη ολοκλήρωση των σχολικών σπουδών των μαθητών μας και η επιτυχής μετάβασή τους στη φοιτητική ζωή.
               Η εκπαιδευτική μεθοδολογία που εφαρμόζουμε, εξελίσσουμε και διαρκώς προσαρμόζουμε στα νέα εκπαιδευτικά δεδομένα στηρίζεται στους έμπειρους καθηγητές μας, στο προγραμματισμό και στη προσωπική στήριξη στο κάθε μαθητή μας. Εφαρμόζουμε ένα ευέλικτο και ιδιαίτερο σύστημα διδασκαλίας, ώστε να αναδείξουμε τις δυνατότητες του κάθε μαθητή μας και να εξασφαλίσουμε την πρόοδό του
            ',
            'background' => $background,
        ]);

        new Portal($fake,1, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');



        /*=============== 7 Μουράτος ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτικός Οργανισμός Μουράτος', 'email' => 'info@mouratos.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'mouratos'])->id,
            'address' => 'Ταξιαρχών 40, Κορυδαλλός',
            'city' => 'Αθήνα',
            'phone' => 2104941177,
            'type_id' => 3,
            'website' => 'mouratos.edu.gr',
            'approved' => 1,
            'about' => '
               Η φιλοσοφία του φροντιστηρίου μας συμπυκνώνεται στο τρίπτυχο:
               ποιότητα διδασκαλίας, οργάνωση,  μέθοδος.

               Ποιότητα διδασκαλίας:
               Καταρτισμένο εκπαιδευτικό προσωπικό που χαρακτηρίζεται τόσο για το υψηλό γνωστικό του επίπεδο όσο και για τη μακρά διδακτική του εμπειρία. Προσόντα που συνυφαίνονται με το ήθος και αληθινό ενδιαφέρον για την εξέλιξη του μαθητή.
               Βασική επιδίωξη αποτελεί η βελτιστοποίηση της επίδοσης των μαθητών μας ως αποτέλεσμα της μέγιστης δυνατής αξιοποίησης των δυνατοτήτων τους.
               Πλήρης σειρά σημειώσεων για κάθε μάθημα
               Βασική επιδίωξη αποτελεί η ολοκληρωμένη κάλυψη των εκπαιδευτικών αναγκών του μαθητή με τη συνδρομή του έντυπου εκπαιδευτικού υλικού.
               Ολιγομελή τμήματα με κριτήριο το επίπεδο των μαθητών, τις δυνατότητες και τους στόχους τους.

               Οργάνωση:
               Επίδοση σε γονείς και μαθητές με την έναρξη κάθε εκπαιδευτικού έτους του ετήσιού προγράμματος διαγωνισμάτων προσομοίωσης και εβδομαδιαίας ολιγόλεπτης εξέτασης, το οποίο αναρτάται και στον πίνακα ανακοινώσεων του φροντιστηρίου μας.
               Επίδοση σε γονείς και μαθητές με την έναρξη κάθε εκπαιδευτικού έτους του οργανογράμματος της διδακτέας ύλης.
               Ενημέρωση γονέων (τέσσερις προγραμματισμένες μέσα στη διάρκεια του εκπαιδευτικού έτους) και εφόσον κρίνεται αναγκαίο προσωπικά ραντεβού των διευθυντών σπουδών με γονείς τουλάχιστον μία φορά το μήνα με στόχο να πληροφορηθούν την πορεία των παιδιών τους.
               Έλεγχος της επίδοσης των μαθητών μέσα από την ατομική καρτέλα επίδοσης.
               Εφαρμογή τεχνικών μελέτης για την συστηματοποίηση και οργάνωση της διδακτέας ύλης στα πλαίσια της ψυχολογικής αντιμετώπισης των εξετάσεων.
               Μελέτη εντός του φροντιστηρίου σε περίπτωση που ο μαθητής παρουσιάζει απόκλιση από το επιθυμητό εκπαιδευτικό αποτέλεσμα.
               Ημερίδα σχολικού επαγγελματικού προσανατολισμού.
               Συνδρομή και συμβουλευτική υποστήριξη κατά τη διαδικασία συμπλήρωσης του μηχανογραφικού δελτίου του υποψηφίου.
               Ενεργό μέλος της Ο.Ε.Φ.Ε.

               Μέθοδος:
               Συχνές επαναλήψεις με ολιγόλεπτα εβδομαδιαία τέστ στην τάξη, ασκήσεις και ειδικοί κύκλοι γραπτής δοκιμασίας στη διάρκεια των διακοπών των Χριστουγέννων και του Πάσχα.
               Εξέταση των μαθητών με προσομοιωτικού χαρακτήρα διαγωνίσματα εφ΄όλης της ύλης και για τις τρεις τάξεις του Λυκείου.
               Προθερινή προετοιμασία της ύλης της επόμενης τάξης για τους μαθητές της Α΄ και Β΄ Λυκείου.
               Βασική επιδίωξη αποτελεί η έγκυρη και έγκαιρη αφομοίωση της ύλης.
               Βασική επιδίωξη αποτελεί η παρακολούθηση της εκπαιδευτικής πορείας κάθε μαθητή μας έγκυρα και αξιόπιστα ώστε με μια σειρά διορθωτικών κινήσεων όπως:
               επαναληπτικά θέματα, ενισχυτικά ή συμπληρωματικά μαθήματα και κριτήρια με ασκήσεις αξιολόγησης που επιλύονται εντός φροντιστηρίου να επιτευχθεί η μέγιστη δυνατή επίδοση και εμπέδωση της διδακτέας ύλης.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/'




     /*=============== 8 Άτομο ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Άτομο', 'email' => 'info@atomo-group.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'atomoGroup'])->id,
         'address' => 'Αγίου Ελευθερίου 5, Περιστέρι',
         'city' => 'Αθήνα',
         'phone' => 2105742900,
         'type_id' => 3,
         'website' => 'atomo-group.gr',
         'approved' => 1,
         'about' => '
           Γιατί ΑΤΟΜΟ;
           Γιατί η επιτυχία είναι αποτέλεσμα συνεργασίας
           Κάθε μαθητής αποτελεί για εμάς μια ξεχωριστή προσωπικότητα με διαφορετικά χαρακτηριστικά και στόχους. Ο ρόλος μας είναι να υποστηρίξουμε την προσπάθειά του, να ενδυναμώσουμε την αυτοπεποίθηση και τη δυνατότητα αυτενέργείας του, με χρήση συνεργατικών μεθόδων διδασκαλίας και αμφίδρομης επικοινωνίας εκπαιδευτικού – μαθητή.
           Τι σημαίνει η επιλογή ΑΤΟΜΟ;
           Αξιοποιώ την μέθοδο και το σύστημα εκπαίδευσης του «ΑΤΟΜΟΥ» έτσι ώστε να οργανώνω σωστά το διάβασμά μου, για να οδηγούμαι γρήγορα στο αντικείμενο της γνώσης και να το αποδίδω ορθά στις γραπτές δοκιμασίες.
           Αξιοποιώ τις εκπαιδευτικές δυνατότητες του «ΑΤΟΜΟΥ» στα πλαίσια της ατομικής στήριξης, δυνατότητα που μου δίνει μόνο ένα Πρότυπο Φροντιστήριο σαν το «ΑΤΟΜΟ».
           Αξιοποιώ τις υψηλού επιπέδου και επιστημονικά άρτιες εκδόσεις του «ΑΤΟΜΟΥ» για να εμβαθύνω και να εμπεδώσω πλήρως την εξεταστέα ύλη.
           Αξιοποιώ το συντονισμένο και έμπειρο εκπαιδευτικό προσωπικό του «ΑΤΟΜΟΥ» για να μετασχηματίσω την πληροφορία σε γνώση.
           Αξιοποιώ τις συνεχείς γραπτές εξετάσεις του «ΑΤΟΜΟΥ» προκειμένου να αποκτήσω εμπειρία και να μάθω να διαχειρίζομαι τις γνώσεις και το χρόνο μου σωστά, προκειμένου να τελειοποιηθώ στην αντιμετώπιση της τελικής γραπτής δοκιμασίας.
           Αξιοποιώ τη δυνατότητα άμεσης και ουσιαστικής επικοινωνίας και συνεργασίας των γονέων με τη Διεύθυνση και τους καθηγητές του φροντιστηρίου «ΑΤΟΜΟ», έτσι ώστε να αντιμετωπίζεται οποιοδήποτε πρόβλημα ή κάποια ιδιαίτερη ανάγκη που μπορεί να έχει παρουσιαστεί.
           Γιατί η επιλογή ΑΤΟΜΟ, είναι επιλογή ΕΠΙΤΥΧΙΑΣ
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/AtomoGroupFrontistirio');






     /*=============== 9 Πυξίδα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Πυξίδα', 'email' => 'pyxida201@hotmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'pyxida201'])->id,
         'address' => 'Λεωφόρος Ηρακλείου 201, Νέα Ιωνία',
         'city' => 'Αθήνα',
         'phone' => 2168002266,
         'type_id' => 3,
         'website' => 'pyxida201.gr',
         'approved' => 1,
         'about' => '
           «ΠΡΟΣΑΝΑΤΟΛΙΣΟΥ» ΜΑΖΙ ΜΑΣ ΣΤΗΝ ΕΠΙΤΥΧΙΑ, ΓΙΑΤΙ:
           Αξιοποιούμε μια πολυετή εμπειρία στο χώρο της εκπαίδευσης καλύπτοντας ολοκληρωμένα τις ανάγκες του μαθητή για εξειδίκευση στα μαθήματα του επιστημονικού πεδίου της επιλογής του.
           Ενισχύουμε σε όλα τα μαθήματα τις διδακτικές ώρες χωρίς πρόσθετη οικονομική επιβάρυνση. Στόχος είναι ο μαθητής να αποκτήσει πλεονέκτημα στα σημεία που οδηγούν στο «άριστα».
           Προσφέρουμε σε όλους τους μαθητές δωρεάν πρόσθετες διδακτικές ώρες και επιβραβεύουμε τους αριστούχους με ειδικές τιμές.
           Παρέχουμε μία πλήρη σειρά βιβλίων που υπερκαλύπτουν τις απαιτήσεις των γνωστικών αντικειμένων σε θεωρία και σε ασκήσεις.
           Επικεντρώνουμε την προσοχή μας στην οργάνωση της μελέτης και καταρτίζουμε πρόγραμμα διαβάσματος με κριτήριο τις ανάγκες κάθε μαθητή.
           Στοχεύουμε σε μια έγκαιρη και σε βάθος ολοκλήρωση της ύλης με γνώμονα την εμπέδωσή της από τους μαθητές αλλά και τη δυνατότητα πολλών επαναλήψεών της.
           Εφαρμόζουμε ένα πλήρες πρόγραμμα προσομοιωτικών διαγωνισμάτων, που εξοικειώνουν το μαθητή με τη διαδικασία των εξετάσεων, παρέχουν εμπειρία και ελέγχουν αντικειμενικά το βαθμό εμπέδωσης των γνώσεών του.
           Δίνουμε στους μαθητές μας τη δυνατότητα πρόσβασης στο αυτοματοποιημένο σύστημα επαγγελματικού προσανατολισμού «Ariston Candidates».
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');



     /*=============== 10 Άνοδος Μεταμόρφωση ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Άνοδος Μεταμόρφωση', 'email' => 'anodos_edu@yahoo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'anodos_edu'])->id,
         'address' => 'Γκινοσάτη 88, Μεταμόρφωση',
         'city' => 'Αθήνα',
         'phone' => 2102836800,
         'type_id' => 3,
         'website' => 'anodosedu.gr',
         'approved' => 1,
         'about' => '
           Α\' Τάξη ΝΕΟΥ Λυκείου
           Κατά τη χειμερινή περίοδο, που αρχίζει μέσα στο 1ο δεκαήμερο του Σεπτεμβρίου στο Φροντιστήριό μας ξεκινούν τη λειτουρία τους για τους μαθητές της Α\' Λυκείου ειδικά ολιγομελή τμήματα, με πρόγραμμα εναρμονισμένο πλήρως στις απαιτήσεις του ΝΕΟΥ ΛΥΚΕΙΟΥ.
           Το πρόγραμμα σπουδών της ¨ΑΝΟΔΟΥ¨ ανταποκρίνεται σε δύο βασικούς στόχους:
           Την εξοικείωση των μαθητών στις νέες μεθόδους αξιολόγησης, που επιτυγχάνεται με πολλά ωριαία τεστ, ΔΙΑΔΙΚΤΥΑΚΑ διαγωνίσματα καθώς και με 3ωρα διαγωνίσματα προσομοίωσης.
           Τη δημιουργία της απαραίτητης υποδομής γνώσεων στα μαθήματα:
           ΘΕΤΙΚΩΝ ΕΠΙΣΤΗΜΩΝ (Μαθηματικά, Φυσική, Χημεία)
           ΘΕΩΡΗΤΙΚΩΝ (ΑΝΘΡΩΠΙΣΤΙΚΩΝ) ΕΠΙΣΤΗΜΩΝ (Αρχαία, Νέα, Λογοτεχνία).
           Με τη σωστή προετοιμασία στην ¨ΑΝΟΔΟ¨, οι μαθητές μας θα είναι σε θέση:
           Να επιτυγχάνουν στο σχολείο άριστες επιδόσεις,
           να έχουν αφομοιώσει την ύλη των βασικών μαθημάτων εκείνων, στα οποία θα διαγωνιστούν γραπτώς στο τέλος της χρονιάς και
           να αποκτήσουν όλα τα απαραίτητα εφόδια και την υποδομή για την ομάδα ΘΕΤΙΚΩΝ ή ΑΝΘΡΩΠΙΣΤΙΚΩΝ σπουδών που θα κληθούν να ακολουθήσουν στη Β΄ Λυκείου.

           Β\' Τάξη NEOY λυκείου
           Οι μαθητές της Β΄ Λυκείου επιλέγουν υποχρεωτικά είτε τον κύκλο των ΘΕΤΙΚΩΝ ΣΠΟΥΔΩΝ είτε τον κύκλο των ΑΝΘΡΩΠΙΣΤΙΚΩΝ ΣΠΟΥΔΩΝ και διδάσκονται μαθήματα γενικής παιδείας και προσανατολισμού. Στο τέλος της χρονιάς οι μαθητές καλούνται να διαγωνιστούν γραπτώς σε όλη την ύλη των μαθημάτων, με την τράπεζα θεμάτων να είναι προαιρετική.
           Εμείς στην ¨ΑΝΟΔΟ¨, προβλέποντες τις καινοτομίες του νέου συστήματος εντάξαμε τα προγράμματα σπουδών μας σε διετή κύκλο σπουδών και προετοιμασίας, ο οποίος ξεκινά από αρχές Σεπτεμβρίου με τη διδασκαλία της βασικής ύλης των μαθημάτων της Β΄ Λυκείου, συνεχίζεται με τη σταδιακή διδασκαλία και αφομοίωση της ύλης βασικών μαθημάτων της Γ΄ Λυκείου και κορυφώνεται στο τέλος της χρονιάς με τη διεξαγωγή των γραπτών σχολικών Εξετάσεων.

           Γ\' Τάξη ΝΕΟΥ λυκείου
           Στην "ΑΝΟΔΟ", αξιοποιώντας την πολύχρονη εμπειρία μας και με πλήρη συναίσθηση της ευθύνης, έχουμε ετοιμάσει το πλέον κατάλληλο πρόγραμμα ώστε ο μαθητής της Γ\' Λυκείου να εκπληρώσει τους στόχους του.

            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/ANODOSfrontistirio');





     /*=============== 11 Ροπή Νέα Φιλαδέλφεια ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Ροπή Νέα Φιλαδέλφεια', 'email' => 'ropifront@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ropifront'])->id,
         'address' => 'Νικολάου Τρυπιά 52, Νέα Φιλαδέλφεια',
         'city' => 'Αθήνα',
         'phone' => 2102521769,
         'type_id' => 3,
         'website' => 'ropi.com.gr',
         'approved' => 1,
         'about' => '
             Πολύ απλά αυτά που σας προσφέρουμε τα λένε όλα :
             Σωστή, έγκαιρη και υπεύθυνη προετοιμασία που εγγυάται η πολύχρονη πείρα μας και η εξειδίκευση που αποκτήσαμε στο επάγγελμα του Φροντιστή που για μας είναι μόνιμο και όχι περιστασιακό.
             Απόκτηση αυτοπεποίθησης και σιγουριάς που μόνο η ουσιαστική γνώση μπορεί να προσφέρει.
             Ένα άριστο επιτελείο εξειδικευμένων καθηγητών για τη διδασκαλία των Μαθηματικών, της Φυσικής, της Χημείας, της Βιολογίας, των Οικονομικών, της Ιστορίας, των Αρχαίων, της Έκθεσης και των Λατινικών που έχουν καταξιωθεί στο Φροντιστηριακό Χώρο.
             Ειδικές εκδόσεις, βοηθημάτων θεωρίας και ασκήσεων που διανέμονται ΔΩΡΕΑΝ στους μαθητές μας.
             Εκπαιδευτικά προγράμματα και τμήματα, που ανταποκρίνονται στις δυνατότητες κάθε μαθητή.
             Συμπληρωματικές ώρες, εκτός προγράμματος, για την ενίσχυση της διδασκαλίας και για διαγωνίσματα.
             Προγραμματισμός ύλης, ώστε μέχρι την έναρξη των εξετάσεων να έχουν γίνει πολλές επαναλήψεις και διαγωνίσματα.
             Θερινό εντατικό πρόγραμμα σπουδών, στο οποίο ολοκληρώνουμε σημαντικό μέρος  της ύλης, προσφέροντας σημαντικά πλεονεκτήματα στον μαθητή.
             Ενημέρωση γονέων για τη πρόοδο και για τις τυχόν απουσίες των μαθητών μας.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Φροντιστηριο-ΜΕ-ΡΟΠΗ-627343867297836');





     /*=============== 12 Κύβος ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Κύβος', 'email' => 'kybosedu@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'kybosedu'])->id,
         'address' => 'Λεωφόρος Δημοκρατίας 46 , Ηλιούπολη',
         'city' => 'Αθήνα',
         'phone' => 2109704591,
         'type_id' => 3,
         'website' => 'kybos.edu.gr',
         'approved' => 1,
         'about' => '

         Καλώς Ήρθατε στον Κύβο
         Το φροντιστήριο Κύβος είναι το αποτέλεσμα της μακροχρόνιας φροντιστηριακής εμπειρίας μας, καθώς και της φιλοδοξίας μας για την ουσιαστικότερη προσφορά στο μαθητή.
         Ικανοποιεί στο μέγιστο την ανάγκη για μια ολοκληρωμένη φροντιστηριακή παιδεία και έχει καταξιωθεί στο χώρο της εκπαίδευσης για την υψηλή ποιότητα του παρεχόμενου έργου του. Το έργο αυτο επικεντρώνεται σε τρεις βασικές συνιστώσες της εκπαίδευσης: διδάσκοντες, περιεχόμενο σπουδών καιυλικοτεχνική υποδομή.
         Ιδιαίτερη προσοχή δίδεται στην επιλογή των καθηγητών μας που διαθέτουν άρτια παιδαγωγική και επιστημονική κατάρτιση ενώ κατέχουν καλα τη διδακτική τέχνη, που προϋποθέτει αγάπη για το μαθητή, γνώση των ιδιαιτεροτήτων που έχει και σεβασμό της προσωπικότητας του.Ειναι ακούραστοι, αφοσιωμένοι στο διδακτικό τους έργο, καθοδηγούν το μαθητή και του μεταδίδουν με αποτελεσματικότητα τη γνώση και την ανταγωνιστικότητα που χρειάζεται για να πετύχει.
         Τα τμηματά μας συγκροτούνται με τρόπο τέτοιο ώστε να διασφαλίζεται η ομοιογένεια , ενω διαρκώς παρακολουθείται η επίδοση και η παρουσία του μαθητή στο φροντιστήριο.
         Η έγκαιρη ολοκλήρωση την ύλης δίνει τη δυνατότητα πολλών επαναλήψεων και γίνονται επιπλέον δωρεάν ώρες μαθημάτων για την αντιμετώπιση των αναγκών κάθε μαθητή ξεχωριστά.
         Οι μαθητές πέρα από την προφορική εξέταση συμμετέχουν υποχρεωτικά σε γραπτά τεστ και σε διαγωνίσματα που δίνουν τη δυνατότητα εμπέδωσης της ύλης.
         Στους σύγχρονους και άνετους χώρους εχουν ενσωματωθεί νέες τεχνολογίες, δίνοντας έτσι στον έμπειρο καθηγητή περισσότερες δυνατότητες οργάνωσης και παρουσίασης του μαθήματός του.
         Φίλε μαθητή στο φροντιστήριό μας σε περιμένει πολύ δουλειά που θα την κάνουμε μαζί. Μια δουλειά που θα σε κάνουμε να αγαπήσεις και να εργαστείς σε αυτή με συνέπεια, κατανόηση και μεθοδικότητα.Μια δουλειά που θα σου δώσει ολα τα εφόδια να προοδεύσεις και να πετύχεις τους στόχους σου

          Διδασκαλία
          Στόχος μας είναι να βοηθήσουμε τους μαθητές μας να κατανοήσουν, να αφομοιώσουν και να διαχειρίζονται το γνωστικό υλικό.
          Το εξειδικευμένο διδακτικό προσωπικό μας, με γνώσεις, συγγραφική εργασία, διδακτική πείρα και παιδαγωγική ευαισθησία, εργάζεται μεθοδικά και βρίσκεται πάντα κοντά στα παιδιά.
          Η διδασκαλία γίνεται σε ολιγομελή τμήματα, τόσο σε αίθουσες με θρανία όσο και σε αίθουσα με συνεδριακό γραφείο και προβολικό σύστημα. Επιπλέον, παρέχεται στους μαθητές ενισχυτική διδασκαλία, ανάλογα με τις ιδιαίτερες ανάγκες του κάθε παιδιού. Τέλος, με στοχευμένο πρόγραμμα σπουδών και χρονοδιάγραμμα απομένει πάντα ο απαιτούμενος -για κάθε τάξη- χρόνος για επαναλήψεις πριν από τις εξετάσεις.

         Μελέτη
         Καθώς η σωστή και τακτική μελέτη αποτελεί τη σημαντικότερη προϋπόθεση για την επιτυχία και την πρόοδο των μαθητών, στον «ΚΥΒΟ» μεριμνούμε για την καλύτερη οργάνωση και τον αποδοτικότερο τρόπο διαβάσματός τους. Οι μαθητές μας μαθαίνουν:
         πώς να διαχειρίζονται τη διδαχθείσα ύλη,
         πώς πρέπει να διαβάζουν
         να διαχειρίζονται σωστά τον χρόνο τους
         να μην αφήνουν εκκρεμότητες
         να θέτουν προτεραιότητες
         να αξιολογούν την καθημερινή τους προσπάθεια.
         Ακόμα, όταν οι καθηγητές το κρίνουν απαραίτητο, η μελέτη πραγματοποιείται στον χώρο του φροντιστηρίου, με προσωπική επιτήρηση και καθοδήγησή τους.
         Αναγνωρίζοντας τον σημαντικό ρόλο και συμμεριζόμενοι την αγωνία σας, φροντίζουμε να βρισκόμαστε σε τακτική επικοινωνία μαζί σας. Έτσι:

         Ενημέρωση γονέα
         Πραγματοποιούμε δύο φορές τον χρόνο τακτική ενημέρωση αλλά και άλλες προγραμματισμένες προσωπικές συναντήσεις, όπου ειδοποιείστε για την απόδοση των παιδιών σας και συντονίζουμε από κοινού ενέργειες για τη βελτίωσή τους και την κάλυψη των μαθησιακών αναγκών τους.
         Οι καθηγητές του φροντιστηρίου μας βρίσκονται στη διάθεσή σας κάθε στιγμή που εσείς κρίνετε αναγκαία και μπορείτε να επικοινωνήσετε μαζί τους είτε τηλεφωνικά είτε στον χώρο του φροντιστηρίου.
         Ειδοποιείστε ΑΜΕΣΑ για τυχόν απουσίες των παιδιών σας και παραλήψεις στις υποχρεώσεις τους.
         Προσφέρουμε συμβουλευτική μαθητών και γονέων, όπου παρέχουμε αναλυτικές πληροφορίες όσον αφορά τη δομή του εκπαιδευτικού συστήματος και αποσαφηνίζουμε έννοιες όπως «Επιστημονικά Πεδία», «Βαθμός πρόσβασης», «Συντελεστής Βαρύτητας», «Υπολογισμός Μορίων»
         Φροντίζουμε για την καλύτερη καθοδήγηση και τον Επαγγελματικό Προσανατολισμό των μαθητών μας, παρουσιάζοντάς τους το σύνολο των σχολών ανά Επιστημονικό Πεδίο, το πρόγραμμα σπουδών και τις επαγγελματικές προοπτικές τους.
         Και βέβαια βρισκόμαστε δίπλα στους μαθητές μας στη συμπλήρωση των μηχανογραφικών τους δελτίων, για την αποφυγή τυχόν λαθών και παραλήψεων.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/kybosedu');


     /*=============== 13 Έρευνα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Έρευνα', 'email' => 'ereuna.frontistiria@yahoo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ereuna'])->id,
         'address' => 'Τριών Ιεραρχών 29, Άνω Πετράλωνα',
         'city' => 'Αθήνα',
         'phone' => 2103422058,
         'type_id' => 3,
         'website' => 'ereuna.com.gr',
         'approved' => 1,
         'about' => '
           ΙΣΤΟΡΙΑ
           Λειτουργούμε απο το 1979
           Το φροντιστήριο Έρευνα ιδρύθηκε το 1979 στα Πετράλωνα. Απο τότε λειτουργεί χωρίς διακοπή έως και σήμερα στην ίδια περιοχή παρέχοντας υπηρεσίες υψηλού επιπέδου.

           ΦΙΛΟΣΟΦΙΑ
           Θα δεις αποτέλεσμα
           Στο Φροντιστήριο ΕΡΕΥΝΑ θα δεις σταθερή βελτίωση των επιδόσεών σου καθημερινά. Θα δεις αποτέλεσμα.
           Γιατί εδώ εφαρμόζουμε ένα αποτελεσματικό, καινοτόμο σύστημα εκπαιδευτικής διαδικασίας: το διαδραστικό μάθημα, τα φύλλα σημειώσεων, η προσομοίωση εξετάσεων, η ενισχυτική διδασκαλία, η παρακολούθηση της εκπαιδευτικής πορείας των μαθητών και η συμβουλευτική των καθηγητών αποτελούν το δυναμικό σύστημα επιτυχίας, με τον κάθε μαθητή μας στο επίκεντρο.

           ΜΕΘΟΔΟΛΟΓΙΑ
           Βιβλία, φύλλα σημειώσεων και διαγωνίσματα προσομοίωσης.
           Τα βιβλία που εκδίδει το φροντιστήριο είναι απολύτως ενημερωμένα, λειτουργικά, καλύπτουν όλες τις τάξεις και συμπληρώνουν το μάθημα με ουσιαστικό τρόπο.
           Ο προγραμματισμός της ύλης γίνεται σε απόλυτη εναρμόνιση με τις απαιτήσεις του Υπουργείου Παιδείας. Στη διάρκεια του ακαδημαϊκού έτους πραγμοτοποιούντε πολυάριθμα διαγωνίσματα προσομοίωσης σε κάθε τάξη. Με τον τρόπο αυτό, εξοικειώνεσαι με την εξεταστική φιλοσοφία των Πανελλαδικών Εξετάσεων.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 11, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/profile.php?id=100025044617801');





     /*=============== 14 Νόημα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Νόημα', 'email' => 'info@noima.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'noima'])->id,
         'address' => 'Τρώων 6, Περιστέρι',
         'city' => 'Αθήνα',
         'phone' => 2105782233,
         'type_id' => 3,
         'website' => 'noima.edu.gr',
         'approved' => 1,
         'about' => '
        Το νόημα της.. Γνώσης...
        Βρίσκεται στην πολύπλευρη και πλήρη κατάρτιση του μαθητή στο γνωστικό αντικείμενο που φιλοδοξεί να κατακτήσει, σε συνδυασμό με υψηλο ηθικό και ψυχολογία νικητή. Με συστηματική προσπάθεια και ισορροπημένη ανθρώπινη προσέγγιση, κάθε μαθητής μπορεί να αποδώσει τα μέγιστα των δυνατοτήτων του και ταυτόχρονα να αισθάνεται ικανοποιημένος, πλήρης και να διαθέτει άριστη ψυχολογική κατάσταση.

        το νόημα... της Ομάδας…
        Καλλιεργείται καθημερινά και με ιδιαίτερη επιμέλεια από τους καθηγητές του φροντιστηρίου ΝΟΗΜΑ. Στα σημερινά δεδομένα του άκρατου εγωϊσμού και ανταγωνισμού, το ανθρώπινο δυναμικό μας αντιπαραθέτει το πνεύμα της ομαδικότητας και της συλλογικής προσπάθειας. Στα πλαίσια αυτής της φιλοσοφίας, η συνεργασία καθηγητή-γονέα-μαθητή εξελίσσεται σε αποτελεσματικό εργαλείο στήριξης του μαθητή και ουσιαστικό «κλειδί» για την επίλυση προβλημάτων που ανακύπτουν κατά τη διάρκεια της εκπαιδευτικής διαδικασίας.

        το νόημα... του Επαγγελματικού προσανατολισμού...
        Παρά τη μεγάλη σημασία για το μέλλον των παιδιών, είναι τις περισσότερες φορές παραμελημένο και ίσως παρεξηγημένο από γονείς και μαθητές. Εμείς, στοχεύουμε αυτή η κρίσιμη επιλογή να γίνεται αφού τα παιδιά διεισδύσουν στα επιμέρους γνωστικά αντικείμενα των επιστημών και αναλύσουν τις πτυχές εκείνες που δείχνουν το πραγματικό βάθος αλλά και τη σχέση τους με τη ζωή. Τότε, πιστεύουμε ότι θα ανακαλύψουν την κλίση τους προς ορισμένη επιστήμη και σε συνδυασμό με την πλήρη ενημέρωση σχετικά με τις σύγχρονες εξελίξεις σε επίπεδο σπουδών και επαγγελμάτων, θα χαράξουν μαζί με τους γονείς την πορεία που τους ταιριάζει.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistirionoima');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/noima_front');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/user/noimafme');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/Noima_front');


     /*=============== 15 Πύλη ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Πύλη', 'email' => 'info@piliedu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'piliedu'])->id,
         'address' => 'Λεωφ. Αγίας Βαρβάρας 102, Π.Φάληρο',
         'city' => 'Αθήνα',
         'phone' => 2109880101,
         'type_id' => 3,
         'website' => 'piliedu.gr',
         'approved' => 1,
         'about' => '
          Το σύστημα μας
          Η ΕΙΛΙΚΡΙΝΕΙΑ…

          Το φροντιστήριο μας έχει ως αρχή να μη καλλιεργεί πλασματική εικόνα στο μαθητή και την οικογένεια του για την ένταση της απαιτούμενης προσπάθειας και την μαθησιακή πορεία του.

          ΜΙΚΡΕΣ ΟΜΑΔΕΣ - ΕΜΦΑΣΗ ΣΤΟΝ ΜΑΘΗΤΗ
          Στο φροντιστήριο μας οι εκπαιδευτικές μονάδες, οι τάξεις των μαθημάτων, αποτελούνται από 5 άτομα κατά Μ.Ο. Οι 5ελείς ομάδες έχουν μια εκπληκτική δυναμική γιατί επιτρέπουν την ανάπτυξη ενός ομοιογενούς επιπέδου, το οποίο περιλαμβάνει δυο λιγότερους δυνατούς μαθητές, με τρεις περισσότερο δυνατούς, δηλαδή μια χημεία που επιτρέπει να ανεβαίνει σταδιακά ο ρυθμός μαθήματος. Κάθε ομάδα βρίσκεται υπό την εντατική εποπτεία ενός επιστημονικού επιτελείου καθηγητών.
          ΚΑΘΕ ΜΑΘΗΤΗΣ αποτελεί ξεχωριστή περίπτωση

          ΟΡΓΑΝΩΣΗ ΣΠΟΥΔΩΝ..
          Το φροντιστήριο μας οργανώνει τις σπουδές σε τέσσερα επίπεδα, προκειμένου να αποφύγει το σκόπελο στον οποίο οδηγεί το σχολειοκεντρικό σύστημα και τον οποίο δυστυχώς δεν αποφεύγουν πολλά από τα παιδιά που επιλέγουν τα μαθήματα στο σπίτι.

          1ο επίπεδο
          Υψηλό επίπεδο διδασκαλίας και μέθοδο οργάνωσης μελέτης στα μαθήματα όπου ο μαθητής χρειάζεται εβδομαδιαία στήριξη, χωρίς όμως να επιβαρύνεται με ένα υπερβολικό αριθμό ωρών ανά μάθημα.

          2ο επίπεδο
          Λειτουργούν οι Επαναληπτικοί Κύκλοι που σκοπό έχουν να βοηθήσουν τους μαθητές μας να διαχειριστούν mu;ε τον καλύτερο δυνατό τρόπο το περιεχόμενο των συγκεκριμένων μαθημάτων σε μια μεγαλύτερη ενότητα.

          3ο επίπεδο
          Προετοιμάζει επαρκέστατα τον μαθητή για τα Πανελλαδικά εξεταζόμενα μαθήματα μέσα από συνεχείς γραπτές δοκιμασίες: ολιγόλεπτα διαγωνίσματα στην τάξη, , τρίωρα επαναληπτικά διαγωνίσματα σε ευρύτερες ενότητες ύλης, εργασίες στο σπίτι.

          4ο επίπεδο
          Ενεργοποιεί το παιδί σε μια ομάδα που δεν είναι αδρανής, αλλά στοχεύει στη συνεχή αναβάθμιση του συνόλου. Ταυτόχρονα αποτρέπει την μονομέρεια ενός ιδιαίτερου, που αν στηριχθεί στο κυνήγι του δασκάλου του σχολείου, είναι πιθανόν, λόγω του ότι ο δάσκαλος του σχολείου θα κρατήσει όλη τη χρονιά τον «πήχη» χαμηλά, να οδηγήσει το παιδί κάτω από τον ψηλό «πήχη» των τελικών γραπτών εξετάσεων.
          Ενισχυτική διδασκαλία κατόπιν πρότασης του καθηγητή του τμήματος στην Ακαδημαϊκή Διεύθυνση πραγματοποιείται πάντα εκτός του ωρολογίου προγράμματος και σε επίπεδο ολόκληρου του τμήματος γίνεται δωρεάν.
          Ατομικά μαθήματα που επιθυμεί κάποιος σπουδαστής με τον καθηγητή του τμήματος μπορούν να πραγματοποιούνται κατόπιν συμφωνίας με τον Διευθυντή της Σχολής. Το κόστος καλύπτεται από τον σπουδαστή.


          ΣΗΜΕΙΩΣΕΙΣ - ΒΙΒΛΙΑ
          Βιβλία ειδικής προετοιμασίας εκδόσεων ΠΥΛΗ και extra υποστηρικτικό υλικό (μέσω της ιστοσελίδας μας) περαλαμβάνονται από τους μαθητές στο πρώτο δεκαήμερο της εγγραφής του και ανανεώνονται στην διάρκεια της σχολικής χρονιάς.

          ΕΠΑΓΓΕΛΜΑΤΙΚΟΣ ΠΡΟΣΑΝΑΤΟΛΙΣΜΟΣ
          Ημερίδες Επαγγελματικού Προσανατολισμού βοηθούν τους σπουδαστές να επιλέξουν την κατεύθυνση και τις σχολές που τους ταιριάζουν αφού προηγηθεί συζήτηση με τον Διευθυντή της Σχολής.

          ΑΞΙΟΛΟΓΗΣΗ
          Καρτέλες τμήματος και σπουδαστή ΓΙΑ ΚΑΘΕ ΩΡΑ ΜΑΘΗΜΑΤΟΣ αποτυπώνουν την επίδοση του σπουδαστή. Άρα υπάρχει διαθέσιμη ; συνεχώς η εικόνα της απόδοσης του σπουδαστή ανά ημέρα προσέλευσης του στον χώρο του φροντιστηρίου.
          Όλα τα τεστ-διαγωνίσματα των μαθητών μας διατηρούνται σε αρχείο ώστε να είναι διαθέσιμα στους ίδιους και στους γονείς καθώς και για την στατιτστική αξιολόγηση της προόδου.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/piliedu');




     /*=============== 16 Διάμεσος Κορυδαλλός ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Διάμεσος Κορυδαλλός', 'email' => 'info@diamesos.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'diamesos'])->id,
         'address' => 'Σπετσών 46, Κορυδαλλός',
         'city' => 'Αθήνα',
         'phone' => 2104945323,
         'type_id' => 3,
         'website' => 'diamesos.edu.gr',
         'approved' => 1,
         'about' => '
           Τα φροντιστήρια ΔΙΑΜΕΣΟΣ ξεκίνησαν από μία ομάδα πεπειραμένων καθηγητών και πλήρως καταρτισμένων, με προσωπική δουλειά στον χώρο των επιστημών και των γραμμάτων καταξιωμένη και αναγνωρισμένη. Ορμώμενοι από την αγάπη και τον ζήλο τους για την προώθηση της έρευνας και μελέτης στο δικό τους επιστητό πεδίο, π.χ. θετικές και ανθρωπιστικές σπουδές, ασχολούνται με την εκπαίδευση είτε σε δευτεροβάθμιο είτε σε τριτοβάθμιο επίπεδο. Η ενασχόληση με τις σπουδές της παιδείας, π.χ. με τις Μαθηματικές και Φυσικές επιστήμες ή με την ελληνική Γλώσσα και Ιστορία, έχει γίνει από την ομάδα μας με μοναδικό κριτήριο την προώθηση των γνώσεων σε τέτοιο σημείο, ώστε η επιστήμη καθενός καθηγητού μας να ορίζει την ταυτότητα και ιδιοσυγκρασία του.
           Οι πυλώνες του φροντιστηρίου μας είναι αφενός η ερευνητική δουλειά σε πανελλαδικό επίπεδο, αφετέρου αυτή η αγάπη και ο ζήλος για κάθε επιστητό πεδίο να μεταδοθεί στους μαθητές μας. Οι μαθητές μπορούν να εξελιχθούν και ανελιχθούν στα στάδια της εκπαίδευσης, αν ολοκληρώσουν την μάθηση και γνώσεις που απαιτούνται σε κάθε βαθμίδα. Αυτό, όμως, θα γίνει μόνο αν ενστερνιστούν την ίδια με τους καθηγητές αγάπη για κάθε πτυχή των σπουδών τους. Αυτός είναι πάντα ο στόχος και επιδίωξή μας.
           Οι καθηγητές μας έχουν καταξιωθεί πανελλαδικά με πληθώρα εκδόσεων σε διάφορους εκδοτικούς οίκους σε τέτοιο σημείο, ώστε να αποτελούν πρότυπο και οδηγός για τους εκπαιδευτικούς. Το όνομα των φροντιστηρίων μας είναι ένα σημαινόμενο που χρησιμοποιείται στις μαθηματικές και φυσικές επιστήμες, ωστόσο είναι ένας φιλοσοφικός όρος αντλημένος από τον Πλάτωνα. Κατά τον Σωκράτη, στην Πολιτεία του Πλάτωνος (508Α-509Β), όπως το φως είναι ένα ΔΙΑΜΕΣΟ μεταξύ ήλιου και όρασης, έτσι και η αλήθεια είναι ένα ΔΙΑΜΕΣΟ στο νοητό κόσμο μεταξύ Αγαθού (υπέρτατης νοητής Ιδέας) και νόησης. Με μία αντίστοιχη αναλογία και εμείς γινόμαστε το ΔΙΑΜΕΣΟ μεταξύ μαθητών και επιτυχίας, πράγμα που το έχουμε αποδείξει επί σειρά ετών.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Διάμεσος-644421898972773/');





     /*=============== 17 Επίκουρος ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Επίκουρος', 'email' => 'epikouros85@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'epikouros85'])->id,
         'address' => 'Κατεχάκη 54, Νέο Ψυχικό',
         'city' => 'Αθήνα',
         'phone' => 2106928392,
         'type_id' => 3,
         'website' => 'epikouros-frontistirio.gr',
         'approved' => 1,
         'about' => '
            Ξεκινώντας πριν από 30 και πλέον χρόνια αυτό το ταξίδι στην Εκπαίδευση, στην «παράλληλη» εκπαίδευση, όπως λένε, η φιλοδοξία μου και ο στόχος μου ήταν και παραμένει ο ίδιος, το Φροντιστήριο ΕΠΙΚΟΥΡΟΣ, στο Νέο Ψυχικό, να είναι εκείνο το σκαλί που ανεβαίνοντας το, να ανακαλύψουν οι μαθητές μου ότι μεγάλωσε ο Ορίζοντας τους, ότι μεγάλωσε ο Κόσμος τους και ότι ο Κόσμος αυτός είναι δικός τους.
            Δικός τους, με την έννοια ότι είναι έτοιμοι να τον κατακτήσουν. Σε αυτή μου την προσπάθεια ποτέ δεν λύγισα, ποτέ δεν είπα ότι κουράστηκα, ποτέ δεν κατέθεσα τα όπλα ακόμα και στις δύσκολες περιπτώσεις. Έτσι όλοι οι μαθητές του ΕΠΙΚΟΥΡΟΥ, γνωρίζουν ότι μόχθησα μαζί τους, ήμουν πάντα στο πλευρό τους, σύμμαχος και συμπαραστάτης, δίκαιος κριτής της προσπάθειας τους, με τα μπράβο και τις παρατηρήσεις χωρίς να χαρίζομαι σε κανένα.
            Όλα αυτά τα χρόνια, αυτά γίνονταν και γίνονται στον ΕΠΙΚΟΥΡΟ και όπως γνωρίζετε - ρωτήστε για μας - με θαυμαστά αποτελέσματα, που με κάνουν περήφανο αφού πολλοί από τους μαθητές μου βρίσκονται στις κορυφές των επιστημών με τις οποίες ασχολήθηκαν.
            Βέβαια σε αυτή τη προσπάθεια πάντα είχα συμπαραστάτες τους καλύτερους συναδέλφους μου, έμπειρους καθηγητές του Φροντιστηρίου. Όλοι μαζί σαν μια ομάδα, σαν μια οικογένεια δουλεύουμε, όλοι μαζί νοιαζόμαστε για την πραγμάτωση των φιλοδοξιών και την επίτευξη των στόχων του κάθε μαθητή χωριστά, με επιστημονική γνώση, εμπειρία, συνέπεια, εμπιστοσύνη, αγάπη και σεβασμό.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 8, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/NZApostolakis');




     /*=============== 18 Αρειμάνιο Καλλιθέα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Αρειμάνιο Καλλιθέα', 'email' => 'kallithea@areimanio.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'areimanioKallithea'])->id,
         'address' => 'Ελ. Βενιζέλου 171, Καλλιθέα',
         'city' => 'Αθήνα',
         'phone' => 2109595960,
         'type_id' => 3,
         'website' => 'areimanio.gr',
         'approved' => 1,
         'about' => '
            Η ΠΡΟΣΩΠΙΚΟΤΗΤΑ ΤΟΥ ΜΑΘΗΤΗ, ΣΤΟ ΕΠΙΚΕΝΤΡΟ ΤΗΣ ΔΙΔΑΣΚΑΛΙΑΣ

            Μαθητής Αρειμάνιο
            Οι περισσότεροι πιστεύουν ότι για να γράψει καλά ένα παιδί, αρκεί μόνο να διαβάσει. Στο Αρειμάνιο γνωρίζουμε ότι δε φτάνει μόνο αυτό. Γι’ αυτό και η φιλοσοφία μας είναι διαφορετική. Στο Αρειμάνιο πιστεύουμε ότι όλα στηρίζονται στην προσωπικότητα του κάθε μαθητή και στην ενίσχυση της προσωπικότητας αυτής.
            Εδώ, δεν είναι ο καθηγητής το επίκεντρο της διδασκαλίας, αλλά ο μαθητής και όλοι μας βρισκόμαστε κοντά του σε κάθε προσπάθεια. Γι’ αυτό το λόγο άλλωστε οι καθηγητές μας είναι νέοι, έμπειροι, πλήρως καταρτισμένοι, με πολλά χρόνια διδακτικής εμπειρίας στο Αρειμάνιο και με διάθεση να είναι δίπλα στο μαθητή και στα ενδιαφέροντά του.
            Δεν θέλουμε τον καθηγητή έναν πομπό ψυχρής γνώσης, αλλά τον θέλουμε να λειτουργεί ως δάσκαλος και καθοδηγητής σε θέματα εκπαίδευσης, αλλά και σε θέματα που αφορούν το μαθητή προσωπικά.
            Ακολουθώντας αυτή τη φιλοσοφία -συνταγή της επιτυχίας- καταφέρνουμε να ενισχύουμε συνεχώς τα θετικά της προσωπικότητας των μαθητών μας. Και όσο πιο πολύ τα ενισχύουμε αυτά, τόσο πιο κοντά τους οδηγούμε στην επιτυχία!

            Η ΑΡΧΗ ΕΝΟΣ ΕΚΠΑΙΔΕΥΤΙΚΟΥ ΟΡΑΜΑΤΟΣ
            Τα εκπαιδευτήρια Αρειμάνιο γεννήθηκαν ως αποτέλεσμα της αγάπης δύο εκπαιδευτικών, της φιλολόγου Μωραΐτου Ελευθερίας και του μαθηματικού Τζόγια Θεόδωρου, για τους μαθητές και τη διαδικασία της μάθησης.
            Με οδηγό τη θέλησή τους να μεταλαμπαδεύσουν τη γνώση στα νέα παιδιά και να τα βοηθήσουν στην κατάκτηση των ονείρων τους, δημιούργησαν το πρώτο και κεντρικό εκπαιδευτήριο στον Πειραιά.
            Στόχος τους, ήταν να εισάγουν μια διαφορετική οπτική στα μέχρι τότε δεδομένα της εποχής, που θα βοηθούσε τους μαθητές να γίνουν γρήγορα, αλλά και ευχάριστα, πιο παραγωγικοί!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/areimanio');
       Scholio::portalSocial($fake, 'youtube',  'https://www.youtube.com/user/areimaniogr');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/company/areimanio/');



     /*=============== 19 Επιτυχείν ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Επιτυχείν', 'email' => 'info@epityxein.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'epityxein'])->id,
         'address' => 'Σκρα 7, Ηλιούπολη',
         'city' => 'Αθήνα',
         'phone' => 2109734736,
         'type_id' => 3,
         'website' => 'epityxein.gr',
         'approved' => 1,
         'about' => '
            Η ΦΙΛΟΣΟΦΙΑ ΜΑΣ
            Ο προσανατολισμός του εκπαιδευτικού μας συστήματος στις πανελλήνιες εξετάσεις της γ’ λυκείου καθώς και ο  εξεταστικοκεντρικός χαρακτήρας της εκπαίδευσης έχουν κάνει απαραίτητη την ουσιαστική και μεθοδική προετοιμασία των μαθητών σε όλες τις τάξεις τόσο του γυμνασίου όσο και του λυκείου. Με γνώμονα λοιπόν αυτό το δεδομένο δημιουργήσαμε ένα εκπαιδευτικό πρόγραμμα που ανταποκρίνεται στις απαιτήσεις του εκπαιδευτικού συστήματος και καλύπτει τις ανάγκες των μαθητών μας. Συγκεκριμένα, δίνουμε έμφαση στην εμπέδωση της διδαχθείσας ύλης, γι’ αυτό έχουμε καθιερώσει τα εβδομαδιαία επαναληπτικά διαγωνίσματα σε όλα τα μαθήματα. Επιπλέον,για την καλύτερη προετοιμασία των μαθητών μας δίνεται πλούσιο υποστηρικτικό  υλικό( βιβλία και σημειώσεις) από τους συγγραφείς εκπαιδευτικούς του φροντιστηρίου μας. Ακόμα, έχουμε καθιερώσει επιπλέον ώρες διδασκαλίας (εκτός εβδομαδιαίου προγράμματος) για την κάλυψη αποριών ή ενδεχομένως μαθησιακών κενών των μαθητών, τις οποίες προσφέρουμε δωρεάν στους μαθητές μας. Τέλος, δίνουμε έμφαση στην επιστημονική κατάρτιση και την εμπειρία των συνεργατών εκπαιδευτικών μας, γιατί τους θεωρούμε στυλοβάτες του φροντιστηρίου μας και βασικούς συντελεστές της επιτυχίας των μαθητών μας.
            Γιατί να επιλέξετε εμάς:
            1) Έμπειροι Καθηγητές-συγγραφείς σχολικών βοηθημάτων που χρησιμοποιούνται  από φροντιστήρια και ιδιωτικά εκπαιδευτήρια
            2) Μεθοδικότητα και Αποτελεσματικότητα
            3) Πλούσιο υποστηρικτικό υλικό
            4) Ολιγομελή τμήματα
            5) Επιδότηση -Υποτροφίες μαθητών
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Epityxein');



     /*=============== 20 Ρούσσος Περιστέρι ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Ρούσσος Περιστέρι', 'email' => 'info@roussos.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'roussos'])->id,
         'address' => 'Αιμιλίου Βεάκη 19, Περιστέρι',
         'city' => 'Αθήνα',
         'phone' => 2105714111,
         'type_id' => 3,
         'website' => 'roussos.edu.gr',
         'approved' => 1,
         'about' => '
            Όμιλος φροντιστηρίων δυτικής Αττικής. 4 δεκαετίες εμπειρίας και εξειδίκευσης. Κάθε όνειρο είναι ξεχωριστό.

            Περιστέρι
            Διεύθυνση: αιμιλίου βεάκη 19 & ακροκορίνθου 25
            Τηλέφωνο: 210 57 14 111
            Email: info@roussos.edu.gr

            Αιγάλεω (άνωθεν ΔΕΗ αιγάλεω)
            Διεύθυνση: πανόρμου 14 & σμύρνης 29
            Τηλέφωνο: 210 59 11 159
            Email: info@roussos.edu.gr

            Ωράριο Γραμματείας
            Δευτέρα - Παρασκευή 9 π.π με 9 μ.μ.
            Σάββατο- 9π.μ. με 5μ.μ.

             ',
         'background' => $background,
     ]);

     new Portal($fake, 8, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/roussos.edu');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/Roussos_edu');


     /*=============== 21 Πρότυπο Αρτέμιδα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Πρότυπο Αρτέμιδα', 'email' => 'learn@protypoedu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'protypoedu'])->id,
         'address' => 'Αύρας 17, Αρτέμιδα',
         'city' => 'Αθήνα',
         'phone' => 2294084874,
         'type_id' => 3,
         'website' => 'protypoedu.gr',
         'approved' => 1,
         'about' => '
              Το φροντιστήριο ΠΡΟΤΥΠΟ, λαμβάνοντας υπόψη τις συνεχώς αυξανόμενες απαιτήσεις της σύγχρονης εκπαίδευσης, στοχεύει να συμβάλει στην ολοκληρωμένη στήριξη των μαθητών, σε όλες τις βαθμίδες της εκπαίδευσης. Αυτό σημαίνει ότι αποσκοπούμε στην κάλυψη μαθησιακών αναγκών τόσο στον γνωστικό, όσο και στον παιδαγωγικό τομέα. Τα παραπάνω επιτυγχάνονται με την ομαδική συνεργασία των εκπαιδευτικών μας, οι οποίοι είναι άριστα καταρτισμένοι γνωστικά και διδακτικά. Καινοτομία του χώρου μας συνιστά η απόλυτη ειδίκευση των καθηγητών μας σε συγκεκριμένα αντικείμενα του τομέα τους, καθώς και η προτότυπη συγγραφική τους δουλειά που παρέχεται στους μαθητές του φροντιστηρίου μας. Για εμάς κάθε μαθητής είναι μοναδικός και θεωρούμε πρόκληση να ανταποκριθούμε στις ανάγκες του και να αποδείξουμε τις ικανότητες του. Γι’ αυτό και τον προσεγγίζουμε ξεχωριστά οδηγούμενοι προς τον σκοπό αυτό.

            Φιλοσοφία - Στόχοι
            Εκπαιδευτικές υπηρεσίες υψηλού επιπέδου. Το φροντιστήριό μας λειτουργεί έχοντας ως αρχή τον αυστηρό προγραμματισμό και την άρτια οργάνωση.
            Ολιγομελή τμήματα μαθητών ( ο αριθμός των μαθητών ανά τμήμα δεν υπερβαίνει τους 9). Με τον τρόπο αυτό αναπτύσσεται καλύτερα η συνεργασία των παιδιών και η αλληλεπίδραση μεταξύ αυτών.
            Οι εκπαιδευτικοί μας προγραμματίζουν σωστά την ύλη και αναβαθμίζουν συνεχώς το εκπαιδευτικό υλικό τους ώστε να μην παρεκκλίνουν από τον καθορισμένο χρόνο διεξαγωγής της ύλης.
            Ο κάθε μαθητής είναι ξεχωριστός γι’ αυτό και εστιάζουμε στις ανάγκες του καθενός, βοηθώντας τον έτσι να ανακαλύψει και να βελτιώσει τις δυνατότητές του.
            Πραγματοποιείται συνεχής παρακολούθηση και καταγραφή της επίδοσης των μαθητών σε όλα τα μαθήματα. Αρχικά με φύλλα εργασίας που τους βοηθούν στην εμπέδωση της ύλης και στη συνέχεια με διαγωνίσματα σε όλη τη διάρκεια της χρονιάς.
            Συχνές ενημερώσεις γονέων/κηδεμόνων, όπου σε αυτές οι γονείς/κηδεμόνες πληροφορούνται για τις επιδόσεις των παιδιών τους και σε συνεργασία με τη διεύθυνση και τους καθηγητές επιλύουν τυχόν προβλήματα ή δυσκολίες.
            Λειτουργεί στο χώρο μας Τμήμα Συμβουλευτικής σε θέματα Επαγγελματικού Προσανατολισμού που ασχολείται με τον κάθε μαθητή χωριστά, τις ανησυχίες του και τις προοπτικές του βοηθώντας τον έτσι τελικά στη συμπλήρωση του μηχανογραφικού του δελτίου.
            Έχουμε δημιουργήσει και λειτουργούμε σε ένα χώρο με την κατάλληλη αισθητική και σωστά φροντισμένο, εξασφαλίζοντας στον μαθητή καλή διάθεση και ενισχύοντας παράλληλα την προσοχή του.
            Κάθε χρόνο διοργανώνονται από εμάς εκπαιδευτικές ημερίδες, εκδηλώσεις, εκδρομές και άλλες δραστηριότητες που βοηθούν στην ενίσχυση και στην ανάπτυξη των δεσμών όλων των φορέων του φροντιστηρίου μας.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', ' Ρομποτική & STEM');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Πληροφορική', 'Πληροφορική');


     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/ΦΡΟΝΤΙΣΤΗΡΙΟ-ΠΡΟΤΥΠΟ-278560645492188/');



     /*=============== 22 Διατριβή ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Διατριβή', 'email' => 'diatrivi@outlook.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'diatrivi'])->id,
         'address' => 'Θερμοπυλών 24β, Βριλήσσια',
         'city' => 'Αθήνα',
         'phone' => 2106137775,
         'type_id' => 3,
         'website' => 'diatrivi.gr',
         'approved' => 1,
         'about' => '
              Η Διατριβή είναι ένα φροντιστήριο μέσης εκπαίδευσης δημιουργημένο από εκπαιδευτικούς που αντιλαμβάνονται την πολυπλοκότητα των μαθητών και τους στηρίζουν ολοκληρωμένα με σκοπό την εισαγωγή τους σε σχολή της επιθυμίας τους και γνώμονα την παιδεία τους.
              Η διδασκαλία στο πρότυπο φροντιστήριο Διατριβή είναι μία πολυσύνθετη διαδικασία που βασίζεται στην εξατομικευμένη ανάλυση και προσέγγιση σε κάθε μαθητή με βασικούς στόχους τη δημιουργία κατάλληλου κλίματος εκπαίδευσης, τη δραστηριοποίηση του κάθε μαθητή, καθώς και τη μετάδοση της γνώσης. Οι μαθητές εδώ παίρνουν την ώθηση που χρειάζονται ώστε να προσπαθήσουν όσο το δυνατό περισσότερο για το δικό τους μέλλον.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/DiatriviFrontistirio');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/dia.trivi/');



     /*=============== 23 Θεμέλειο Ελευσίνα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Θεμέλειο Ελευσίνα', 'email' => 'info@themelio.net', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'themelioNet'])->id,
         'address' => 'Γρηγ.Λαμπράκη 19, Ελευσίνα',
         'city' => 'Αθήνα',
         'phone' => 2105541646,
         'type_id' => 3,
         'website' => 'themelio.net',
         'approved' => 1,
         'about' => '

            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/themelio.elefsinas/');





    }



}
