<?php

use Illuminate\Database\Seeder;
use App\Scholio\Scholio;
use Portal\Portal;

class Schools extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;


        /*===============  1 Φροντιστήριο Επίκεντρο ================*/
        $epik = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Επίκεντρο', 'email' => 'epicedro@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'epikentro'])->id,
            'address' => 'Ναυάρχου Βότση 46, Σταυρούπολη',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310587440,
            'type_id' => 3,
            'website' => 'epikentro.edu.gr',
            'approved' => 1,
            'about' => '
            Απ΄ το 1999 μέχρι και σήμερα, με κατευθυντήριους άξονες την οργάνωση, την μεθοδικότητα και την αποτελεσματικότητα, τα φροντιστήρια ΕΠΙΚΕΝΤΡΟ παρέχουν στους μαθητές τους άρτια και ολοκληρωμένη φροντιστηριακή υποστήριξη υψηλού επιπέδου.
Κινητήριος Δύναμη των φροντιστηρίων ΕΠΙΚΕΝΤΡΟ είναι, καταξιωμένοι καθηγητές, οι οποίοι χάρη στην επιστημονική τους αρτιότητα , τη μεταδοτικότητα, το χιούμορ, αλλά και την πλούσια εκπαιδευτική τους εμπειρία, συμβάλλουν ουσιαστικά στην πρόοδο των μαθητών και τους προετοιμάζουν για την επίτευξη των στόχων τους.
Κοιτάζοντας κατάματα τις προκλήσεις των καιρών, αναδεικνύουμε στο έπακρο τις ικανότητες των μαθητών μας (και αυριανών επιστημόνων), μεταλαμπαδεύοντάς τους την γνώση, για να κάνουν το όνειρό τους πραγματικότητα.

Διεύθυνση Σπουδών
Γιώργος Δημητριάδης – Αλέξανδρος Βασάρας
            ',
            'background' => $background,
        ]);

        new Portal($epik, 5, 'school');

        Scholio::portalStudy($epik, 'Γυμνάσιο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($epik, 'Γυμνάσιο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($epik, 'Γυμνάσιο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($epik, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($epik, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($epik, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($epik, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($epik, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($epik, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


        Scholio::portalSocial($epik, 'facebook', 'https://www.facebook.com/Επίκεντρο-Φροντιστήριο-Μέσης-Εκπαίδευσης-1434744540176860/');
//        Scholio::portalSocial($epik, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($epik, 'youtube', 'https://www.youtube.com/');





        /*=============== 2 Φροντιστήριο Τσακανίκας ================*/

        $tsak = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => '', 'email' => 'tsakanikasedu@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'tsakanikas'])->id,
            'address' => 'Νέο Πάρκο Επανομής, 57500',
            'city' => 'Επανομή',
            'phone' => 2392045123,
            'type_id' => 3,
            'website' => 'facebook.com/tsakanikas.edu.gr',
            'approved' => 1,
            'about' => '

            ',
            'background' => $background,
        ]);

        new Portal($tsak, 5, 'school');

        Scholio::portalStudy($tsak, 'Γυμνάσιο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($tsak, 'Γυμνάσιο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($tsak, 'Γυμνάσιο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($tsak, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($tsak, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($tsak, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($tsak, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($tsak, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($tsak, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


        Scholio::portalSocial($tsak, 'facebook', 'https://www.facebook.com/tsakanikas.edu.gr');
//        Scholio::portalSocial($tsak, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($tsak, 'youtube', 'https://www.youtube.com/');




        /*=============== 3 To Φροντιστήριο ================*/

        $tofront = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Το Φροντιστήριο', 'email' => 'info@tofrodistirio.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'tofrodistirio'])->id,
            'address' => 'Αγίας Σοφίας και Αγίας Θεοδώρας 15',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310286777,
            'type_id' => 3,
            'website' => 'tofrodistirio.gr ',
            'approved' => 1,
            'about' => '
            Το σχολικό έτος 2011 - 2012 ταράζοντας τα λιμνάζοντα νερά στο χώρο της φροντιστηριακής εκπαίδευσης, μια αποτελεσματική και εξειδικευμένη ομάδα καταξιωμένων εκπαιδευτικών με πολυετή εμπειρία ξεκινήσαμε μια ανεξάρτητη πορεία. Με αίσθημα ευθύνης απευθυνθήκαμε στους μαθητές της θετικής και τεχνολογικής κατεύθυνσης, ιδρύοντας ένα φροντιστήριο μάχιμων καθηγητών.
Φιλοδοξία μας ήταν και είναι ότι με συστηματική εργασία, οργάνωση και παρακολούθηση, προσαρμοστικότητα και καινοτόμες δράσεις μπορούμε να πετύχουμε. Θεωρούμε το φροντιστήριο θεσμό της εκπαίδευσης και όχι εμπορική επιχείρηση. Παράλληλα αντιλαμβανόμενοι την ιδιαιτερότητα της εποχής παρέχουμε υπηρεσίες υψηλού επιπέδου, που είναι όμως προσιτές σε όλους.
Σε συνεργασία με τους μαθητές συμβάλλουμε στην υλοποίηση των στόχων τους, μεγιστοποιώντας την επίδοσή τους στις εξετάσεις για την εισαγωγή στην τριτοβάθμια εκπαίδευση.

            ',
            'background' => $background,
        ]);

        new Portal($tofront, 5, 'school');

        Scholio::portalStudy($tofront, 'Γυμνάσιο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($tofront, 'Γυμνάσιο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($tofront, 'Γυμνάσιο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($tofront, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($tofront, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($tofront, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($tofront, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($tofront, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($tofront, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


        Scholio::portalSocial($tofront, 'facebook', 'https://www.facebook.com/tofrontistirio.thessaloniki');
//        Scholio::portalSocial($tofront, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($tofront, 'youtube', 'https://www.youtube.com/');




        /*=============== 4 Φροντιστήριο Βακάλης Κέντρο ================*/

        $vak = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Βακάλης', 'email' => 'kentro@vakalis.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'vakalis'])->id,
            'address' => 'Μητροπόλεως 17',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310221041,
            'type_id' => 3,
            'website' => 'vakalis.edu.gr',
            'approved' => 1,
            'about' => '
Φροντιστήρια Βακάλης: Σε πάμε εκεί που θέλεις
Από το 1967 μέχρι σήμερα, το εκπαιδευτικό μας όραμα διατηρεί μία σταθερή συνέπεια: βοηθάμε νέους ανθρώπους, αυριανούς ενεργούς πολίτες, να πετύχουν τα όνειρά τους.
Παρέχουμε μαθησιακά κίνητρα, δημιουργούμε εκπαιδευτικές προκλήσεις, είμαστε δίπλα σε κάθε απορία, έτοιμοι να αφουγκραστούμε τις ανησυχίες και να ενισχύσουμε τις ικανότητες των μαθητών μας.
Αντιμετωπίζοντας τον κάθε υποψήφιο ως μια διακριτή και ξεχωριστή προσωπικότητα, συμβάλλουμε στο να ανακαλύψει ο ίδιος τις κλίσεις, τα ενδιαφέροντα και τις δυνατότητές του κι εν τέλει, μέσα από τη συνεργασία μας, να καταφέρει να εισαχθεί στη σχολή της επιλογής του.
            ',
            'background' => $background,
        ]);

        new Portal($vak, 5, 'school');

        Scholio::portalStudy($vak, 'Γυμνάσιο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($vak, 'Γυμνάσιο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($vak, 'Γυμνάσιο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($vak, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($vak, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($vak, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($vak, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($vak, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($vak, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


        Scholio::portalSocial($vak, 'facebook', 'https://www.facebook.com/vakalis.frontistiria/');
        Scholio::portalSocial($vak, 'instagram', 'https://www.instagram.com/vakalis_frontistiria');
        Scholio::portalSocial($vak, 'youtube', 'https://www.youtube.com/channel/UCmPwzv20nkIZYUjRLwmyMxg');





        /*=============== 5 Φροντιστήριο Elix Κέντρο ================*/

        $elix = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Έλιξ Φροντιστήρια Υψηλών Στόχων', 'email' => 'aristotelous@elix.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'elix'])->id,
            'address' => 'Αριστοτέλους 8',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310269849,
            'type_id' => 3,
            'website' => 'elix.edu.gr',
            'approved' => 1,
            'about' => '
Στα έλιξ απαντούμε σε καίριες ερωτήσεις που απασχολούν μαθητές, γονείς και εκπαιδευτικούς. Οι απαντήσεις που δίνουμε δεν είναι γενικές και θεωρητικές, αλλά πηγάζουν από δοκιμασμένες πρακτικές που έχουν αποτέλεσμα σε κάθε μαθητή ξεχωριστά.
Τι κάνουμε στα έλιξ σήμερα;
Προετοιμάζουμε τους μαθητές μας για την επιτυχία τους στις Πανελλαδικές Εξετάσεις, αλλά και για να δώσουν μάχες για επόμενες επιτυχίες. Προσαρμόζουμε τα αναλυτικά Προγράμματα Σπουδών στις ανάγκες των Πανελλαδικών Εξετάσεων του 2019 και του 2020, απαντώντας σε ερωτήματα όπως ποια είναι η ύλη των Πανελλαδικών Εξετάσεων και πότε θα διδαχθεί στους μαθητές. Εκπαιδεύουμε άριστους εκπαιδευτικούς στην εφαρμογή συστημάτων και διαδικασιών.
            ',
            'background' => $background,
        ]);

        new Portal($elix, 5, 'school');

        Scholio::portalStudy($elix, 'Γυμνάσιο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($elix, 'Γυμνάσιο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($elix, 'Γυμνάσιο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($elix, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($elix, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($elix, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($elix, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($elix, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($elix, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


        Scholio::portalSocial($elix, 'facebook', 'https://www.facebook.com/elix.edu.gr');
//        Scholio::portalSocial($elix, 'instagram', 'https://www.instagram.com/');
        Scholio::portalSocial($elix, 'youtube', 'https://www.youtube.com/channel/UCw25zj59U5jI8CezDjgWdIw');
        Scholio::portalSocial($elix, 'linkedin', 'https://www.linkedin.com/company/%CF%86%CF%81%CE%BF%CE%BD%CF%84%CE%B9%CF%83%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%AD%CE%BB%CE%B9%CE%BE/');





        /*=============== 6 Φροντιστήριο e-εκπαίδευση ================*/

        $ekpd = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια e-εκπαίδευση', 'email' => 'info@ekpedefsiedu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ekpedefsi'])->id,
            'address' => 'Γρηγορίου Λαμπράκη 147, Τούμπα',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310912282,
            'type_id' => 3,
            'website' => 'ekpedefsiedu.gr',
            'approved' => 1,
            'about' => '
            Αγαπητοί γονείς, φίλοι μαθητές
Ιδρύοντας τα Φροντιστήρια Εκπαίδευση προσπαθήσαμε να ανταποκριθούμε επάξια στις απαιτήσεις και τις ανάγκες της σύγχρονης εκπαίδευσης. Η εικοσιπενταετής πείρα μας στο χώρο των φροντιστηρίων, η επιστημονική πληρότητα, η μεθοδικότητα στον τρόπο εργασίας, η μεταδοτικότητα και η παιδαγωγική επάρκεια των συνεργατών μας καθώς επίσης και η ανθρώπινη καθημερινή επαφή των στελεχών μας με γονείς και μαθητές, έχουν δημιουργήσει μια μακροχρόνια παράδοση επιτυχιών και εγγυώνται για τη σωστή επιλογή σας. Τα φροντιστήρια Εκπαίδευση εδρεύουν σε τρεις συνοικίες της Θεσσαλονίκης (Τούμπα, Αμπελόκηποι, Νεάπολη) με στόχο να προσφέρουν υψηλού φροντιστηριακού επιπέδου εκπαίδευση στους μαθητές δίπλα στο σπίτι τους.
Βασικό μας μέλημα είναι η καθοδήγηση, η στήριξη των παιδιών και η ενθάρρυνσή τους ώστε να τερματίσουν με επιτυχία το δύσκολο δρόμο που καταλήγει στις πανελλαδικές εξετάσεις.
Οι επιτυχίες των μαθητών μας καθιστούν την «ΕΚΠΑΙΔΕΥΣΗ» ένα από τα κορυφαία φροντιστήρια της Θεσσαλονίκης. Αυτό επιτυγχάνεται με τη χρήση σύγχρονων διδακτικών μέσων, το υψηλό επίπεδο διδασκαλίας, τη συνέπεια λόγων και έργων και την άρτια οργάνωση των φροντιστηρίων. Επιβράβευσή μας είναι να παρακολουθούμε τους παλιούς μαθητές μας να διαπρέπουν στον τομέα που ο καθένας έχει διαλέξει.
Εκ μέρους όλων των συνεργατών μας, θέλουμε να σας ευχαριστήσουμε για την εμπιστοσύνη που μας δείξατε όλα αυτά τα χρόνια και την παρουσία σας στην κοινή μας πορεία, με ποιότητα στην εκπαίδευση των νέων ανθρώπων, που κρατούν στα χέρια τους το μέλλον του τόπου.

Με εκτίμηση
Η Διεύθυνση των φροντιστηρίων
            ',
            'background' => $background,
        ]);

        new Portal($ekpd, 5, 'school');

        Scholio::portalStudy($ekpd, 'Γυμνάσιο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($ekpd, 'Γυμνάσιο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($ekpd, 'Γυμνάσιο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($ekpd, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($ekpd, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($ekpd, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($ekpd, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($ekpd, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($ekpd, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


        Scholio::portalSocial($ekpd, 'facebook', 'https://www.facebook.com/frontistiria.ekpedefsi');
        Scholio::portalSocial($ekpd, 'instagram', 'https://www.instagram.com/frontistiria_ekpedefsi/');
        Scholio::portalSocial($ekpd, 'twitter', 'https://twitter.com/ekpaidefsi');




        /*=============== 7 Φροντιστήριο Σύγχρονο  Κέντρο ================*/

        $sygh = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Σύγχρονο', 'email' => 'syghrono@yahoo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'syghrono'])->id,
            'address' => 'Τσιμισκή 47',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310270727,
            'type_id' => 3,
            'website' => 'syghrono.gr',
            'approved' => 1,
            'about' => '
            Τα φροντιστήρια "σύγχρονο" έχουν καταξιωθεί στο χώρο της εκπαίδευσης για την υψηλή ποιότητα του παρεχόμενου έργου τους, το οποίο επικεντρώνεται σε τρεις βασικές συνιστώσες της εκπαίδευσης: διδάσκοντες, περιεχόμενο σπουδών, υλικοτεχνική υποδομή.
Κατάλληλος Προγραμματισμός
Στην επιτυχία του εκπαιδευτικού μας έργου συμβάλλει και ο κατάλληλος προγραμματισμός που στηρίζεται στη συνεκτίμηση της ύλης που πρέπει να διδαχθεί και του χρόνου στον οπόιο πρέπει να διδαχθεί. Κάθε διδακτική ώρα καθόλη τη διάρκεια της χρονιάς γίνεται με προγραμματισμό και όχι τυχαία ή με στιγμιαίους αυτοσχεδιασμούς. Έτσι η εξεταστέα ύλη ολοκληρώνεται στα τέλη Φεβρουαρίου και ακολουθούν επαναλήψεις για πλατύτερη αφομοίωση της ύλης.
Σύγχρονες εξεταστικές μέθοδοι
Με σύγχρονες και ποικίλες εξεταστικές μεθόδος ελέγχεται η κατανόηση, η εμπέδωση και ο βαθμός αφομοίωσης της εξεταστέας ύλης καθώς και η γνωστική εξέλιξη του κάθε μαθητή. Κυρίως όμως με ταπρογραμματισμένα τρίωρα επαναληπτικά διαγωνίσματα καθόλη τη διάρκεια της σχολικής χρονιάς, που διενεργούνται σε συνθήκες παρόμοιες με εκείνες των εισαγωγικών εξετάσεων. Η αυστηρή επιτήρηση, η τήρηση του μέγιστου δυνατού χρόνου αποχώρησης, το επίπεδο των θεμάτων, εξοικιώνουν τους σπουδαστές όλων των τάξεων του λυκείου με τις εξετάσεις και τους προετοιμάζουν ώστε να αντιμετωπίσουν μετέπειτα την πρόκληση των Πανελληνίων εξετάσεων.
            ',
            'background' => $background,
        ]);

        new Portal($sygh, 5, 'school');

        Scholio::portalStudy($sygh, 'Γυμνάσιο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($sygh, 'Γυμνάσιο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($sygh, 'Γυμνάσιο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($sygh, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($sygh, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($sygh, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($sygh, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($sygh, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($sygh, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


        Scholio::portalSocial($sygh, 'facebook', 'https://www.facebook.com/syghrono/');
//        Scholio::portalSocial($sygh, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($sygh, 'youtube', 'https://www.youtube.com/');





        /*=============== 8 Φροντιστήριο Υποδομή ================*/

        $ypo = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Υποδομή', 'email' => 'info@ypodomi.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ypodomi'])->id,
            'address' => 'Κουγιουμτζίδη 7',
            'city' => 'Γιαννιτσά',
            'phone' => 2382027799,
            'type_id' => 3,
            'website' => 'ypodomi.com',
            'approved' => 1,
            'about' => '
            Αγαπητέ μαθητή/τρια, γνωρίζουμε πολύ καλά ότι δεν υπάρχει τίποτε καλύτερο και υψηλότερο για ένα νέο άνθρωπο, απόφοιτο Λυκείου, από το να επιτύχει την είσοδό του στο Πανεπιστήμιο. Όταν μάλιστα η είσοδος αυτή ανταποκρίνεται και στην πρώτη σχολή την οποία επέλεξε, τότε είναι σίγουρο πως η επαγγελματική του σταδιοδρομία είναι εξασφαλισμένη και επιτυχημένη.

Η επιτυχία σου δεν είναι θέμα τύχης, επιφάνειας και εντύπωσης, αλλά μόχθου, βάθους και ουσίας. Η υλοποίηση των υψηλών στόχων προϋποθέτει όχι μόνο ατομική θέληση, άλλα και υπεύθυνη προετοιμασία, τόσο σε γνωστικό όσο και σε ψυχολογικό επίπεδο.

Το πρόγραμμα μαθημάτων του φροντιστηρίου στηρίζεται στις παρακάτω αρχές:

Διαρκής ανανέωση και βελτίωση
Κλειστά ομοιογενή τμήματα και γκρουπ
Επιλογή άριστα καταρτισμένων καθηγητών
Υψηλό επίπεδο διδασκαλίας
Καλλιεργούμε και αναπτύσσουμε μεθόδους
Επαναληπτικά Διαγωνίσματα
Πρόσθετες ώρες και διαγωνίσματα
Συνεργασία με τους γονείς
Σύσκεψη Καθηγητών
Οργάνωση και λειτουργικότητα


Διαρκής ανανέωση και βελτίωση

Η ανοδική πορεία μας είναι σταθερή και η εξέλιξη συνεχής. Κανένα άλλο Φροντιστήριο δεν έχει να παρουσιάσει τόσες επιτυχίες, τον πρώτο χρόνο λειτουργίας του. Η επιτυχία στις ανώτατες σχολές εξασφαλίζεται:

Με ανελλιπή παρακολούθηση των μαθημάτων μας
Με σκληρή, επίπονη και επίμονη προσωπική μελέτη
Με υποχρεωτική συμμετοχή στα διαγωνίσματα

Κλειστά ομοιογενή τμήματα και γκρουπ

Οι μαθητές χωρίζονται με βάση το πραγματικό τους επίπεδο και όχι με κριτήριο το λύκειο στο οποίο φοιτούν. Το πρόγραμμα του κάθε τμήματος θα είναι ανάλογα διαμορφωμένο και οι μαθητές που θα φοιτούν σ’ αυτά τα τμήματα θα έχουν την δυνατότητα να δουλέψουν σωστά, ώστε και στο σχολείο να μην έχουν καμία δυσκολία, αλλά και το σπουδαιότερο, με άνεση θα μπορούν να στοχεύουν το άριστα στις εξετάσεις της Α’ ,  Β’ Λυκείου, όπως και στις Πανελλαδικές Εξετάσεις της Γ΄ Λυκείου.

            ',
            'background' => $background,
        ]);

        new Portal($ypo, 5, 'school');

//        Scholio::portalStudy($ypo, 'Γυμνάσιο', 'Γυμνάσιο', 'Ά Γυμνασίου');
//        Scholio::portalStudy($ypo, 'Γυμνάσιο', 'Γυμνάσιο', '΄Β Γυμνασίου');
//        Scholio::portalStudy($ypo, 'Γυμνάσιο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($ypo, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($ypo, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($ypo, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($ypo, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($ypo, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($ypo, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


        Scholio::portalSocial($ypo, 'facebook', 'https://www.facebook.com/ypodomigiannitsa/');
//        Scholio::portalSocial($ypo, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($ypo, 'youtube', 'https://www.youtube.com/');





        /*===============  9 Φροντιστήριο Βογιατζής ================*/

        $bogia = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Βογιατζής', 'email' => 'frontvog@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'vogiatzis'])->id,
            'address' => 'Μακρυγιάννη 39',
            'city' => 'Θέρμη',
            'phone' => 2310463263,
            'type_id' => 3,
            'website' => 'facebook.com/educationVogiatzis',
            'approved' => 1,
            'about' => '

            ',
            'background' => $background,
        ]);

        new Portal($bogia, 5, 'school');

        Scholio::portalStudy($bogia, 'Γυμνάσιο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($bogia, 'Γυμνάσιο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($bogia, 'Γυμνάσιο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($bogia, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($bogia, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($bogia, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($bogia, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($bogia, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($bogia, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


        Scholio::portalSocial($bogia, 'facebook', 'https://www.facebook.com/educationVogiatzis/');
//        Scholio::portalSocial($bogia, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($bogia, 'youtube', 'https://www.youtube.com/');





        /*===============  10 Φροντιστήρια Μπαχαράκη ================*/

        $baha = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Μπαχαράκη', 'email' => 'aristotelous@baharakis.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'baharakis'])->id,
            'address' => 'Λεωφόρος Νίκης 13 - Πλατεία Αριστοτέλους',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310262411,
            'type_id' => 3,
            'website' => 'baharakis.gr',
            'approved' => 1,
            'about' => '
            Τα φροντιστήρια μέσης εκπαίδευσης Μπαχαράκη λειτουργούν στη Θεσσαλονίκη εδώ και 55 χρόνια. Διασφαλίζοντας την υψηλότερη ποιότητα διδασκαλίας και ακολουθώντας τις πιο σύγχρονες μεθόδους φέρνουν πρώτους τους μαθητές τους, με υψηλά ποσοστά επιτυχίας στις πανελλήνιες εξετάσεις για όλες τις ομάδες προσανατολισμού (Ανθρωπιστικών σπουδών, Θετικών σπουδών και Σπουδών Οικονομίας και Πληροφορικής).
  Με παραρτήματα στο κέντρο της Θεσσαλονίκης (Αριστοτέλους), στην Ανατολική Θεσσαλονίκη (Παπαναστασίου), στη Δυτική Θεσσαλονίκη (Εύοσμος) και στην Καλαμαριά και τη Θέρμη καλύπτουν γεωγραφικά όλες τις περιοχές της πόλης.
  Οι προσεγμένες και άρτια εξοπλισμένες αίθουσες διδασκαλίας, με διαδραστικούς πίνακες και πλήθος εποπτικών μέσων, αποτελούν πρότυπο εγκαταστάσεων.
  Το κατάλληλα επιμορφωμένο και αυστηρά εξειδικευμένο σταθερό εκπαιδευτικό και διοικητικό προσωπικό στέκεται δίπλα στους μαθητές, ενισχύοντας στο μέγιστο τις δυνατότητες τους.
  Τα φροντιστήρια Μπαχαράκη, ολοκληρώνουν τις υπηρεσίες τους ως φροντιστήρια μέσης εκπαίδευσης, παρέχοντας πλήρη κάλυψη των μαθητών τους και σε ειδικά μαθήματα (σχέδιο, προετοιμασία για εξετάσεις φυσικής αγωγής, ξένων γλωσσών κτλ).

            ',
            'background' => $background,
        ]);

        new Portal($baha, 5, 'school');

        Scholio::portalStudy($baha, 'Γυμνάσιο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($baha, 'Γυμνάσιο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($baha, 'Γυμνάσιο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($baha, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($baha, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($baha, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($baha, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($baha, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($baha, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


//        Scholio::portalSocial($baha, 'facebook', 'https://www.facebook.com/');
//        Scholio::portalSocial($baha, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($baha, 'youtube', 'https://www.youtube.com/');





        /*===============  ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => '', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => '',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310,
            'type_id' => 3,
            'website' => '',
            'approved' => 1,
            'about' => '

            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'school');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


//        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





    }

}
