<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria13 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;





     /*=============== 1 PanYeah ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών PanYeah', 'email' => 'info@panyeah.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'panyeah'])->id,
         'address' => 'Δημοσθένους 99, Καλλιθέα',
         'city' => 'Αθήνα',
         'phone' => 2109591933,
         'type_id' => 4,
         'website' => 'panyeah.gr',
         'approved' => 1,
         'about' => '
           Τo Φροντιστήριο Ξένων Γλωσσών, Πληροφορικής και Μελέτης PanYeah έχει στόχο να μεταδώσει στους σπουδαστές κάθε ηλικίας την γνώση και την αγάπη για την εκμάθηση νέων γλωσσών, αλλά και να τους προσφέρει τα εφόδια που χρειάζονται για να πετύχουν τους στόχους τους, επαγγελματικούς και εκπαιδευτικούς.
           Οι εγκαταστάσεις μας και το προσωπικό μας δημιουργούν ένα φιλικό και σύγχρονο περιβάλλον, που προσφέρει την καλύτερη μαθησιακή εμπειρία, αλλά και ουσιαστική επαφή με τις γλώσσες και την κουλτούρα τους. Βαθύτερος στόχος μας είναι οι μαθητές μας να μπορούν να «ταξιδεύουν» μέσα από τη γλώσσα που μαθαίνουν και να αναπτύσσουν όχι μόνο γλωσσικές δεξιότητες αλλά και σφαιρική γνώση που αφορά τον πολιτισμό της κάθε γλώσσας.
           Για περισσότερες πληροφορίες, μπορείτε να απευθυνθείτε στη γραμματεία μας ή να μας επισκεφθείτε στον χώρο μας Δημοσθένους 99 στην Καλλιθέα.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Κινέζικα');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Τούρκικα');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αράβικα');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Κινέζικα');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αράβικα');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ελληνικά για Αλλοδαπούς');


     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');


     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Πληροφορική', 'Εφαρμογές Η/Υ');
     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/panyeahforeignlanguages');






     /*=============== 2 Μελετίου-Οικονόμου ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Μελετίου - Οικονόμου', 'email' => 'info@meletiou-oikonomou.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'meletiouOikonomou'])->id,
         'address' => 'Ηρώων Πολυτεχνείου 16, Πειραιάς',
         'city' => 'Αθήνα',
         'phone' => 2130286621,
         'type_id' => 4,
         'website' => 'meletiou-oikonomou.gr',
         'approved' => 1,
         'about' => '
            Το κέντρο ξένων γλωσσών Μελετίου-Οικονόμου είναι αποτέλεσμα δραστηριοποίησης στο χώρο της ξενόγλωσσης εκπαίδευσης για περισσότερα από 30 έτη.
            Τα μαθήματα πραγματοποιούνται σε ένα σύγχρονο χώρο στο κέντρο του Πειραιά. Το εκπαιδευτικό προσωπικό αποτελείται από καθηγήτριες που έχουν ως μητρική τη γλώσσα που διδάσκουν και είναι κάτοχοι των αντίστοιχων πτυχίων φιλολογίας, καθώς και από καθηγήτριες με εμπειρία και ανώτατα πτυχία γλωσσομάθειας.
            Η διεύθυνση της σχολής θεωρεί πολύ σημαντική την επικοινωνία με τους γονείς των σπουδαστών. Γιαυτό το λόγο οι εκπαιδευτικοί έχουν συναντήσεις μαζί τους σε μηνιαία βάση. Το ζητούμενο για μας είναι η ουσιαστική και εποικοδομητική επικοινωνία μαζί σας. Σε εξυπηρέτηση αυτού του σκοπού, η διευθύντρια σπουδών Κα Μελετίου είναι στη διάθεση των γονιών καθημερινά και οργανώνει σεμινάρια και ενημερώσεις για γονείς και εκπαιδευτικούς σε συνεργασία με εκπαιδευτική σύμβουλο ώστε να αντιμετωπίζονται έγκαιρα τυχόν μαθησιακές δυσκολίες ή αρνητικοί ψυχολογικοί παράγοντες που δημιουργούν κωλύματα στη διαδικασία της μάθησης και στην εξέλιξη των σπουδαστών μας.
            Ο βασικός μας στόχος είναι το κάθε μάθημα να είναι πολύπλευρο και ενδιαφέρον και η κάθε επικοινωνία μας με τους γονείς να τους διευκολύνει στο γονεϊκό τους ρόλο και να κάνει εμάς ακόμα καλύτερους δασκάλους.
            Επιλέγοντας το Κέντρο Ξένων Γλωσσών ΜΕΛΕΤΙΟΥ-ΟΙΚΟΝΟΜΟΥ επιλέγετε:
            Εκπαιδευτική φροντίδα
            Ολοκληρωμένα προγράμματα
            Εξειδικευμένους καθηγητές
            Συστηματικό και αντικειμενικό έλεγχο επίδοσης
            Σύγχρονες διδακτικές προσεγγίσεις
            Υψηλά ποσοστά επιτυχίας
            Πραγματικά προσιτές τιμές
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Κινέζικα');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Κινέζικα');



       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Μελετίου-Οικονόμου-289749084500784');





     /*=============== 3 fun2learn ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες fun2learn', 'email' => 'info@fun2learn', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'fun2learn'])->id,
         'address' => 'Δ. Βερελή 60, Άνω Γλυφάδα',
         'city' => 'Αθήνα',
         'phone' => 2109607398,
         'type_id' => 4,
         'website' => 'fun2learn.gr',
         'approved' => 1,
         'about' => '
           Χτίζουμε καθημερινά σχέσεις αγάπης και εμπιστοσύνης, εφόσον τα παιδιά σας τα θεωρούμε ήδη Παιδιά μας!
           Παρακολουθούμε την πρόοδο κάθε παιδιού ξεχωριστά και ενημερώνουμε γραπτώς τους γονείς με το Τετράδιο Επικοινωνίας – Προόδου όπου αναγράφονται καθημερινά οι επιδόσεις του σε όλους τους τομείς.
           Δωρεάν Ενισχυτική Διδασκαλία και Επαναληπτικό υλικό όταν χρήζει βελτίωσης της απόδοσης του μαθητή μας.
           Πραγματοποιούμε Συναντήσεις σε προσωπικό επίπεδο.
           Παρέχουμε Δωρεάν Συμβουλευτική.
           Προλαμβάνουμε και ενημερώνουμε για μαθησιακές δυσκολίες, δουλεύοντας μαζί, τους τρόπους αντιμετώπισης που σας προτείνουμε.
           Το χαμόγελο στο πρόσωπο των παιδιών, που πηγάζει από τον ενθουσιασμό και την αυτοπεποίθηση για τη γνώση που αποκτούν κοντά μας, είναι η Δύναμή μας για να συνεχίσουμε να πραγματοποιούμε το έργο μας!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Κινέζικα');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Κινέζικα');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αραβικά');

     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Πληροφορική', 'Πιστοποίηση');
     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Fun2LearnStudies');


     /*=============== 4 AXON Ελληνικό ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες AXON Ελληνικό', 'email' => 'axon@axonelliniko.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'axonElliniko'])->id,
         'address' => 'Ιασωνίδου 43, Ελληνικό',
         'city' => 'Αθήνα',
         'phone' => 2109639370,
         'type_id' => 4,
         'website' => 'axonelliniko.gr',
         'approved' => 1,
         'about' => '
            O Εκπαιδευτικός Όμιλος ΑΧΟΝ Ελληνικού ανταποκρινόμενος στις απαιτήσεις γονιών και σπουδαστών, προσφέρει ένα ολοκληρωμένο και ευρύ φάσμα εκπαίδευσης με τις πιο σύγχρονες μεθόδους.
            Αξιοποιώντας ένα αυστηρά επιλεγμένο σύνολο καθηγητών, μέσω πρωτοποριακών μεθόδων εκπαίδευσης και αξιολόγησή τους, εμείς στο ΑΧΟΝ Ελληνικού προσπαθούμε να καλύπτουμε πλήρως τις ανάγκες και του πιο απαιτητικού σπουδαστή. Η σωστή κατανόηση-αφομοίωση της ύλης που διδάσκουμε στους σπουδαστές μας, σε όλους τους τομείς εκπαίδευσης είναι για μας πρωταρχικός παράγοντας.
            Με 350 κέντρα ξένων γλωσσών & πληροφορικής σε Ελλάδα, Αίγυπτο, Αλβανία, Πολωνία, Ιραν, Τσεχία, Κύπρο, Ντουμπάι, Σαουδική Αραβία, Ρωσία, Κολομβία, Κίνα, Μαλαισία και Λετονία έχετε 350 λόγους να είστε εδώ!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Τούρκικα');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αραβικά');



     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αραβικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');

     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Πληροφορική', 'Πιστοποίηση');
     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/axonelliniko.gr');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/AXONELLINIKO');
       Scholio::portalSocial($fake, 'google-plus', 'https://plus.google.com/+AXONELLINIKO');




     /*=============== 5  Victoria's School ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Victoria\'s School', 'email' => 'info@victoriaschool.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'victoriaSchool'])->id,
         'address' => 'Αραπάκη 76, Καλλιθέα',
         'city' => 'Αθήνα',
         'phone' => 2114027146,
         'type_id' => 4,
         'website' => 'victoriaschool.gr',
         'approved' => 1,
         'about' => '
               «Για εμάς η εμπειρία δεν αποτελεί ένα μέσο για να επαναλαμβάνουμε στους μαθητές μας όλα όσα ήδη γνωρίζουμε, αλλά κίνητρο για ένα ακόμη επιτυχημένο βήμα».
               Έχοντας υπηρετήσει με απόλυτη επιτυχία τον χώρο της ξενόγλωσσης εκμάθησης για πάνω από 10 χρόνια, θελήσαμε να προσφέρουμε σε μαθητές και γονείς, μια νέα εκπαιδευτική πρόταση! Μια πρόταση που φέρνει τις ισορροπίες στα “θέλω” των μαθητών, στα “μπορώ” των γονέων, στα “πρέπει” του κάθε σύγχρονου κέντρου ξένων γλωσσών.
               Στο Κέντρο Ξένων Γλωσσών “Victoria’sSchool”, “μπορούμε” και “θέλουμε” να προσφέρουμε ποιοτικές υπηρεσίες εκμάθησης ξένων γλωσσών, σε μαθητές κάθε ηλικίας και κάθε επιπέδου. Γιατί έτσι “πρέπει” να είναι η προσφορά της γνώσης.
               Ποιοτική, Προσιτή και Αξιόπιστη.
               Στην Πράξη...
               Στον μοντέρνο και σύγχρονο χώρο του Κέντρου Ξένων Γλωσσών “Victoria’sSchool”, οι ευρωπαϊκού επιπέδου υπηρεσίες εκμάθησης, εναρμονίζονται όχι μόνο με τη χρήση των πλέον αναγνωρισμένων εκπαιδευτικών μέσων υψηλής τεχνολογίας (διαδραστικοί πίνακες), αλλά και με τον κυριότερο ίσως κρίκο στην αλυσίδα της μάθησης.
               Το διδακτικό προσωπικό.
               Ένα άρτια επιλεγμένο σύνολο καθηγητών, με υψηλό επίπεδο κατάρτισης και διαρκή επιμόρφωση μέσω σεμιναρίων (εκπαιδευτικά-παιδαγωγικά), εγγυάται έναν πραγματικά βιωματικό τρόπο διδασκαλίας σε κάθε μαθητή που θα εμπιστευθεί το όνειρό του για επιτυχία, σε ανθρώπους που μπορούν να το κάνουν πραγματικότητα. Στους ανθρώπους δηλαδή του Κέντρου Ξένων Γλωσσών “Victoria’sSchool”.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αραβικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αραβικά');







     // /*=============== 6  Εκπαιδευτήρια Στέγκα	 ===============*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Στέγκα', 'email' => 'school@stegas.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'stegas'])->id,
         'address' => 'Μικράς Ασίας 67, Κερατσίνι',
         'city' => 'ΑΘήνα',
         'phone' => 2104001595,
         'type_id' => 13,
         'website' => 'stegas.gr',
         'approved' => 1,
         'about' => '
            Τα Εκπαιδευτήριά μας έχουν συμπληρώσει 85 χρόνια εκπαιδευτικού έργου.
            Ιδρυτής του σχολείου μας ήταν ο Δημήτριος Στέγκας. Γεννήθηκε στην Ελληνική επαρχία στα τέλη του 19ου αιώνα. Επέλεξε να σπουδάσει και μετακινήθηκε στην κοντινότερή του πόλη, τη Λαμία, όπου υπήρχε Παιδαγωγική Ακαδημία.
            Μετά την αποφοίτησή του με το πτυχίο του δάσκαλου ,άρχισαν οι Βαλκανικοί πόλεμοι και ο Μικρασιατικός πόλεμος στους οποίους συμμετείχε έως το τέλος τους.
            Στη συνέχεια έρχεται στον Πειραιά όπου ξεκινά το πρώτο του Δημοτικό σχολείο, στην οδό Φωτίου Κορυτσάς, το 1925.
            Το 1930 μετακινείται σε ιδιόκτητο κτίριο στην οδό Δράμας και Σπάρτης. Το 1939 ξεκινά τη λειτουργία και Γυμνασίου.
            Το 1958 τα Εκπαιδευτήρια Στέγκα λειτουργούν σε ιδιόκτητο νέο κτίριο στην πλατεία Κερατσινίου (Κύπρου). Το 1962 αποβιώνει ο ιδρυτής των Εκπαιδευτηρίων Δημήτριος Στέγκας και συνεχίζουν το έργο του τα παιδιά του Μανταλένα Στέγκα, Μαρία Στέγκα και Κων/νος Στέγκας μαζί με τη σύζυγό του Λαμπρινή.
            Αρχή της δεκαετίας του 1970 ιδρύεται το Νηπιαγωγείο των Εκπαιδευτηρίων Στέγκα και λειτουργεί σε ανεξάρτητο κτίριο στην οδό Μ.Ασίας 67, στο Κερατσίνι. Επεκτείνεται με επιπλέον εγκαταστάσεις και παίρνει την τελική του μορφή.
            Σήμερα, η  Κατερίνα Στέγκα και ο Δημήτρης Στέγκας, εγγόνια του ιδρυτή του Εκπαιδευτηρίου μας,που έχουν πραγματοποιήσει ειδικευμένες και μεταπτυχιακές σπουδές στην Εκπαίδευση συνεχίζουν την ιστορία του σχολείου μας.
         ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'school');

     Scholio::portalStudy($fake, 'Παιδικός Σταθμός', 'Παιδικός Σταθμός', 'Παιδικός Σταθμός');
     Scholio::portalStudy($fake, 'Νηπιαγωγείο', 'Νήπια', 'Νήπια');
     Scholio::portalStudy($fake, 'Νηπιαγωγείο', 'Προνήπια', 'Προνήπια');

     Scholio::portalStudy($fake, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Γενική Παιδεία', 'Έ Δημοτικού');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γενική Παιδεία', 'Ά Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Β Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Γ Γυμνασίου');
     Scholio::portalStudy($fake, 'Λύκειο', 'Γενική Παιδεία', 'Ά Λυκείου');
     Scholio::portalStudy($fake, 'Λύκειο', 'Γενική Παιδεία', '΄Β Λυκείου');
     Scholio::portalStudy($fake, 'Λύκειο', 'Γενική Παιδεία', '΄Γ Λυκείου');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/EkpaideutiriaStega');






     /*=============== 7  Μπαμπινιώτου-Δουγέκου ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών Μπαμπινιώτου - Δουγέκου', 'email' => 'eldouge@yahoo.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'babiniotouDougekou'])->id,
         'address' => 'Kολοκοτρώνη 64, Πεύκη',
         'city' => 'Αθήνα',
         'phone' => 2108028357,
         'type_id' => 4,
         'website' => 'babiniotou-dougekou.gr',
         'approved' => 1,
         'about' => '
            Πριν απο 40 χρόνια ίδρυσα το Κέντρο Ξένων Γλωσσών Μπαμπινιώτου-Δουγέκου με αγάπη για τις ξένες γλώσσες και επιθυμία να προσφέρω στους μαθητές μου τις γνώσεις που αποκόμισα από τις σπουδές μου αλλά και από τα πολλά εκπαιδευτικά ταξίδια στο εξωτερικό. Σκοπός μου ήταν και παραμένει όχι η στείρα γνώση μιας ξένης γλώσσας αλλά η πραγματική γνώση της και η δυνατότητα επικοινωνίας με ανθρώπους από άλλες χώρες.
            Έχω βοηθήσει πολλούς μαθητές να συνεχίσουν τις σπουδές τους στο εξωτερικό καλύπτοντας άριστα την άρτια γνώση της ξένης γλώσσας που χρειάζονται.
            Τα τελευταία χρόνια στο δυναμικό της διοίκησης και της διδασκαλίας έχουν αναλάβει ενεργό ρόλο η Δήμητρα Δουγέκου (Μεταπτυχιακές Σπουδές στην Αγγλική Λογοτεχνία και Πολιτισμό) και η Ελένη Δουγέκου (Μεταπτυχιακές Σπουδές στην Αγγλική Γλωσσολογία).
            Είμαστε μια μεγάλη ομάδα που διδάσκουμε με αγάπη και οι μαθητές μας αποκτούν τα ανώτατα πτυχία στις ξένες γλώσσες και πετυχαίνουν τους στοχους τους.
            Να είστε βέβαιοι οτι για μία ακόμη χρονιά, με άριστη οργάνωση και μεθοδικότητα στη διδασκαλία θα ανταποκριθούμε στις υψηλές απαιτήσεις σας.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 12, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');



     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/babiniotoudougekou');




     /*=============== 8   Γράψα Παγκράτι ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρα Ευρωπαϊκών Γλωσσών Γράψα Παγκράτι', 'email' => 'info@grapsa.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'grapsa'])->id,
         'address' => 'Υμηττού 102, Παγκράτι',
         'city' => 'Αθήνα',
         'phone' => 2107565300,
         'type_id' => 4,
         'website' => 'grapsa.edu.gr',
         'approved' => 1,
         'about' => '
             Το 1984 ο Εκπαιδευτικός Όμιλος Γράψα, πρωτοπόρος, δημιούργησε την ξενόγλωσση εκπαίδευση με Ευρωπαϊκά standards. Κάθε χρόνο πάνω από 7.000 σπουδαστές μαθαίνουν ξένες γλώσσες κοντά μας, με 1700+ επιτυχόντες στις Εξετάσεις Πτυχίων.
             Με καθηγητές-ελίτ, εκπαιδευμένους στο σύστημα ΓΡΑΨΑ και από το University of Oxford, Department for Continuing Education
             Mε μαθήματα βιωματικά, εμπλουτισμένα (NLP - προσαρμόζονται δηλαδή στα διαφορετικά μαθησιακά στυλ κάθε σπουδαστή: οπτικό-ακουστικό-κιναισθητικό) και διαδραστικά
             Με ευέλικτα ωράρια και 5000(!) κάθε χρόνο, επιπλέον ΔΩΡΕΑΝ ώρες για αναπλήρωση μαθημάτων ή κάλυψη αδυναμιών
             Το υπερσύχρονο κεντρικό εκπαιδευτήριο στο Παγκράτι παρέχει ταχύρυθμα προγράμματα για νέους ενήλικες, στα Αγγλικά, Γαλλικά, Γερμανικά, Ιταλικά και Ισπανικά. Βρίσκεται στην καρδιά του Παγκρατίου, επί της Υμηττού απέναντι από το σινεμά ΠΑΛΑΣ και λίγο πριν τα Village Cinemas. Εξυπηρετεί και τις περιοχές Βύρωνα, Καισαριανή και Υμηττό.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');



       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Omilos.Grapsa');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/Omilos_Grapsa');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/user/OmilosGrapsa');
       Scholio::portalSocial($fake, 'google-plus', 'https://plus.google.com/u/0/108911499374790410960');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/company/2935858/');








     /*=============== 9 Primers ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Primers', 'email' => 'info@primers.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'primers'])->id,
         'address' => 'Παπανικολή 24, Κερατσίνι',
         'city' => 'Αθήνα',
         'phone' => 2104621888,
         'type_id' => 4,
         'website' => 'primers.edu.gr',
         'approved' => 1,
         'about' => '
              τα PRIMERS οι υπηρεσίες και τα προγράμματά μας είναι ειδικά σχεδιασμένα για ενήλικες.
              Η διαδικασία εκμάθησης μιας ξένης γλώσσας  είναι πολύ συγκεκριμένη για έναν εργαζόμενο ή έναν φοιτητή, διαφορετική για έναν άνεργο ή έναν οικογενειάρχη. Οι ακαδημαϊκοί και επαγγελματικοί στόχοι αλλάζουν από σπουδαστή σε σπουδαστή και αυτό είναι ένα ακόμη στοιχείο διαφοροποίησης. Όποια κι αν είναι τα χαρακτηριστικά των σπουδαστών μας, λαμβάνουμε υπόψιν τα ιδιαίτερα αυτά γνωρίσματα και έτσι έχουμε σχεδιάσει προγράμματα που ανταποκρίνονται στις συγκεκριμένες ανάγκες τους.
              Πρωτίστως, οι ώρες των μαθημάτων δεν είναι υπερβολικά πολλές και υπάρχει ευέλικτο ωράριο μέσα στην εβδομάδα με πολλές επιλογές σε ημέρες και ώρες. Ακόμη, δεν υπάρχει υπέρογκο homework- εργασία για το σπίτι, καθώς το μεγαλύτερο μέρος της "δουλειάς" γίνεται στην τάξη. Επιπλέον, τα μαθήματα είναι ειδικά σχεδιασμένα ώστε να ανταποκρίνονται στα διαφορετικά μαθησιακά στυλ των σπουδαστών μας (μάθετε για τα διαφορετικά μαθησιακά στυλ εδώ). Τέλος, τα τμήματα είναι ολιγομελή (αυστηρά 5-10 ατόμων) ώστε να υπάρχει η απαραίτητη προσοχή και φροντίδα από μέρους των καθηγητών προς όλους τους σπουδαστές αλλά ταυτόχρονα να δημιουργείται ένα συνεργατικό κλίμα το οποίο να προάγει το pair work/group work (εργασία σε ζευγάρια και μικρές ομάδες) με αποτέλεσμα να υπάρχει διάδραση και επικοινωνία ανάμεσα στους σπουδαστές και να εξασκούν τις επικοινωνιακές τους δεξιότητες στην ξένη γλώσσα που διδάσκονται.
              Όλα αυτά σχεδιάζονται με βάση και τη χρήση τεχνολογικών μέσων όπως οι διαδραστικοί πίνακες και το Internet το οποίο αξιοποιούμε στο έπακρο ώστε τα μαθήματα να γίνονται ενδιαφέροντα, χρήσιμα και πιο παραγωγικά. Χρησιμοποιούμε videos, podcasts, διάφορα applications και άλλα πολλά τα οποία κινητοποιούν τους σπουδαστές ώστε να μαθαίνουν την γλώσσα ευχάριστα και με εμφανή αποτελέσματα από τα πρώτα μαθήματα, να μπορούν να επικοινωνούν όπως όταν χρησιμοποιούν την μητρική τους και, αφού κατακτήσουν την γνώση της γλώσσας,να μπορούν να αποκτήσουν και την πιστοποίηση που τους ενδιαφέρει.
              Στο δρόμο για την πιστοποίηση, πρώτος στόχος είναι η κατάκτηση της γλώσσας και στη συνέχεια το εκάστοτε "πτυχίο". Αν δεν γνωρίσει κάποιος τη γλώσσα σωστά και σε βάθος, δεν μπορεί να ανταποκριθεί κατάλληλα στις ανάγκες των εξετάσεων πιστοποίησης. Γι\'αυτό το λόγο, φροντίζουμε ο κάθε σπουδαστής να μαθαίνει με τον τρόπο που του ταιριάζει. Ο κάθε σπουδαστής μας είναι μοναδικός και αυτό αποτελεί κίνητρο για την καλύτερη οργάνωση των μαθημάτων με βάση τις διαφορετικές ικανότητες και προσεγγίσεις. Κάποιοι σπουδαστές, μαθησιακά, είναι ακουστικοί τύποι, άλλοι οπτικοί, άλλοι κιναισθητικοί, άλλοι συνδυάζουν ποικίλες δεξιότητες και τρόπους αντίληψης.  Καθώς υπάρχουν διάφορα μαθησιακές προσεγγίσεις, κάνοντας ένα απλό quiz,βλέπουμε πώς μαθαίνει ο κάθε σπουδαστής μας και λαμβάνουμε υπόψιν τους ποικίλους μαθησιακούς τύπους που υπάρχουν στις τάξεις μας για να σχεδιάσουμε ανάλογα τις δραστηριότητες μέσα στα μαθήματα. Σε ότι αφορά τα... "πτυχία" αυτά καθ\'αυτά, η πιστοποίηση είναι και αυτό κάτι ξεχωριστό για τον καθένα. Δεν υποχρεούται κανείς να δώσει εξετάσεις για πιστοποίηση που δεν ταιριάζει στον ίδιο και τον τρόπο που δουλεύει. Υπάρχουν πολλά "πτυχία" στην διάθεση των σπουδαστών και η δουλειά μας είναι να προετοιμαστούν όλοι όσοι το επιθυμούν για τις εξετάσεις της επιλογής τους.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');



     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/primers.edu');





     /*=============== 10 ΣΑΚΚΑ ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες ΣΑΚΚΑ', 'email' => 'sakkaeugenia@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'sakkaEugenia'])->id,
         'address' => 'Λεωφόρος Θηβών 142, Περιστέρι',
         'city' => 'Αθήνα',
         'phone' => 2105759400,
         'type_id' => 4,
         'website' => 'agglika-sakka.gr',
         'approved' => 1,
         'about' => '
             Στο Κέντρο ξένων γλωσσών ΣΑΚΚΑ ΕΥΓΕΝΙΑ είμαστε, πάντα, προσανατολισμένοι στο επιτυχές αποτέλεσμα, ενώ απευθυνόμαστε σε όλες τις ηλικίες, διαθέτοντας τμήματα νηπιακά, αλλά και ενηλίκων. Σεβόμενοι την προσωπικότητα και τις ιδιαίτερες ανάγκες των μαθητών μας, παρέχουμε ολοκληρωμένα προγράμματα σπουδών, με στοχευμένη/εξατομικευμένη διδασκαλία και ειδικά προγράμματα ενίσχυσης των σπουδαστών μας. Με άριστο επιτελείο καθηγητών πανεπιστημιακής εκπαίδευσης, πολύχρονη εμπειρία και τις πλέον σύγχρονες μεθόδους διδασκαλίας, δεσμευόμαστε για την επιτυχή έκβαση των σπουδών σας στις ξένες γλώσσες. Διδάσκουμε αγγλικά, γαλλικά, γερμανικά, ιταλικά με πρωτοποριακές για τα ελληνικά δεδομένα μεθόδους, που εγγυώνται την απόκτηση πτυχίου!
             Στόχος μας, στο κέντρο ξένων γλωσσών ΣΑΚΚΑ ΕΥΓΕΝΙΑ, είναι η επιτυχία σας, που αποτελεί για εμάς τη μεγαλύτερη ανταμοιβή των προσπαθειών μας και την απόλυτη δικαίωση του έργου μας στην ξενόγλωσση εκπαίδευση. Φροντίζουμε διαρκώς για την ενημέρωσή μας για τις νέες μεθόδους διδασκαλίας στο χώρο των ξένων γλωσσών, επιδιώκουμε την άμεση επικοινωνία με τους μαθητές μας, των οποίων τις προσπάθειες στηρίζουμε και διευκολύνουμε.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');





     /*=============== 11  Σταματοπούλου  ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Σταματοπούλου', 'email' => 'info@stamatopoulou.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'stamatopoulou'])->id,
         'address' => 'Αιόλου 25, Π. Φάληρο',
         'city' => 'Αθήνα',
         'phone' => 2109838829,
         'type_id' => 4,
         'website' => 'stamatopoulou.gr',
         'approved' => 1,
         'about' => '
            Το Κέντρο Ξένων Γλωσσών Γ.ΣΤΑΜΑΤΟΠΟΥΛΟΥ ιδρύθηκε το 1953 από μια γυναίκα πρωτοπόρο, με όραμα για την ξενόγλωσση εκπαίδευση στην Ελλάδα, τη Σοφία Σταματοπούλου. Φέρνοντας στην Ελλάδα ‘Αγγλους και Αμερικανούς καθηγητές είχε από την ίδρυση του κέντρου ως προτεραιότητά της την άνετη και σωστή χρήση της γλώσσας από τους μαθητές και την επαφή με τον πολιτισμό των χωρών, αρχή που παραμένει προτεραιότητα πάνω από 50 χρόνια μετά.
            Το κέντρο στεγάστηκε σε διάφορα κτήρια στο Παλαιό Φάληρο, κτήρια που εκατοντάδες Φαληριώτες έχουν συνδυάσει με τη δυναμική παρουσία της Σοφίας Σταματοπούλου ώσπου το 1992, δέκα χρόνια αφ’ ότου η διαχείριση του Κέντρου είχε περάσει πλέον στα χέρια της κόρης της και αποφοίτου της Αγγλικής Φιλολογίας του Πανεπιστημίου Αθηνών, Γεωργίας Σταματοπούλου, μεταφέρθηκε σε υπερσύγχρονο, ιδιόκτητο τριώροφο χώρο στην οδό Αιόλου 25, όπου στεγάζεται έως σήμερα. Ευρύχωρες αίθουσες πλήρως εξοπλισμένες με πολυμέσα, Η/Υ και διαδραστικούς πίνακες αφής, δανειστική βιβλιοθήκη με εκατοντάδες ξενόγλωσσα βιβλία, αίθουσα υπολογιστών για ομαδικές εργασίες και φιλικοί χώροι υποδοχής αποτελούν ένα περιβάλλον ιδανικό για την εκμάθηση μιας γλώσσας.
            Φυσικά, το ισχυρότερο κομμάτι της επιτυχίας του Κέντρου από την ίδρυσή του έως τώρα βρίσκεται στο ανθρώπινο δυναμικό της. Οι καθηγητές και συνεργάτες του Κέντρου επιλέγονται προσεκτικά με γνώμονα τη μόρφωσή τους, την εμπειρία τους αλλά και τη διαρκή τους θέληση για εξέλιξη και επιμόρφωση σε πρωτοποριακές μεθόδους και μέσα διδασκαλίας. Κοινός στόχος όλων είναι η διδασκαλία με κέντρο το μαθητή, η καλλιέργεια ενός πνεύματος συνεργασίας μεταξύ των μαθητών, η περιβαλλοντική και κοινωνική αφύπνιση των παιδιών και η έμφαση στη χρησιμότητα των ξένων γλωσσών στη ζωή των σημερινών παιδιών και μελλοντικών πολιτών του κόσμου.
            Πέρα από τους νεαρούς μαθητές που προετοιμάζονται κυρίως για τις εξετάσεις των πανεπιστημίων Cambridge, Michigan, Lancashire, DELF, Goethe, το Κέντρο αναλαμβάνει την προετοιμασία τελειόφοιτων, οι οποίοι θέλουν να σπουδάσουν στην Ελλάδα -με την προετοιμασία για το Ειδικό Μάθημα Ξένης Γλώσσας- αλλά και στο εξωτερικό με τμήματα για τις εξετάσεις TOEFL, IELTS και TOEIC.
            Τέλος, υπάρχουν τμήματα που απευθύνονται αποκλειστικά σε ενήλικες και επαγγελματίες διαφόρων επιπέδων. Όλα τα τμήματα διδάσκονται από έμπειρους καθηγητές με ποσοστά επιτυχίας στις εξετάσεις που ξεπερνούν το 90%.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Κινέζικα');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Κινέζικα');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');


     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/gstamatopoulouterralinguae');





     /*=============== 12  Κατσέλη  ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Κατσέλη', 'email' => 'info@katseli.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'katseli'])->id,
         'address' => 'Βλαχερνών 25, Παλλήνη',
         'city' => 'Αθήνα',
         'phone' => 2106665891,
         'type_id' => 4,
         'website' => 'katseli.gr',
         'approved' => 1,
         'about' => '
         Τον Σεπτέμβριο του 1989 γεννήθηκε στην Παλλήνη ένας εκπαιδευτικός οργανισμός στην οδό Βλαχερνών 23. Όπως όλοι οι οργανισμοί, έτσι κι αυτός άρχισε σιγά-σιγά να μεγαλώνει, να ωριμάζει και να ομορφαίνει. Το Σεπτέμβριο του 2002 άλλαξε σπίτι, μια και το προηγούμενο δεν τον χώραγε πια, και πήγε σε ένα τριώροφο –ιδιόκτητο κι αυτό– σύγχρονο κτήριο στην οδό Βλαχερνών 25,όπου και ενηλικιώθηκε.
         Σ’ αυτόν τον χώρο εξελίχθηκε σε ένα πρότυπο κέντρο ξένων γλωσσών, συνεχίζοντας να επιτελεί το έργο στο οποίο τάχθηκε από την πρώτη μέρα της γέννησής του: να διδάσκει αγγλικά, γαλλικά, γερμανικά και πλήθος άλλων ξένων γλωσσών σε μαθητές όλων των ηλικιών, να μεταλαμπαδεύει τον πολιτισμό και την κουλτούρα των λαών που μιλούν αυτές τις γλώσσες και, πάνω απ’ όλα, να εμφυσεί την αγάπη για τη γνώση καθώς και να ενθαρρύνει την επικοινωνία με όλους τους λαούς του κόσμου.
         Αποτελεί πλέον ένα σύγχρονο κέντρο ξένων γλωσσών με επίκεντρο την παροχή ολοκληρωμένης ξενόγλωσσης εκπαίδευσης στο μαθητή. Οι διαρκώς εκπαιδευόμενοι καθηγητές -πανεπιστημιακού επιπέδου- του οργανισμού μας εγγυώνται την ποιότητα και την αποτελεσματικότητα των εκπαιδευτικών διαδικασιών που λαμβάνει χώρα στις αίθουσές μας.

           ΛΙΓΑ ΛΟΓΙΑ ΓΙΑ ΤΑ ΚΕΝΤΡΑ ΞΕΝΩΝ ΓΛΩΣΣΩΝ ΚΑΤΣΕΛΗ
           Είναι πλέον γνωστό πως η γνώση γίνεται αναπόσπαστο τμήμα του εγκεφάλου μόνο αν η εκπαιδευτική διεργασία γίνεται μέσα σε συγκεκριμένες συνθήκες:

           Ενα περιβάλλον
           Χαράς
           Εμπιστοσύνης
           Οικειότητας
           Ασφάλειας
           Συνέπειας

           Σε συνδυασμό με
           Πειθαρχία
           Αίσθημα Ευθύνης
           Μεθοδευμένη Προσπάθεια

           Σεβόμαστε το μαθητή, αντιλαμβανόμαστε τη διαφορετικότητα του καθενός και η μάθηση γίνεται ‘δεύτερη φύση’. Μέσα σε αυτό το πλαίσιο οργανώνουμε με κάθε λεπτομέρεια τη δομή των τμημάτων μας και την οικονομική μας πολιτική.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');


     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Πληροφορική', 'Πληροφορική');
     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/KatseliSchool');





     /*=============== 13  ΕΥΡΩΓΝΩΣΗ – EuroLab Γλυφάδα  ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες ΕΥΡΩΓΝΩΣΗ – EuroLab Γλυφάδα', 'email' => 'glyfada@eurognosi.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'eurognosiGlyfada'])->id,
         'address' => 'Λεωφόρος Βουλιαγμένης 142, Γλυφάδα',
         'city' => 'Αθήνα',
         'phone' => 2108980222,
         'type_id' => 4,
         'website' => 'eurognosi.com',
         'approved' => 1,
         'about' => '
                    Στην ΕΥΡΩΓΝΩΣΗ τα παιδιά μαθαίνουν Αγγλικά από πολύ μικρή ηλικία μέσα σε real-life setting περιβάλλον έχοντας μια ολιστική προσέγγιση στην εκμάθηση της γλώσσας.
                    Οι μικροί μας φίλοι απολαμβάνουν μία μαγική διαδρομή μέσα από τις περιπέτειες του Alf, την πρώτη σειρά παιδικών βιβλίων της ΕΥΡΩΓΝΩΣΗ όπου διασκέδαση και μάθηση συνδυάζονται αρμονικά υπό το πρίσμα της πιο σύγχρονης μεθοδολογίας.
                    Οι μαθητές ανακαλύπτουν σταδιακά τις γλωσσικές τους ικανότητες μέσα από μία επιλογή ασκήσεων και δραστηριοτήτων που δίνουν έμφαση στην κριτική σκέψη.

                    Όλα τα παραπάνω επιτυγχάνονται στην ΕΥΡΩΓΝΩΣΗ με την Μέθοδο Learn®.
                    Η Μέθοδος Learn® με την χρήση ειδικών εκπαιδευτικών μέσων όπως διαδραστικοί πίνακες, αποσπάσματα βίντεο/DVD, παιχνίδια, tablets και άλλες δραστηριότητες παρακινεί το σπουδαστή να συμμετέχει στην μάθηση. Η Μέθοδος Learn® προσφέρει:
                    Μεταφορά της ζωντανής πραγματικότητας στην τάξη
                    Εμπλουτισμό του μαθήματος με πολιτιστικά στοιχεία
                    Ζωντανή επαφή με την γλώσσα και την κουλτούρα

                    CLIL
                    Συνοδέψτε τους ήρωες της ΕΥΡΩΓΝΩΣΗ  στο συναρπαστικό ταξίδι της μάθησης μέσω της προσέγγισης CLIL-Content and Language Integrated Learning που δίνει τη δυνατότητα στους μαθητές να ανακαλύπτουν και να επεξεργάζονται θεματικές ενότητες διαπολιτισμικού περιεχομένου χρησιμοποιώντας την Αγγλική γλώσσα ως εργαλείο.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 15, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'BEC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'MSU');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GRE');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'PTE');

     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Eurognosi.EuroLab.Glyfadas');



     /*=============== 14 ΕΥΡΩΓΝΩΣΗ Αιγάλεω ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες ΕΥΡΩΓΝΩΣΗ Αιγάλεω', 'email' => 'aigaleocenter@eurognosi.info', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'eurognosiAigaleocenter'])->id,
         'address' => 'Γρηγορίου Κυδωνιών 5, Αιγάλεω',
         'city' => 'Αθήνα',
         'phone' => 2105914001,
         'type_id' => 4,
         'website' => 'eurognosi.com',
         'approved' => 1,
         'about' => '
                    Στην ΕΥΡΩΓΝΩΣΗ τα παιδιά μαθαίνουν Αγγλικά από πολύ μικρή ηλικία μέσα σε real-life setting περιβάλλον έχοντας μια ολιστική προσέγγιση στην εκμάθηση της γλώσσας.
                    Οι μικροί μας φίλοι απολαμβάνουν μία μαγική διαδρομή μέσα από τις περιπέτειες του Alf, την πρώτη σειρά παιδικών βιβλίων της ΕΥΡΩΓΝΩΣΗ όπου διασκέδαση και μάθηση συνδυάζονται αρμονικά υπό το πρίσμα της πιο σύγχρονης μεθοδολογίας.
                    Οι μαθητές ανακαλύπτουν σταδιακά τις γλωσσικές τους ικανότητες μέσα από μία επιλογή ασκήσεων και δραστηριοτήτων που δίνουν έμφαση στην κριτική σκέψη.

                    Όλα τα παραπάνω επιτυγχάνονται στην ΕΥΡΩΓΝΩΣΗ με την Μέθοδο Learn®.
                    Η Μέθοδος Learn® με την χρήση ειδικών εκπαιδευτικών μέσων όπως διαδραστικοί πίνακες, αποσπάσματα βίντεο/DVD, παιχνίδια, tablets και άλλες δραστηριότητες παρακινεί το σπουδαστή να συμμετέχει στην μάθηση. Η Μέθοδος Learn® προσφέρει:
                    Μεταφορά της ζωντανής πραγματικότητας στην τάξη
                    Εμπλουτισμό του μαθήματος με πολιτιστικά στοιχεία
                    Ζωντανή επαφή με την γλώσσα και την κουλτούρα

                    CLIL
                    Συνοδέψτε τους ήρωες της ΕΥΡΩΓΝΩΣΗ  στο συναρπαστικό ταξίδι της μάθησης μέσω της προσέγγισης CLIL-Content and Language Integrated Learning που δίνει τη δυνατότητα στους μαθητές να ανακαλύπτουν και να επεξεργάζονται θεματικές ενότητες διαπολιτισμικού περιεχομένου χρησιμοποιώντας την Αγγλική γλώσσα ως εργαλείο.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 13, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'BEC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'MSU');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GRE');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'PTE');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'LEGO Education');

     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/aigaleocenterEU');



     /*=============== 15 ΕΥΡΩΓΝΩΣΗ Αχαρναί ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες ΕΥΡΩΓΝΩΣΗ Αχαρναί', 'email' => 'acharnai@eurognosi.info', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'eurognosiAcharnai'])->id,
         'address' => 'Παύλου Μελά 22, Αχαρναί',
         'city' => 'Αθήνα',
         'phone' => 2102402001,
         'type_id' => 4,
         'website' => 'eurognosi.com',
         'approved' => 1,
         'about' => '
                    Στην ΕΥΡΩΓΝΩΣΗ τα παιδιά μαθαίνουν Αγγλικά από πολύ μικρή ηλικία μέσα σε real-life setting περιβάλλον έχοντας μια ολιστική προσέγγιση στην εκμάθηση της γλώσσας.
                    Οι μικροί μας φίλοι απολαμβάνουν μία μαγική διαδρομή μέσα από τις περιπέτειες του Alf, την πρώτη σειρά παιδικών βιβλίων της ΕΥΡΩΓΝΩΣΗ όπου διασκέδαση και μάθηση συνδυάζονται αρμονικά υπό το πρίσμα της πιο σύγχρονης μεθοδολογίας.
                    Οι μαθητές ανακαλύπτουν σταδιακά τις γλωσσικές τους ικανότητες μέσα από μία επιλογή ασκήσεων και δραστηριοτήτων που δίνουν έμφαση στην κριτική σκέψη.

                    Όλα τα παραπάνω επιτυγχάνονται στην ΕΥΡΩΓΝΩΣΗ με την Μέθοδο Learn®.
                    Η Μέθοδος Learn® με την χρήση ειδικών εκπαιδευτικών μέσων όπως διαδραστικοί πίνακες, αποσπάσματα βίντεο/DVD, παιχνίδια, tablets και άλλες δραστηριότητες παρακινεί το σπουδαστή να συμμετέχει στην μάθηση. Η Μέθοδος Learn® προσφέρει:
                    Μεταφορά της ζωντανής πραγματικότητας στην τάξη
                    Εμπλουτισμό του μαθήματος με πολιτιστικά στοιχεία
                    Ζωντανή επαφή με την γλώσσα και την κουλτούρα

                    CLIL
                    Συνοδέψτε τους ήρωες της ΕΥΡΩΓΝΩΣΗ  στο συναρπαστικό ταξίδι της μάθησης μέσω της προσέγγισης CLIL-Content and Language Integrated Learning που δίνει τη δυνατότητα στους μαθητές να ανακαλύπτουν και να επεξεργάζονται θεματικές ενότητες διαπολιτισμικού περιεχομένου χρησιμοποιώντας την Αγγλική γλώσσα ως εργαλείο.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 8, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'BEC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'MSU');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GRE');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'PTE');

     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'LEGO Education');

     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/eurognosiAcharnai');



     /*=============== 16 ΕΥΡΩΓΝΩΣΗ EuroLab Γέρακας ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες ΕΥΡΩΓΝΩΣΗ - EuroLab Γέρακας', 'email' => 'gerakas@eurognosi.info', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'eurognosiGerakas'])->id,
         'address' => 'Θεσσαλονίκης 1, Γέρακας',
         'city' => 'Αθήνα',
         'phone' => 2106046880,
         'type_id' => 4,
         'website' => 'eurognosi.com',
         'approved' => 1,
         'about' => '
                    Στην ΕΥΡΩΓΝΩΣΗ τα παιδιά μαθαίνουν Αγγλικά από πολύ μικρή ηλικία μέσα σε real-life setting περιβάλλον έχοντας μια ολιστική προσέγγιση στην εκμάθηση της γλώσσας.
                    Οι μικροί μας φίλοι απολαμβάνουν μία μαγική διαδρομή μέσα από τις περιπέτειες του Alf, την πρώτη σειρά παιδικών βιβλίων της ΕΥΡΩΓΝΩΣΗ όπου διασκέδαση και μάθηση συνδυάζονται αρμονικά υπό το πρίσμα της πιο σύγχρονης μεθοδολογίας.
                    Οι μαθητές ανακαλύπτουν σταδιακά τις γλωσσικές τους ικανότητες μέσα από μία επιλογή ασκήσεων και δραστηριοτήτων που δίνουν έμφαση στην κριτική σκέψη.

                    Όλα τα παραπάνω επιτυγχάνονται στην ΕΥΡΩΓΝΩΣΗ με την Μέθοδο Learn®.
                    Η Μέθοδος Learn® με την χρήση ειδικών εκπαιδευτικών μέσων όπως διαδραστικοί πίνακες, αποσπάσματα βίντεο/DVD, παιχνίδια, tablets και άλλες δραστηριότητες παρακινεί το σπουδαστή να συμμετέχει στην μάθηση. Η Μέθοδος Learn® προσφέρει:
                    Μεταφορά της ζωντανής πραγματικότητας στην τάξη
                    Εμπλουτισμό του μαθήματος με πολιτιστικά στοιχεία
                    Ζωντανή επαφή με την γλώσσα και την κουλτούρα

                    CLIL
                    Συνοδέψτε τους ήρωες της ΕΥΡΩΓΝΩΣΗ  στο συναρπαστικό ταξίδι της μάθησης μέσω της προσέγγισης CLIL-Content and Language Integrated Learning που δίνει τη δυνατότητα στους μαθητές να ανακαλύπτουν και να επεξεργάζονται θεματικές ενότητες διαπολιτισμικού περιεχομένου χρησιμοποιώντας την Αγγλική γλώσσα ως εργαλείο.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'BEC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'MSU');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GRE');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'PTE');

     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'LEGO Education');

     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/eurognosieurolabgeraka');







     /*=============== 17 Sage ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Sage', 'email' => 'info@sage-lc.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'sage'])->id,
         'address' => 'Λαμπράκη Γρηγορίου 2, Άνω Λιόσια',
         'city' => 'Αθήνα',
         'phone' => 2102484463,
         'type_id' => 4,
         'website' => 'sage-lc.com',
         'approved' => 1,
         'about' => '
              Το SAGE Learning Centre έχει σκοπό να παρέχει πλήρης και εμπλουτισμένα προγράμματα διδασκαλίας της Αγγλικής γλώσσας με τη χρήση πολλαπλών εκπαιδευτικών υλικών όπως την διαδραστική εκμάθηση με ολοκληρωμένα προγράμματα ηλεκτρονικών υπολογιστών και οπτικοακουστικών μέσων για την ποιοτική και ομαλή διαδικασία της εκπαίδευσης.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');


     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/sagelc');



     /*=============== 18 Teachers ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Teachers', 'email' => 'teachers.pefki@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'teachersPefki'])->id,
         'address' => 'Λεωφ. Ειρήνης 20, Πεύκη',
         'city' => 'Αθήνα',
         'phone' => 2106127068,
         'type_id' => 4,
         'website' => 'eqteachers.gr',
         'approved' => 1,
         'about' => '
            Είμαστε διαφορετικοί.
            Το ίδιο και οι σπουδαστές μας.
            Think outside the box.
            Εκπαιδεύουμε τους αυριανούς ηγέτες. Αυτούς που θέλουν να ξεχωρίσουν, που τους αρέσει να σκέφτονται “έξω από το κουτί”. Αυτούς που “ηγούνται” ό,τι κι αν κάνουν, που χαράζουν νέους δρόμους, που δημιουργούν.
            Τους μαθαίνουμε στην πράξη τι σημαίνει κίνητρο, συνεργασία, συναίνεση, αποτέλεσμα, παράδειγμα, λάθος, δημιουργία, επιτυχία. Και πάνω απ’ όλα, τους μαθαίνουμε την αξία της διαφορετικότητας. Τους ενθαρρύνουμε να σκέφτονται και να λειτουργούν διαφορετικά. Ο καθένας με τον δικό του τρόπο. Γιατί η διαφορετικότητα είναι το χαρακτηριστικό γνώρισμα του ηγέτη. Είναι αυτή που θα τους οδηγήσει στην επιτυχία.
            Δεν έχουμε στόχο να βαθμολογούμε τους σπουδαστές μας, αλλά να καλλιεργούμε το μυαλό τους. Τους μαθαίνουμε τον τρόπο να μαθαίνουν, κι αυτό γίνεται μόνο με επιμονή, υπομονή κι αγάπη !
            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/teachers.pefki');



     /*=============== 19 My Team ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες My Team', 'email' => 'karakosta67@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'karakosta'])->id,
         'address' => 'Ισοκράτους 4 Άνω Λιόσια',
         'city' => 'Αθήνα',
         'phone' => 2114108390,
         'type_id' => 4,
         'website' => 'my-team-k-x-g-karakosta-rania.webnode.gr',
         'approved' => 1,
         'about' => '
             Στο Κ.Ξ.Γ   My Team  προσφέρουμε ένα ευρύ φάσμα προγραμμάτων εκμάθησης Αγγλικών - Ισπανικών - Γαλλικών και Γερμανικών.
             Ενθαρρύνουμε τα πρώτα βήματα και την προσπάθεια των μαθητών αναπτύσσοντας τη δίγλωσση ικανότητα επικοινωνίας με πλούσια εικονογραφημένα βιβλία, ασκήσεις δεξιότητας, κατασκευές, σκέτς , τραγούδι ζωγραφική και computers , διαδραστικά τετράδια και διαδραστικοί πίνακες.
             Σε \'oλα τα επίπεδα παρέχονται ενισχυτικές ώρες διδασκαλίες δωρεάν στους αδύναμους μαθητές.
             Σε ΟΛΑ τα επίπεδα Κάθε 4 εβδομάδες (μηνιαία tests) - Κάθε 10 εβδομάδες ( tests περιόδου) Γενικές γραπτές εξετάσεις τον Δεκέμβριο  και συνέντευξη με κάθε σπουδαστή έτσι ώστε οι υποψήφιοι να επιλέξουν να δώσουν εξετάσεις για το πιστοποιητικό ή τα πιστοποιητικά που τους ταιριάζουν. Έλεγχος Προόδου: Συνεχής ενημέρωση των γονέων ή ενήλικων μαθητών τηλεφωνικά και προσωπικά για τυχόν προβλήματα.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 8, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');



       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/myteamkarakosta');





     /*=============== 20 Βερουδάκης ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => ' Κέντρο Ξένων Γλωσσών Βερουδάκης', 'email' => 'veroudakis@yahoo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'veroudakis'])->id,
         'address' => 'Κεδρηνού 27, Αμπελόκηποι',
         'city' => 'Αθήνα',
         'phone' => 2106455265,
         'type_id' => 4,
         'website' => 'veroudakis.gr',
         'approved' => 1,
         'about' => '
             Μαθαίνουμε ζώντας!
             Ένα μικρό παιδί πρώτα μαθαίνει λέξεις και φράσεις της καθημερινότητας και μετά γραμματική. Καταγράφει σκηνές ζωής και τις συνδέει με τις ανάλογες προτάσεις, οι οποίες εντυπώνονται μόνιμα και ανασύρονται αυτόματα από τη μνήμη κάθε φορά που πρέπει να χρησιμοποιηθούν. Η γλώσσα είναι ένα βιωματικό εργαλείο και έτσι πρέπει να διδάσκεται. Η γραμματική και οι κανόνες της σύνταξης είναι ύλη για αργότερα, όταν πια ο μαθητής θα έχει μάθει να μιλάει Αγγλικά, όπως μαθαίνει ένα παιδί που ζει στην Αγγλία.
             Ο ίδιος κανόνας, με ελαφρές παραλλαγές, ισχύει και για έναν ενήλικα. Η δυσκολία που έχουν στην ομιλία όσοι προσπαθούν να μάθουν Αγγλικά ως ενήλικες είναι επειδή πρώτα σκέφτονται τη φράση στα Ελληνικά, προσπαθούν να την μεταφράσουν, χρησιμοποιώντας κανόνες γραμματικής, και μετά την εκφωνούν. Μολονότι ο ενήλικας ξέρει τη χρήση των μερών του λόγου, κι αυτός ο τρόπος είναι λάθος.
             Στο Κέντρο Ξένων Γλωσσών ΒΕΡΟΥΔΑΚΗΣ, οι μαθητές «ζουν» στην Αγγλία.
             Με τη χρήση προηγμένων οπτικοακουστικών μέσων, και την πλήρη αξιοποίηση της πληροφορικής και του διαδικτύου, αποκτούν την εμπειρία τη γλώσσας και όχι μόνο τη γνώση της. Έτσι η γλώσσα χτίζεται πάνω σε σωστές βάσεις χωρίς λάθη και κάθε νέα προσθήκη λεξιλογίου, εκφράσεων, ορολογίας, αγγλισμών, κ.λπ. εμπλουτίζει το γλωσσικό οπλοστάσιο του μαθητή, σε όποια ηλικία κι αν βρίσκεται.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');



     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Πληροφορική', 'IT Skills');
     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Veroudakis-Language-School-Cambridge-Computer-Centre-153369927756/');






     /*=============== 21 Παπαστεργίου ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Παπαστεργίου', 'email' => 'centruro@yahoo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'papastergiou'])->id,
         'address' => 'Κανιγγος 8',
         'city' => 'Αθήνα',
         'phone' => 2103838734,
         'type_id' => 4,
         'website' => 'papastergiouro.gr',
         'approved' => 1,
         'about' => '
             Το Κέντρο Ξένων Γλωσσών Παπαστεργίου ξεκίνησε το 1984 ως Φροντιστήριο Ρουμανικών προσφέροντας προγράμματα προετοιμασίας για την εισαγωγή των Ελλήνων υποψηφίων αποκλειστικά στα πανεπιστήμια της Ρουμανίας. Από το 1994, τα ρουμάνικα πανεπιστήμια δημιούργησαν και τμήματα στην αγγλική γλώσσα, και το Κέντρο ξεκίνησε ανάλογα προγράμματα προετοιμασίας για σπουδές στην αγγλική γλώσσα. Μετά από 35 χρόνια συνεχούς και επιτυχούς παρουσίας, αποκλειστικά στην χώρο της ανώτατης εκπαίδευσης της Ρουμανίας, αποκτήσαμε όχι μόνο πολύτιμη πείρα αλλά και στενές συνεργασίες και επαφές με όλα τα πανεπιστήμια και όλους τους εκπαιδευτικούς φορείς της χώρας, και εξασφαλίζουμε εξαιρετικές επιδόσεις στον τομέα της προετοιμασίας και εισαγωγής στα ρουμάνικα πανεπιστήμια.
             Τα προγράμματά μας απευθύνονται σε υποψήφιους φοιτητές των Πανεπιστημίων της Ρουμανίας, σε επιχειρηματίες, και σε όσους ενδιαφέρονται για την γλώσσα και τον πολιτισμό της Ρουμανίας.
             Η διάρκεια εκμάθησης της γλώσσας ποικίλλει. Το κανονικό πρόγραμμα αρχίζει τον Οκτώβριο και τελειώνει τον επόμενο Σεπτέμβριο. -Υπάρχουν όμως και τμήματα μικρότερης ή μεγαλύτερης διάρκειας.
             Τα τμήματα περιλαμβάνουν 5 έως 10 άτομα.
             Για όσους επιθυμούν, γίνονται και ιδιαίτερα μαθήματα.
             Τα μαθήματα διεξάγονται πρωινές ή απογευματινές ώρες.
             Οι μέθοδοι διδασκαλίας είναι γρήγορες, αποτελεσματικές και εγκεκριμένες από πανεπιστημιακά ιδρύματα της Ρουμανίας.
             Τα τμήματα για τους επιχειρηματίες ή για τα παιδιά, περιλαμβάνουν το πολύ 4 άτομα.
             Οι καθηγητές έχουν πανεπιστημιακή κατάρτιση και μακρόχρονη εμπειρία.
             Το φροντιστήριο αναλαμβάνει όλες τις απαραίτητες διαδικασίες που σχετίζονται με την εγγραφή στα Πανεπιστήμια.
             Όλοι οι υποψήφιοι φοιτητές συνοδεύονται για τις εξετάσεις γλώσσας και για την διεκπεραιώσει των αναγκαίων διατυπώσεων.
             Τα απαραίτητα βιβλία προμηθεύονται από τη Ρουμανία, μέσω του φροντιστηρίου και από τις εκδόσεις Ι. Παπαστεργίου.
             Όσοι ολοκληρώνουν την προετοιμασία, μπορούν να αποκτήσουν βεβαίωση PALSO έπειτα από εξετάσεις οι οποίες διεξάγονται τέλος Ιουλίου
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρουμάνικα');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ελληνικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρουμάνικα');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ελληνικά');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/%CE%9A%CE%AD%CE%BD%CF%84%CF%81%CE%BF-%CE%9E%CE%AD%CE%BD%CF%89%CE%BD-%CE%93%CE%BB%CF%89%CF%83%CF%83%CF%8E%CE%BD-%CE%A0%CE%B1%CF%80%CE%B1%CF%83%CF%84%CE%B5%CF%81%CE%B3%CE%AF%CE%BF%CF%85-Centrul-de-limbi-str%C4%83ine-Papastergiou-110370332377851/');



     /*=============== 22 Rethink ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Rethink', 'email' => 'info@rethinkedu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'rethinkEdu'])->id,
         'address' => 'Γρηγορίου Λαμπράκη 10, Γλυφάδα',
         'city' => 'Αθήνα',
         'phone' => 2108941481,
         'type_id' => 4,
         'website' => 'rethinkedu.gr',
         'approved' => 1,
         'about' => '
             H Rethink Education δραστηριοποιείται στο χώρο της Ξενόγλωσσης Εκπαίδευσης και Δια Βίου Μάθησης, παρέχοντας υψηλού επιπέδου υπηρεσίες εκπαίδευσης και κορυφαία ποιότητα διδασκαλίας.
             Με έτος ίδρυσης το 2016, αλλά με πάνω από 15 χρόνια εμπειρίας στο χώρο της ξενόγλωσσης εκπαίδευσης, το ακαδημαϊκό προσωπικό της Rethink Education συγκεντρώνει εμπειρία, γνώση, νέες ιδέες και πρωτοποριακές μεθόδους εκπαίδευσης, όλες με έναν κοινό στόχο: Την προσωπική και ακαδημαϊκή επιτυχία των σπουδαστών μας κάθε ηλικίας.
             Στο Κέντρο Ξένων Γλωσσών Rethink Education:
             Εστιάζουμε στη μοναδικότητα του κάθε μαθητή και ο τρόπος διδασκαλίας μας καλύπτει τις ανάγκες όλων των μαθησιακών τύπων (κιναισθητικούς, ακουστικούς, οπτικούς, λεκτικούς)
             Οι αίθουσες μας είναι άνετες με φυσικό φωτισμό και αερισμό και είναι διαμορφωμένες ανάλογα με την ηλικιακή ομάδα που φιλοξενούν, προσφέροντας έτσι ένα χαρούμενο και ασφαλές περιβάλλον που ευνοεί τη μάθηση
             Παράλληλα με την εκμάθηση της ξένης γλώσσας οι μαθητές  έχουν την ευκαιρία να διευρύνουν το γνωστικό τους πεδίο και να αναπτύξουν δεξιότητες όπως η επικοινωνία, η επίλυση προβλημάτων, η συνεργασία, η δημιουργική και κριτική σκέψη
             Τα τμήματα μας είναι ολιγομελή (έως 10 μαθητές) ώστε να δίνονται στα παιδιά όσο το δυνατόν περισσότερες ευκαιρίες να συμμετέχουν ενεργά στο μάθημα
             Το διδακτικό προσωπικό διαθέτει μεγάλη εμπειρία στην ξενόγλωσση εκπαίδευση όλων των ηλικιών
            ',
         'background' => $background,
     ]);

     new Portal($fake, 12, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ελληνικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ελληνικά');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'LEGO Education');

     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/RethinkEduGR');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/RethinkEduGR');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/company/rethinkedugr/');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/RethinkEduGR');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UC2NuI5JQREyO5PU87bBB6Ig');



     /*=============== 23 Γούλης ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ιταλικής Γλώσσας Γούλης', 'email' => 'goulispit@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'goulis'])->id,
         'address' => 'Λεωφ. Ποσειδώνος 71, Γλυφάδα',
         'city' => 'Αθήνα',
         'phone' => 2130314383,
         'type_id' => 4,
         'website' => 'italikagoulis.gr',
         'approved' => 1,
         'about' => '
             Ολιγομελή τμήματα για ενήλικες και παιδιά.
             Διδακτικό υλικό (έντυπα του κέντρου – οπτικοακουστικό υλικό) και μέθοδος διδασκαλίας που οδηγεί στην κατανόηση και στην σταδιακή αφομοίωση της γλώσσας σε κάθε επίπεδο, ιδιαίτερα προσιτή σε ενήλικες που έχουν ξεχάσει γραμματικές και συντακτικές δομές.
             Ιδιαίτερα μαθήματα προσαρμοσμένα στις απαιτήσεις, το χρόνο, τις γνώσεις αλλά και τις ικανότητες του σπουδαστή.
             Καθοδήγηση του σπουδαστή πάνω  στον τρόπο μελέτης και ταξινόμησης του διδακτικού του υλικού σε όλη τη διάρκεια των μαθημάτων.
             Προετοιμασία για τα πτυχία :
              * CELI του πανεπιστημίου της PERUGIA
              * DIPLOMA του Ιταλικού Ινστιτούτου
              * STATALE (κρατικό πτυχίο γλωσσομάθειας)
             Προετοιμασία στο ειδικό μάθημα της ιταλικής γλώσσας για τη σχολή της ΙΤΑΛΙΚΗΣ ΦΙΛΟΛΟΓΙΑΣ μέσω πανελληνίων εξετάσεων.
             Δυνατότητα μαθημάτων εξ αποστάσεως μέσω υπολογιστή.
             Προετοιμασία για σπουδές στα Ιταλικά πανεπιστήμια.
             Σπουδάστε Ιατρική, Οδοντιατρική, Φαρμακευτική, Νομική, Αρχιτεκτονική, Πολυτεχνείο με πλήρη αναγνώριση στην Ελλάδα.
             Ενημερωθείτε για τις σπουδές στην Ιταλία (κόστος – διάρκεια –  αναγνώριση κ.λπ.) καθώς και για τις σχολές που δεν διεξάγουν εισαγωγικές εξετάσεις.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');






     /*=============== 24 Κοζατζανίδη ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Γερμανικής Γλώσσας Κοζατζανίδη', 'email' => 'info@germanika-peristeri.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'kozatzanidi'])->id,
         'address' => 'Σοφοκλή Βενιζέλου 14, Περιστέρι',
         'city' => 'Αθήνα',
         'phone' => 2105725710,
         'type_id' => 4,
         'website' => 'germanika-peristeri.edu.gr',
         'approved' => 1,
         'about' => '
              Θεωρώντας πως η εκμάθηση μιας ξένης γλώσσας δεν πρέπει να αναλώνεται μόνο στην απόκτηση ενός πτυχίου, βοηθάμε τους σπουδαστές μας να αποκτήσουν μεγαλύτερο κίνητρο και ενδιαφέρον για το μάθημα, έτσι ώστε ολοκληρώνοντας τη φοίτησή τους σε εμάς να κατέχουν άψογα τη γλώσσα. Σε αυτό συμβάλλουν και οι σύγχρονα εξοπλισμένες αίθουσές μας με προτζέκτορες και οπτικοακουστικά μέσα.
              Με γνώμονα τις διαφορετικές ανάγκες παιδιών και ενηλίκων δημιουργούμε διαφορετικά προγράμματα σπουδών ανάλογα με την ηλικία και το επίπεδο των μαθητών μας. Έτσι, εκτός από ολιγομελή, εξασφαλίζουμε και απολύτως ομοιογενή τμήματα, τα οποία διευκολύνουν τη γρήγορη και αποτελεσματική εκμάθηση της γλώσσας. Τέλος, η διαρκής ενημέρωσή μας για τις νέες εξελίξεις στη διδασκαλία της γερμανικής και για πολιτιστικές εκδηλώσεις απ\' όλους τους τομείς, που διευρύνουν τους ορίζοντες μικρών και μεγάλων, το ζεστό και φιλικό κλίμα του Κέντρου μας, το ενδιαφέρον για κάθε μαθητή ξεχωριστά, καθώς και τα προσιτά δίδακτρά μας και οι δωρεάν παροχές μας, συνιστούν επιπλέον λόγους για να μας γνωρίσετε και να μας εμπιστευθείτε!
              Όλο το χρόνο παρέχουμε τμήματα γερμανικών για ενήλιες, εφήβους και παιδιά!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio');


     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/kentro.germanikis.glwssas/');


    }



}
