<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria12 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;




        /*=============== 1 logos ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Γερμανικής Γλώσσας Logos', 'email' => 'info@logos.com.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'logos'])->id,
            'address' => 'Αγίας Θεοδώρας 6',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310253000,
            'type_id' => 4,
            'website' => 'logos.com.gr',
            'approved' => 1,
            'about' => '
                Μέθοδος Logos

                Ο καλύτερος τρόπος να μάθει κανείς μια γλώσσα είναι να τη μιλήσει

                Γι΄ αυτόν ακριβώς το λόγο χρειάζονται πολλά και διάφορα εναύσματα. Αυτά δίνονται από κείμενα, φωτογραφίες, σκίτσα, βίντεο, τραγούδια και εφαρμόζονται σε συζητήσεις, διαλόγους, παιχνίδι ρόλων, εισηγήσεις κτλ.

                Γλωσσοδιδακτική μέθοδος
                Για να πετύχουμε τα καλύτερα αποτελέσματα εφαρμόζουμε ένα μίγμα γλωσσοδιδακτικών προσεγγίσεων. Τη βάση αποτελεί η επικοινωνιακή μέθοδος, όπου η δομή της γλώσσας ενώνεται με τη χρήση της. Ο μαθητής μαθαίνει για παράδειγμα πώς να διατυπώνει μια προτροπή χρησιμοποιώντας διάφορες δομές και λαμβάνοντας υπόψη του εξωγλωσσικές συνθήκες όπως την περίσταση ή τον ρόλο των ομιλούντων.

                Δύο καθηγητές, περισσότερες εναλλαγές
                Σε κάθε τμήμα υπάρχουν κατά κανόνα δύο καθηγητές. Οι μαθητές έρχονται σε επαφή με δύο προσωπικότητες, ακούν δύο φωνές και πιθανώς διαφορετικούς τρόπους χρήσης της γλώσσας.

                Μετάδοση λεξιλογίου στα γερμανικά, γραμματική = έκφραση
                Ιδιαίτερα στη μέση βαθμίδα η χρήση της μητρικής μειώνεται δραστικά και η ερμηνεία του λεξιλογίου γίνεται στα γερμανικά. Η μετάδοση της γραμματικής γίνεται με ασκήσεις που συνδυάζουν πολλά φαινόμενα και εισάγουν σταδιακά νέα. Αντιλαμβανόμαστε τη γραμματική ως μέσο έκφρασης κι όχι ως ένα σύστημα κανόνων που οφείλει ο μαθητής να αποστηθίσει.

                Τακτικά τεστ δείχνουν την πρόοδο του μαθητή
                Τακτικά (προαιρετικά) τεστ δείχνουν κατά πόσο έχει εμπεδωθεί η διδαχθείσα ύλη και σε ποιους τομείς πρέπει να ενταθεί η προσπάθεια που γίνεται. Κενά ή δυσκολίες εντοπίζονται νωρίς και οι καθηγητές του τμήματος προτείνουν λύσεις.

                Όχι μόνο γλωσσικές γνώσεις αλλά και πολιτισμικές
                Ζητούμενο είναι να γνωρίσει κανείς τη γερμανική κουλτούρα και νοοτροπία κι όχι μόνο να μάθει τη γλώσσα.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 13, 'frontistirio');


        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/logos.germanika');




        /*=============== 2 Υδρόγειος ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρα Ξένων Γλώσσων Υδρόγειος', 'email' => 'central@idrogios.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'idrogios'])->id,
            'address' => 'Παπαναστασίου 150',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310328797,
            'type_id' => 4,
            'website' => 'idrogios.com',
            'approved' => 1,
            'about' => '
Συνδυάστε τα Αγγλικά και τη Ρομποτική σε προνομιακή τιμή!!
Αρχίστε σωστά! Pre-Junior & A Junior Τάξεις Αγγλικών και Εκπαιδευτική Ρομποτική
Δώστε στο παιδί σας την δυνατότητα παρακολούθησης των δύο πιο σύγχρονων εκπαιδευτικών παιδικών προγραμμάτων, Pre-Junior ή A Junior Αγγλικών και Εκπαιδευτικής Ρομποτικής και επωφεληθείτε από την νέα μας προσφορά συνδυάζοντας τα δύο προγράμματα σε προνομιακή τιμή!! Για πληροφορίες καθημερινά Παπαναστασίου 150 (10:00 - 21:00).
Tμήματα Junior Αγγλικών και Εκπαιδευτικής Ρομποτικής
O στόχος των τμημάτων Junior είναι διπλός: Πρωταρχικά επιδιώκεται η εξοικείωση των νεαρών μαθητών και μαθητριών με την Αγγλική Γλώσσα και δευτερευόντως, καλλιεργείται θετική ψυχολογία έτσι ώστε οι μικροί μαθητές να αντιμετωπίσουν τη μάθηση ως κάτι που θέλουν και τους αρέσει. Το επίπεδο Pre-Junior διαρκεί μία σχολική χρονιά και η συχνότητα των μαθημάτων είναι μία φορά την εβδομάδα. Της A-Junior είναι μια σχολική χρονιά με δύο φορές την εβδομάδα.
Επιπλέον, δώστε στα παιδιά σας τη δυνατότητα να απασχοληθούν δημιουργικά μέσω των ειδικών τμημάτων εκπαιδευτικής ρομποτικής και δημιουργικής απασχόλησης με STEAM (Science, Technology, Engineering, Arts & Mathematics). Γρανάζια, έξυπνες κατασκευές, μηχανική, προγραμματισμός συσκευών, κέφι και πολύ παιχνίδι συνθέτουν τα προγράμματα εκπαιδευτικής ρομποτικής στην Υδρόγειο που αποτελεί την πρώτη και πιο άρτια σχολή εκπαιδευτικής ρομποτικής στην Ελλάδα.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');



        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'LEGO Education');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Adobe Photoshop');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'AutoCAD');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Android');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Web Development');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/idrogios');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/idrogios.education/');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCpMYCcBRkBGuC8yYUmggH7w');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/idrogiosit');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/company/idrogiosit/');




        /*=============== 3 YES ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'English Language Center Yes!', 'email' => 'info@yes.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'yes'])->id,
            'address' => 'Μπιζανίου 3, Πυλαία',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310331160,
            'type_id' => 4,
            'website' => 'yes.edu.gr',
            'approved' => 1,
            'about' => '
            Φιλοσοφία
               Kάθε μαθητής πρέπει να έχει την ευκαιρία να αξιοποιήσει τις δυνατότητές του στο έπακρο, σε ένα ιδανικό εκπαιδευτικό περιβάλλον.
               Το σχολείο πρέπει να εκσυγχρονίζεται, να παρακολουθεί στενά τις εξελίξεις στη διδακτική μεθοδολογία και να χρησιμοποιεί πληθώρα μέσων για την πρόσβαση των μαθητών στη γνώση.
               Η μάθηση συμβαίνει μέσω συνεργασίας σε ομάδες δουλεύοντας για στόχους που συντονίζει ένας έμπειρος δάσκαλος υπό την επίβλεψη του διευθυντή σπουδών.
               Το πρόγραμμα του σχολείου πρέπει να στηρίζεται σε έναν συνδυασμό των αποτελεσματικότερων μεθόδων διδασκαλίας, λαμβάνοντας υπόψη τον μαθησιακό τύπο του κάθε μαθητή.
               Το σχολείο πρέπει να προετοιμάζει τον μαθητή να χρησιμοποιήσει την γλώσσα σωστά και με ευχέρεια, βοηθώντας τον ταυτόχρονα να αναπτύξει τις δεξιότητες του 21ου αιώνα – κριτική σκέψη, συνεργασία, ομαδικό πνεύμα, δημιουργικότητα και φαντασία – έτσι ώστε να μπορέσει να σταθεί με επιτυχία στο διεθνές περιβάλλον.
               Η πειθαρχία, η σωστή αξιολόγηση και η ενθάρρυνση για επίτευξη υψηλών στόχων κάνουν το μαθητή να είναι περήφανος για τον εαυτό του και να αναπτύσσει μία πολύπλευρη προσωπικότητα.
               Η τακτική ενημέρωση των γονέων και η συνεργασία ανάμεσα σε μαθητές, δασκάλους και γονείς είναι απαραίτητη για την επιτυχία του εκπαιδευτικού προγράμματος
               Έτοιμοι να κάνετε τη διαφορά;
               Επισκεφθείτε τα σχολεία μας!
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/yes.edu.gr');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/YESschoolgr');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCDPHBXA1wWwhrPeytyPjyng');
       Scholio::portalSocial($fake, 'google-plus', 'https://plus.google.com/104230107263512772172?pageid=104230107263512772172');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/company/-yes-english-language-center/');
       Scholio::portalSocial($fake, 'pinterest', 'https://gr.pinterest.com/YESschoolgr/');






     /*=============== 4 COSMOS By Laura ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών COSMOS By Laura', 'email' => 'laurar@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'laura'])->id,
            'address' => 'Μιαούλη & Μακεδονομάχων, Εύοσμος',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310704453,
            'type_id' => 4,
            'website' => 'cosmosbylaura.gr',
            'approved' => 1,
            'about' => '
                Το σχολείο μας ξεκίνησε το 2009 με το όραμα να φτιάξουμε ένα σχολείο σύγχρονο, όπου μέσα από τη διδασκαλία της ξένης γλώσσας θα εφοδιάζουμε το παιδί όχι μόνο με τις απαραίτητες γνώσεις αλλά και τα εφόδια και τις αρχές εκείνες που θα το κάνουν συνειδητοποιημένο και πετυχημένο ενήλικα.
                Η συνεχής μας εξέλιξη και κατάρτιση σε ότι αφορά την ξενόγλωσση εκπαίδευση καθώς  η αφοσίωση  και μεθοδικότητα  στη δουλεία μας εξασφαλίζουν το ιδανικό περιβάλλον για το κάθε παιδί να λειτουργήσει να αναπτυχθεί και να διαπρέψει.
                Στο σχολείο μας λειτουργούν τμήματα εκμάθησης Αγγλικής, Γερμανικής, Ιταλικής και Γαλλικής Γλώσσας.
                Τα δίδακτρά μας είναι προσιτά.
                Τα τμήματα μας είναι ολιγομελή.
                Σε όλες της αίθουσες λειτουργεί Διαδραστικός Πίνακας.
                Στο σχολείο μας υπάρχει εργαστήριο – αίθουσα ηλεκτρονικών υπολογιστών για επιπλέον εξάσκηση.
                Για την δική σας εξυπηρέτηση το σχολειό μας διαθέτει σχολικό λεωφορείο.
                Η επικοινωνία με τους γονείς είναι συνεχής και προσωπική.
                Το σχολικό μας λεωφορείο είναι εναρμονισμένο με τα σύγχρονά πρότυπα ασφάλειας και μπορεί να μεταφέρει από και προς το σπίτι σας το παιδί σας με ασφάλεια και άνεση.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/cosmosbylaura2009');





     /*=============== 5 Goethe - Institut Thessaloniki ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Goethe - Institut Thessaloniki', 'email' => 'info-thessaloniki@goethe.de', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'goethe'])->id,
         'address' => 'Βασ. Όλγας 66',
         'city' => 'Θεσσσαλονίκη',
         'phone' => 2310889610,
         'type_id' => 4,
         'website' => 'goethe.de',
         'approved' => 1,
         'about' => '
            Το Ινστιτούτο Goethe είναι το παγκόσμιας εμβέλειας και δράσης πολιτιστικό ίδρυμα της Ομοσπονδιακής Δημοκρατίας της Γερμανίας.
            Προωθούμε τη γνώση της γερμανικής γλώσσας στο εξωτερικό και στηρίζουμε τη διεθνή πολιτιστική συνεργασία. Με πληροφορίες για την πολιτιστική, κοινωνική και πολιτική ζωή στη Γερμανία, μεταδίδουμε μια σύγχρονη, πλήρη και ολοκληρωμένη εικόνα της χώρας. Τα πολιτιστικά και εκπαιδευτικά μας προγράμματα ενθαρρύνουν τον διαπολιτισμικό διάλογο και δίνουν τη δυνατότητα συμμετοχής σε πολιτιστικές δραστηριότητες. Επίσης, ενισχύουν την ανάπτυξη δομών από την κοινωνία των πολιτών και προωθούν την παγκόσμια κινητικότητα.
            Μέσα από το δίκτυό μας −τα Ινστιτούτα Goethe, τα κέντρα Goethe, τις πολιτιστικές εταιρείες, τις αίθουσες ανάγνωσης, καθώς και τα εξεταστικά κέντρα και τα κέντρα εκμάθησης της γλώσσας−, είμαστε επί 60 και πλέον χρόνια και για πολλούς ανθρώπους η πρώτη τους επαφή με τη Γερμανία. Η μακροχρόνια εταιρική σχέση και συνεργασία με σημαίνοντες φορείς και προσωπικότητες σε περισσότερες από 90 χώρες δημιουργεί σταθερή εμπιστοσύνη στη χώρα μας. Συνεργαζόμαστε με όλους όσοι ασχολούνται ενεργά με τη Γερμανία και τον πολιτισμό της και εργάζονται με δική τους πρωτοβουλία και ευθύνη, χωρίς κομματικές δεσμεύσεις.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 8, 'frontistirio');


     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/goetheinstitut.thessaloniki');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/goetheinstitut_athen/');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/user/giathen1');





        /*=============== 6 Βαφοπούλου ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών Βαφοπούλου', 'email' => 'vafopoulou@vafopoulou.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'vafopoulou'])->id,
            'address' => 'Τσιμισκή 80',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310273190,
            'type_id' => 4,
            'website' => 'vafopoulou.gr',
            'approved' => 1,
            'about' => '
                Το Φροντιστήριο Αγγλικών Βαφοπούλου ιδρύθηκε το 1952 από την Αναστασία Βαφοπούλου (1915-2001), σύζυγο του ποιητή Γιώργου Βαφόπουλου (1903-1996). Εγκατεστημένο ανέκαθεν στο κέντρο της πόλης μεταφέρθηκε τελικά το 1972 στο διδακτήριο της οδού Προξένου Κορομηλά 36, όπου και στεγάζεται μέχρι σήμερα.
                Από τα πρώτα κέντρα διδασκαλίας της Αγγλικής, το φροντιστήριο σφραγίστηκε τα πρώτα χρόνια της λειτουργίας του από την ισχυρή προσωπικότητα της Αναστασίας Βαφοπούλου.
                Η επιμονή της στην άρτια οργάνωση των προγραμμάτων, στην πειθαρχία προσωπικού και των διδασκομένων και στη συστηματική εργασία ανέδειξαν γρήγορα το φροντιστήριο στο πιο οργανωμένο και αξιόπιστο κέντρο εκμάθησης της Αγγλικής γλώσσας στην πόλη της Θεσσαλονίκης.
                Σ την πενηντατετράχρονη ιστορία του το φροντιστήριο προσέφερε πρωτοπόρο και υποδειγματικό εκπαιδευτικό έργο σε χιλιάδες μαθητών και ευτύχησε να περιλάβει στα μαθητολόγιά του ορισμένες από τις σημαντικότερες προσωπικότητες του πνευματικού αλλά και του επιχειρηματικού κόσμου της Θεσσαλονίκης. Άλλωστε, ο Γιώργος και η Αναστασία Βαφοπούλου υπήρξαν για πολλά χρόνια αναπόσπαστο μέρος της πνευματικής ζωής της Θεσσαλονίκης, απέναντι στην οποία στάθηκαν πάντα ευγνώμονες και γενναιόδωροι.
                Το "Βαφοπούλειο Πνευματικό Κέντρο" και η συμβολή στην ανέγερση της νέας Δημοτικής Βιβλιοθήκης είναι οι πιο γνωστές από τις σημαντικές αυτές πρωτοβουλίες τους.
                Σήμερα, το Κέντρο Ξένων Γλωσσών ΒΑΦΟΠΟΥΛΟΥ με γνώμονα τη μοναδική ιστορία του ανανεώνεται και αναπροσανατολίζεται στις νέες συνθήκες, προσαρμόζοντας το εκπαιδευτικό του μηχανισμό στις αρχές του Κοινού Ευρωπαϊκού Πλαισίου για την ξενόγλωσση εκπαίδευση στον χώρο της ενωμένης Ευρώπης.
                Επιπλέον, ως μέλος του EXACT που οργανώνει τις εξετάσεις ESOL του Cambridge University , εγγυάται πολύπλευρη προετοιμασία υψηλού επιπέδου για όλα τα πτυχία γλωσσομάθειας στο χώρο της αγγλικής.
                Μέσα στο σύγχρονο τοπίο μιας αυξανόμενης ανταγωνιστικότητας στο χώρο της ξενόγλωσσης εκπαίδευσης, το Κέντρο Ξένων Γλωσσών ΒΑΦΟΠΟΥΛΟΥ συνεχίζει να διακρίνεται όχι μόνο ως ξενόγλωσσος εκπαιδευτικός οργανισμός, αλλά και ως χώρος παιδείας με σημαντικές και καθολικά αναγνωρισμένες προβολές στην κοινωνική και πνευματική ζωή της Θεσσαλονίκης.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'BEC');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Vafopoulou');


        /*=============== 7 Γενεsis ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών Γενεsis', 'email' => 'info@genesisedu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'genesis'])->id,
            'address' => 'Κολοκοτρώνη 33, Εύοσμος',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310704400,
            'type_id' => 4,
            'website' => 'genesisedu.gr',
            'approved' => 1,
            'about' => '
                Φιλοσοφία
                Με το βλέμμα στραμμένο ΣΥΝΕΧΕΙΑ στο ΜΕΛΛΟΝ και την ΤΕΧΝΟΛΟΓΙΑ ,το Κ.Ξ.Γ. "Γενεsis" πρωτοπόρο και καινοτόμο εισάγει στη διδασκαλία ( διδάσκουμε διαδραστικά από το 2007 ) το διαδραστικό πίνακα σε όλες τις αίθουσες και σε όλα τα επίπεδα των Ξένων Γλωσσών δίνοντας ισχυρό εφόδιο για υψηλό επίπεδο εκπαίδευσης επικεντρώνοντας ευχάριστα το ενδιαφέρον και την ενεργή συμμετοχή των μαθητών.
                ΥΠΕΡΣΥΓΧΡΟΝΕΣ ΑΙΘΟΥΣΕΣ Η/Υ
                Με την κατασκευή της υπερσύγχρονης αίθουσας Ηλεκτρονικών Υπολογιστών (ΔίκτυοΥψηλήςΤαχύτητας-ΣύγχρονοιΥπολογιστές) οι μαθητές μας διδάσκονται ένα ολοκληρωμένο πρόγραμμα εκμάθησης Ξένων Γλωσσών,σε ψηφιακό περιβάλλον , ενισχύοντας τις ικανότητες και τις δεξιότητες τους .
                ΗΛΕΚΤΡΟΝΙΚΟ ΒΙΒΛΙΟ
                Το ηλεκτρονικό βιβλίο (e-book), εξαιρετικό βοήθημα ,διευκολύνει τη μελέτη στο σπίτι μέσω του προσωπικού υπολογιστή και μετατρέπει το μάθημα σε διασκέδαση. Όλα τα προγράμματα πολυμέσων (multimedia) επιλέγονται με αυστηρά κριτήρια σε συνεργασία με κορυφαίες , πρωτοπόρες εταιρείες κατασκευής και προμήθειας προγραμμάτων εκμάθησης Ξένων Γλωσσών.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');



        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/people/%CE%9A%CE%AD%CE%BD%CF%84%CF%81%CE%BF-%CE%9E%CE%AD%CE%BD%CF%89%CE%BD-%CE%93%CE%BB%CF%89%CF%83%CF%83%CF%8E%CE%BD-%CE%93%CE%AD%CE%BD%CE%B5%CF%83%CE%B9%CF%82/100002832205581');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/watch?v=l1BZnpRD-ns');





        /*=============== 8 genius ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών Genius', 'email' => 'info@geniusedu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'genius'])->id,
            'address' => 'Μεγάλου Αλεξάνδρου 45, Εύοσμος',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310758599,
            'type_id' => 4,
            'website' => 'geniusedu.gr',
            'approved' => 1,
            'about' => '
                15 χρόνια τώρα, φροντίζουμε τους μαθητές τον καθένα ξεχωριστά ώστε να αναδεικνύουν συνεχώς τον καλύτερο εαυτό τους, σε όλα τα επίπεδα σπουδών.
                Και συνεχίζουμε με την ίδια φροντίδα, την ίδια δυναμική, την ίδια ικανοποίηση που φέρνει το χαρούμενο χαμόγελο γονιού & μαθητή όταν αντικρίζουν τις επιδόσεις!
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Τούρκικα');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αραβικά');



        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αραβικά');


        Scholio::portalStudy($fake, 'Παιδικά Τμήματα',  'Πληροφορική', 'Προγραμματισμός');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση ΑΣΕΠ');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/GeniusEducationSchool');




        /*=============== 9 Jubilee ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών Jubilee', 'email' => 'info@jubilee.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'jubilee'])->id,
            'address' => 'Μ. Αλεξάνδρου 43-45, Καλαμαριά',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310432433,
            'type_id' => 4,
            'website' => 'jubilee.gr',
            'approved' => 1,
            'about' => '
                Το Jubilee δημιουργήθηκε από δύο φίλες που συναντήθηκαν ξανά στην πόλη της Θεσσαλονίκης, αφού ολοκλήρωσαν τις σπουδές τους σε Ελλάδα και εξωτερικό. Με πολλή αγάπη και καινοτόμες ιδέες, έφτιαξαν αυτόν τον μοντέρνο χώρο για τους μικρούς και μεγάλους φίλους, έχοντας ως στόχο την υπεύθυνη και διασκεδαστική διδασκαλία των ξένων γλωσσών. Επιλέξτε το Jubilee (τη γκρι γραμμή του μετρό του Λονδίνου) και ας ξεκινήσουμε μαζί ένα ταξίδι στην κουλτούρα της ξένης γλώσσας.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 9, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');



        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/jubileelanguagecentre');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/jubilakiii');


        /*=============== 10 Vision ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Vision', 'email' => 'info@vision.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'vision'])->id,
            'address' => 'Νίκης 6, Ηλιούπολη',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310600460,
            'type_id' => 4,
            'website' => 'vision.edu.gr',
            'approved' => 1,
            'about' => '
              Το κέντρο ξένων γλωσσών Vision δραστηριοποιείται στην εκμάθηση της αγγλικής και γαλλικής γλώσσας. Αποστολή και όραμά μας είναι η σωστή και πλήρης κατάρτιση των μαθητών μας όλων των ηλικιών παρέχοντας ολοκληρωμένα προγράμματα ξένων γλωσσών. Εκτός όμως από την υψηλή ποιότητα σπουδών, ξεχωρίζουμε για
              τις ολοκαίνουριες ιδιόκτητες εγκαταστάσεις μας, ανακαινισμένες με πολλή φροντίδα και μεράκι δημιουργώντας ένα ζεστό και φιλικό μαθησιακό περιβάλλον
              το άρτια εκπαιδευμένο προσωπικό μας, πτυχιούχοι Αγγλικής και Γαλλικής Φιλολογίας, επιλεγμένοι με βάση την διδακτική τους εμπειρία, την μεταδοτικότητά τους και την εξειδίκευσή τους
              τα ολιγομελή και ομοιογενή τμήματά μας (6-9 μαθητές), που καθιστούν εφικτή μια πιο εξατομικευμένη μέθοδο διδασκαλίας σύμφωνα με τις αδυναμίες και τις ανάγκες του κάθε μαθητή
              τα πιο σύγχρονα οπτικοακουστικά μέσα, όπως είναι ο διαδραστικός πίνακας, παρέχοντας νέες προοπτικές στη διδασκαλία και παρουσίαση της ξένης γλώσσας
              την ενισχυτική διδασκαλία στους μαθητές που προετοιμάζονται ενεργά για την απόκτηση πτυχίων μέσω τεστ προσομοίωσης (mock tests) με σκοπό την καλύτερη μελέτη και εμπέδωση της αγγλικής ή γαλλικής γλώσσας
              την άρρηκτη συνεργασία μας με το κέντρο γαλλικής γλώσσας και πολιτισμού Concorde, που εδρεύει στην ανατολική Θεσσαλονίκη. Με σύμβουλο γαλλικής γλώσσας την κα Σοφία Τερεζάκη, με πολυετή πείρα στο Γαλλικό Ινστιτούτο, το Vision αποτελεί πρότυπο κέντρο εκμάθησης της γαλλικής γλώσσας με τα καλύτερα πιθανά διαπιστευτήρια.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 11, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');


        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'LEGO Education');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/vision56431');





     /*=============== 11 Ξεφτέρη ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών Ξεφτέρη', 'email' => 'info@xefteri.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'xefteri'])->id,
         'address' => 'Ραιδεστού 17, Άνω Ηλιούπολη',
         'city' => 'Θεσσσαλονίκη',
         'phone' => 2310652963,
         'type_id' => 4,
         'website' => 'xefteri.gr',
         'approved' => 1,
         'about' => '
            Μέθοδοι και πρακτικές διδασκαλίας
            Διδάσκουμε την ξένη γλώσσα σύμφωνα με μια βασική αρχή, την απόλυτη και συνειδητή συμμετοχή των μαθητών σε όλη τη διαδικασία της μάθησης.
            Στηριζόμαστε στην βασική ιδέα ότι η γνώση δεν είναι κάτι που υπάρχει έξω από εμάς και απλώς μεταδίδεται. Η γνώση δεν λαμβάνεται παθητικά, αλλά απαιτεί την ενεργό συμμετοχή του ατόμου.
            Μας ενδιαφέρει να πετυχαίνουμε στις εξετάσεις, αλλά και να ξέρουμε να χρησιμοποιούμε την ξένη γλώσσα σωστά και ανάλογα με το πλαίσιο όπου βρισκόμαστε κάθε φορά. Μας ενδιαφέρει ακόμα το ταξίδι μέσα από τη διαδικασία της μάθησης να είναι γεμάτο εμπειρίες, δημιουργία και κυρίως κριτική σκέψη.
            Με βασικό σκοπό την ενεργοποίηση και την εμπλοκή των μαθητών στην μαθησιακή διαδικασία ακολουθούμε ένα συνδυασμό πρακτικών διδασκαλίας:
            δίνουμε έμφαση στη συζήτηση και τη συνεργασία σε μικρές ομάδες
            αμφισβητούμε, ρωτάμε κι απαντάμε
            ακολουθούμε παιχνίδια ρόλων
            χρησιμοποιούμε πολυμέσα ηλεκτρονικής τεχνολογίας
            εφαρμόζουμε την προσομοίωση των πραγματικών συνθηκών της εξέτασης πιστοποίησης της ξένης γλώσσας
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');



     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');


     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'LEGO Education');

     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Xefterischool');






     /*=============== 12 Υψηλάντειο ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Αγγλικής Γλώσσα Υψηλάντειο', 'email' => 'ypsiland@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ypsilandio'])->id,
         'address' => 'Ανδρεοπούλου 3',
         'city' => 'Θεσσσαλονίκη',
         'phone' => 2310839929,
         'type_id' => 4,
         'website' => 'ypsilandio.gr',
         'approved' => 1,
         'about' => '
           Από την πρώτη μέρα λειτουργίας του, το 1975, το Κέντρο Αγγλικής Γλώσσας Υψηλάντειο επιδίδεται με συνέπεια και αφοσίωση στη διδασκαλία των Αγγλικών,
           αποκτώντας έτσι τη μέγιστη δυνατή εξειδίκευση. Γενιές σπουδαστών πρωτογνώρισαν και κατέκτησαν την Αγγλική γλώσσα χάρη στην αποτελεσματικότητα της μεθόδου διδασκαλίας του φροντιστηρίου μας. Παράλληλα, η επιτυχημένη πορεία τόσων δεκαετιών οφείλεται στο ότι το Κέντρο Αγγλικής Γλώσσας Υψηλάντειο ξεκίνησε και διαρκώς εξελίσσεται με το όραμα της διευθύντριας Μ. Μισαηλίδου.
           Όλα αυτά αποτελούν τα συστατικά στοιχεία του φροντιστηρίου μας και εγγυώνται τη δημιουργία μιας στενής και ουσιαστικής σχέσης τόσο με τους μαθητές όσο και με τους γονείς. Το Κέντρο Αγγλικής Γλώσσας Υψηλάντειο έχει κάνει αισθητή την παρουσία του στη Βασ. Όλγας με Ανδρεοπούλου γωνία στή Θεσσαλονίκη.
           Ελάτε να γνωριστούμε από κοντά!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');


     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');






     /*=============== 13 Χατζόπουλου ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Χατζόπουλου', 'email' => 'info@hadzopoulos.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'hadzopoulos'])->id,
         'address' => 'Μουσχουντή 11, Σταυρούπολη',
         'city' => 'Θεσσσαλονίκη',
         'phone' => 2310608505,
         'type_id' => 4,
         'website' => 'hadzopoulos.edu.gr',
         'approved' => 1,
         'about' => '
           Προφίλ
           Τα Κέντρα Ξένων Γλωσσών-Πληροφορικής Χατζόπουλου αποτελούν την πρώτη επιλογή στην ξενόγλωσση εκπαίδευση στη Δ. Θεσσαλονίκη. Με 35 χρόνια λειτουργίας, είναι ο μεγαλύτερος φροντιστηριακός οργανισμός της Δ. Θεσσαλονίκης και κορυφαία επιλογή για την απόκτηση ξενόγλωσσων πτυχίων και πτυχίων πληροφορικής.
           Επίπεδα Σπουδών
           Όλα τα επίπεδα στην Αγγλική, Γαλλική, Γερμανική , Ιταλική ,Ισπανική, Ρωσική, Βουλγαρική, Κινεζική γλώσσα.
           Νέα Τμήματα Γλωσσών Προστίθενται Διαρκώς στο Πρόγραμμα Σπουδών των Κέντρων μας.
           Crash Courses
           Ταχύρυθμα προγράμματα, προσαρμοσμένα στις ανάγκες μαθητών και ενηλίκων, που προετοιμάζουν για τις εξετάσεις όλων των τίτλων.
           Τμήματα ενηλίκων
           Ευέλικτο ωράριο διδασκαλίας, εντατική διδασκαλία της γλώσσας, Language Lab για γρήγορη εξοικείωση με την γλώσσα (προφορικά /κατανόηση), τμήματα προετοιμασίας για εξετάσεις.
           Προπαρασκευαστικά τμήματα για μαθητές Α’ και Β’ Δημοτικού
           Παιχνίδια, εικονογραφημένα βιβλία, υπολογιστές και εκπαιδευτικές δραστηριότητες κάνουν την αρχή της εκμάθησης μιας ξένης γλώσσας συναρπαστική, προετοιμάζοντας την ομαλή εισαγωγή των μικρών μαθητών στα μεγαλύτερα επίπεδα (Φοίτηση ΔΩΡΕΑΝ).
           Τμήματα πληροφορικής για την απόκτηση ECDL
           Καλύπτονται όλες οι ενότητες που οδηγούν στην απόκτηση του πτυχίου πληροφορικής ECDL, σε τμήματα παιδικά, εφηβικά και ενηλίκων.
           Τα Κέντρα Ξένων Γλωσσών-Πληροφορικής Χατζόπουλου είναι Πιστοποιημένα Εξεταστικά Κέντρα του οργανισμού ECDL και οι εξετάσεις διενεργούνται στους χώρους μας.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 8, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Βουλγάρικα');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Κινέζικα');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Βουλγάρικα');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Κινέζικα');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');


     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Chatzopoulos.Center');






     /*=============== 14 concorde ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες', 'email' => 'info@concorde.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'concorde'])->id,
         'address' => 'Β. Όλγας 124',
         'city' => 'Θεσσσαλονίκη',
         'phone' => 2310816100,
         'type_id' => 4,
         'website' => 'info@concorde.gr',
         'approved' => 1,
         'about' => '
           Η πολυετής εμπειρία μας στη διδασκαλία της Γαλλικής γλώσσας και στη διεξαγωγή των εξετάσεων (γραπτών και προφορικών) όλων των γαλλικών πτυχίων, μας οδήγησε στη δημιουργία ενός άρτια εξοπλισμένου Κέντρου Γαλλικής Γλώσσας και Πολιτισμού.
           Στόχος μας είναι η γρήγορη εκμάθηση της γαλλικής γλώσσας, η σωστή χρήση της και η βέβαιη επιτυχία των μαθητών μας στις εξετάσεις.
           Θέτουμε στη διάθεσή τους την τεχνογνωσία μας και τα βασικά χαρακτηριστικά της επιτυχίας μας: Αξιοπιστία – Υπευθυνότητα – Πείρα.
           Στο Κέντρο Γαλλικής Γλώσσας CONCORDE δίνουμε ιδιαίτερη βαρύτητα στην εμπειρία, τη μεταδοτικότητα και τη γαλλική παιδεία των καθηγητών μας.

           Οι εγκαταστάσεις μας
           Το φροντιστήριο γαλλικών CONCORDE βρίσκεται στην οδό Βασ. Όλγας 124, στον πρώτο όροφο, μόλις 10 λεπτά από το κέντρο της πόλης ή από τα ανατολικά προάστια της Θεσσαλονίκης.
           Η εύκολη και γρήγορη πρόσβαση δίνει τη δυνατότητα σε σπουδαστές από όλη τη Θεσσαλονίκη να μαθαίνουν Γαλλικά στο CONCORDE.
           Οι εγκαταστάσεις του Concorde διαθέτουν 4 άνετες αίθουσες διδασκαλίας, αίθουσα υποδοχής, χώρο βιντεοπροβολής και δανειστική βιβλιοθήκη με πολλούς τίτλους γαλλικών βιβλίων.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/gallika.concorde/');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/concorde_gr');




     /*=============== 15 English World ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες English World', 'email' => 'info@englishworld.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'englishworld'])->id,
         'address' => 'Πασαλίδη 65, Καλαμαριά',
         'city' => 'Θεσσσαλονίκη',
         'phone' => 2310452511,
         'type_id' => 4,
         'website' => 'englishworld.gr',
         'approved' => 1,
         'about' => '
            Το “English World” λειτουργεί από το 2000 σε ένα όμορφο, σύγχρονο και φιλικό περιβάλλον διδάσκοντας την Αγγλική γλώσσα σε παιδιά, εφήβους και ενήλικες.
             Ο βασικός μας στόχος στο “English World” είναι η ποιοτικά άριστη παροχή διδασκαλίας της Αγγλικής Γλώσσας.
             Εχουμε επεξεργασμένα προγράμματα σπουδών όλων των επιπέδων που στηρίζονται στην πολυετή εμπειρία μας και εξασφαλίζουν στους σπουδαστές μας σίγουρη επιτυχία στην απόκτηση τίτλων γλωσσομάθειας όλων των επιπέδων.
             Διαθέτουμε άριστα καταρτισμένο καθηγητικό προσωπικό, με Πανεπιστημιακούς και Μεταπτυχιακούς τίτλους σπουδών.
             Τη διεύθυνση και εφαρμογή των Προγραμμάτων Σπουδών του “English World” έχει η Janet Birdsall, Αγγλίδα καθηγήτρια με πολυετή διδακτική εμπειρία, πτυχιούχος Αγγλικής Φιλολογίας πανεπιστημίου Hull  Μ. Βρετανίας, κάτοχος RSA Diploma TEFL (Δίπλωμα Μεθοδολογίας και Διδασκαλίας της Αγγλικής ως ξένης Γλώσσας) και πρώην καθηγήτρια του British Council και εξετάσεων Cambridge.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');

     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/English-World-355109594648324');





     /*=============== 16 GALILEO GALILEI ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών GALILEO GALILEI', 'email' => 'info@galileogalilei.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'galileogalilei'])->id,
         'address' => 'Τσιμισκή 116',
         'city' => 'Θεσσσαλονίκη',
         'phone' => 2310263876,
         'type_id' => 4,
         'website' => 'galileogalilei.gr',
         'approved' => 1,
         'about' => '
             Το κέντρο ξένων γλωσσών GALILEO GALILEI επιλέχθηκε από μια ομάδα ερευνητών του Πανεπιστημίου της Σιένα ως η καλύτερη σχολή ιταλικών ανάμεσα σε πολυάριθμα γλωσσολογικά κέντρα και Πανεπιστήμια που λειτουργούν ανά τον κόσμο.
             Η έρευνα αυτή είχε ως στόχο να συγκροτήσει από το πρωτότυπο διδακτικό υλικό κάθε Ινστιτούτου ή Πανεπιστημίου που επιλέχθηκε , ένα σύνολο διδακτικών μεθόδων, τρόπων προσέγγισης της διδασκαλίας, γλωσσολογικού και πολιτισμικού υλικού της ιταλικής γλώσσας και κουλτούρας για να χρησιμοποιηθεί κατά τη διδασκαλία της ιταλικής, ως ξένης γλώσσας.
             Σ’ αυτή την προσπάθεια το κέντρο ξένων γλωσσών GALILEO GALILEI κατέθεσε τις ειδικές διδακτικές τεχνικές του οι οποίες βοηθούν τον σπουδαστή,  να φέρει σε πέρας αποτελεσματικότερα και ευκολότερα τους στόχους του.
             Το αποτέλεσμα της έρευνας δημοσιεύτηκε το 1995 στη Ρώμη με τίτλο “ Curricolo di italiano per stranieri ”
            ',
         'background' => $background,
     ]);

     new Portal($fake, 8, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GRE');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/istitutogalileogalilei');



     /*=============== 17 ================*/

//     $fake = factory(App\Models\School::class)->create([
//         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
//         'address' => '',
//         'city' => 'Θεσσσαλονίκη',
//         'phone' => 2310,
//         'type_id' => 4,
//         'website' => '',
//         'approved' => 1,
//         'about' => '
//
//            ',
//         'background' => $background,
//     ]);
//
//     new Portal($fake, 5, 'frontistirio');
//
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Τούρκικα');
//
//
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');
//
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');
//
//
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'LEGO Education');
//
//     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');

    }



}
