<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiri10 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;



     /*=============== 1 Πολυχώρος Γνώσης ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Πολυχώρος Γνώσης', 'email' => 'polixorosgnosis@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'polixorosgnosis'])->id,
         'address' => 'Στρατηγού Μακρυγιάννη 56, Άγιος Δημήτριος',
         'city' => 'Αθήνα',
         'phone' => 2109961317,
         'type_id' => 3,
         'website' => 'polixorosgnosis.eu',
         'approved' => 1,
         'about' => '
            Το φροντιστήριο Μ.Ε πολυχώρος ΓΝώΣΗς σε σύντομο χρονικό διάστημα άλλαξε τα δεδομένα του φροντιστηριακού χώρου στη ευρύτερη περιοχή του Αγίου Δημητρίου και Αλίμου, παρέχοντας υψηλού επιπέδου υπηρεσίες εκπαίδευσης σε μαθητές και μαθήτριες Γυμνασίου, Γενικού και Επαγγελματικού Λυκείου.
            Η βελτίωση που παρουσίασαν οι σπουδαστές μας στην επίδοση τους και το ποσοστό των επιτυχιών τους στις Πανελλαδικές Εξετάσεις μας κάνει υπερήφανους.
            Η εκπαίδευση όμως είναι "αλυσίδα" και το Όραμά μας είναι να μεταλαμπαδεύσουμε τη γνώση, τον πολιτισμό , την πνευματική διαφώτιση και στους μικρούς μας φίλους.
            Για τον σκοπό αυτό δημιουργήσαμε  ένα νέο χώρο, ανεξάρτητο, με μοντέρνες ασφαλείς και πλήρως λειτουργικές προδιαγραφές,  για τη μελέτη, την εκπαίδευση, τις δημιουργικές εργασίες των μαθητών του Δημοτικού και Γυμνασίου καθώς και τη βιοματική μάθηση σε παιδιά προσχολικής ηλικίας.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 12, 'frontistirio');

        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', ' Ρομποτική & STEM');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/polixorosgnosis');





     /*=============== 2 Κύτταρο ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτικός Όμιλος Κύτταρο', 'email' => 'info@kuttaro.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'kuttaroNeoHrakleio'])->id,
         'address' => 'Ρούμελης 10, Νέο Ηράκλειο',
         'city' => 'Αθήνα',
         'phone' => 2130245204,
         'type_id' => 3,
         'website' => 'kuttaro.edu.gr',
         'approved' => 1,
         'about' => '

         Γιατί Κύτταρο;

            ΓΙΑΤΙ ΦΡΟΝΤΙΖΟΥΜΕ
            ΤΟΥΣ ΜΑΘΗΤΕΣ ΜΑΣ ΠΑΡΕΧΟΝΤΑΣ:

            Στήριξη και καθοδήγηση με τις Προσωπικές Συνεντεύξεις.
            Ενδιαφέρον για την εικόνα προόδου και φροντίδα για την κάλυψη των "κενών".
            Πρόγραμμα διαχείρισης Χρόνου και Ύλης.
            Σεμινάριο ενημέρωσης Επαγγελματικού Προσανατολισμού και Συμπλήρωση Μηχανογραφικού.
            Test επαγγελματικού προσανατολισμού και την ψυχομετρική ανάλυση αξίας 180ευρώ (στους μαθητές μας δωρεάν).
            Δημιουργώντας πραγματικά ολιγομελή τμήματα ( 6μελή ).
            Όλα τα Θέματα Πανελλαδικών και της Ο.Ε.Φ.Ε. με τις λύσεις τους.
            Συμμετοχή στα Διαγωνίσματα Προσομοίωσης της Ο.Ε.Φ.Ε. (Ομοσπονδία Εκπαιδευτικών Φροντιστών Ελλάδος).
            Οδηγίες για ατομική προστασία και ασφαλή εγκατάλειψη του κτιρίου σε περίπτωση πυρκαγιάς ή σεισμού.
            Πληροφορίες για τα προνόμια της Φοιτητικής Ζωής και τις εξωδιδακτικές παροχές και δυνατότητες των φοιτητών.
            Πρόγραμμα Διατροφής για την περίοδο των Πανελλαδικών Εξετάσεων.
            Ενημερωτικά έντυπα επίσημων φορέων για τις επιπτώσεις των ουσιών εξάρτησής [αλκοόλ, νικοτίνη, ναρκωτικά κ.λ.π].
            Τη δυνατότητα 2 φορές το χρόνο να πουν ελευθέρα και ανώνυμα τη γνώμη τους για το Φροντιστήριό μας , με το Δελτίο Αξιολόγησης του Φροντιστηρίου από τους Μαθητές.

            ΓΙΑΤΙ ΕΝΔΙΑΦΕΡΟΜΑΣΤΕ
            ΓΙΑ ΤΙΣ ΟΙΚΟΓΕΝΕΙΕΣ ΤΟΥΣ
            Ενημέρωση Γονέων.
            Ατομικός Κωδικός Πρόσβασης.
            Συμβουλευτική Διαχείρισης των παιδιών.
            Άμεση ειδοποίηση σε περίπτωση απουσίας του παιδιού.
            Τη δυνατότητα 2 φορές το χρόνο να πουν ελευθέρα και ανώνυμα τη γνώμη τους για το Φροντιστήριό μας , με το Δελτίο Αξιολόγησης του Φροντιστηρίου από τους Γονείς.
            Αγάπη και Φροντίδα για τα παιδιά μας.

            ΓΙΑΤΙ ΕΙΜΑΣΤΕ ΕΠΑΓΓΕΛΜΑΤΙΕΣ ΤΟΥ ΧΩΡΟΥ...

            ΚΑΙ ΜΑΘΑΙΝΟΥΜΕ ΤΑ ΠΑΙΔΙΑ ΜΑΣ

            Να εργάζονται και να "λειτουργούν" μέσα στην τάξη αξιοποιώντας τη δυναμική της.
            Να διαχειρίζονται σωστά το χρόνο τους.
            Να οργανώνουν το διάβασμά τους.
            Να μετασχηματίζουν την πληροφορία σε γνώση.
            Να αξιοποιούν τις συνεχείς γραπτές δοκιμασίες του Φροντιστηρίου μας προκειμένου να βελτιστοποιηθούν στην αντιμετώπιση των τελικών εξετάσεων.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', ' Ρομποτική & STEM');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/profile.php?id=100012377208460');




        /*=============== 3 Αριστοβάθμιο ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Αριστοβάθμιο', 'email' => 'aristovathmio@gmail.com ', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'aristovathmio'])->id,
            'address' => 'Τζαβέλλα 55, Καστέλλα',
            'city' => 'Αθήνα',
            'phone' => 2104125440,
            'type_id' => 3,
            'website' => 'aristovathmio.gr',
            'approved' => 1,
            'about' => '
                    Τo Αριστοβάθμιο Φροντιστήριο συνεχίζει δυναμικά μετά από μια διετή επιτυχημένη λειτουργία ,σε νέο ανανεωμένο και λειτουργικό χώρο, να πρωταγωνιστεί στο χώρο της φροντιστηριακής εκπαίδευσης. Τα υψηλά ποσοστά επιτυχίας και η επίτευξη υψηλών βαθμολογιών επιβεβαιώνουν τις άριστες εκπαιδευτικές υπηρεσίες μας.

                    Προσηλωμένοι στους στόχους μας διατηρούμε πιστά τις εκπαιδευτικές μας αρχές :

                    Συστηματικό και οργανωμένο πρόγραμμα προσαρμοσμένο στις ανάγκες των μαθητών
                    Ολιγομελή και ομοιογενή τμήματα
                    Έλεγχος των γνώσεων με συχνά επαναληπτικά διαγωνίσματα
                    Επιπλέον διδακτικές ώρες για την κάλυψη κενών
                    Προσωπική σχέση με τους μαθητές μας
                    Άνετο και ευχάριστο περιβάλλον
                    Εξειδικευμένο και άρτια καταρτισμένο εκπαιδευτικό προσωπικό
                    Χρήση Νέων Τεχνολογιών
                    Πλατφόρμα e-learning
                    Επαγγελματικός προσανατολισμός
                    Φύλλα εργασίας  με εποπτεία στο φροντιστήριο σε προκαθορισμένες ημέρες , στο πλαίσιο του προγράμματος σπουδών.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/aristovathmio');





        /*=============== 4 Δυναμικό Πεύκη ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Δυναμικό Πεύκη', 'email' => 'dynamico@dynamico.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'dynamico'])->id,
            'address' => 'Λεωφόρος Ειρήνης 43, Πεύκη',
            'city' => 'Αθήνα',
            'phone' => 2106125082,
            'type_id' => 3,
            'website' => 'dynamico.gr',
            'approved' => 1,
            'about' => '
                Η φιλοσοφία μας
                Η φιλοσοφία μας ως εκπαιδευτικοί υπηρετεί μόνο έναν στόχο: τη δημιουργική, αποδοτική και ευχάριστη πορεία του μαθητή μας από την Α΄ Λυκείου μέχρι και την κατάθεση του μηχανογραφικού στο τέλος της Γ΄ Λυκείου.

                Οι στόχοι μας

                Η δημιουργία και διατήρηση ενός υγιούς περιβάλλοντος μάθησης, στο οποίο τα παιδιά δεν αντιλαμβάνονται τη γνώση σαν καταναγκασμό αλλά σαν προσωπική ευχαρίστηση.
                Η ανάπτυξη δεξιοτήτων από την πλευρά των μαθητών και η ουσιαστική απόκτηση γνώσεων.
                Η κατανόηση της σχολικής ύλης σε βάθος ώστε οι μαθητές να αντιλαμβάνονται το ΓΙΑΤΙ και το ΠΩΣ κάθε γνωστικής ενότητας.
                Η επιτυχία των παιδιών στις εξετάσεις τους με τρόπο που να αντικατοπτρίζει τις γνώσεις τους και να τα γεμίζει σιγουριά και αυτοπεποίθηση για το μέλλον.
                Η επιτυχία των μαθητών στις Πανελλήνιες εξετάσεις και η εισαγωγή τους σε σχολές της επιλογής τους έτσι ώστε ταυτόχρονα να τους εξασφαλίσουν και εφόδια στην αγορά εργασίας.
                Τα μέσα μας

                Οι καθηγητές του εκπαιδευτικού μας οργανισμού είναι άρτια καταρτισμένοι στο γνωστικό τους αντικείμενο , έχουν πολυετή παρουσία στην εκπαίδευση και αξιόλογο συγγραφικό έργο.
                Παροχή βιβλίων που καλύπτουν με ολοκληρωμένο και πρωτότυπο περιεχόμενο την διδακτέα ύλη σε όλα τα μαθήματα. Τα συγγράμματα αυτά συμπληρώνουν την ύλη των σχολικών εγχειριδίων και μέσα από παραδείγματα και πρωτότυπες ασκήσεις εμπεδώνεται σε βάθος το εκάστοτε γνωστικό αντικείμενο.
                Σύνδεση εκπαίδευσης και νέων τεχνολογιών: η διδασκαλία συνοδεύεται από την χρήση οπτικοακουστικών μέσων (διαδραστικοί πίνακες και  κατάλληλα ψηφιακά προγράμματα) συμπληρώνοντας τον αναντικατάστατο παραδοσιακό τρόπο διδασκαλίας.
                Ομοιογένεια στα τμήματα: από την αρχή της σχολικής χρονιάς εξασφαλίζεται μέγιστη δυνατή ομοιογένεια μέσα από συνέντευξη και διαγνωστικά τεστ. Κατά τη διάρκεια της σχολικής περιόδου το φροντιστήριο έχει τη δυνατότητα αναδιάρθρωσης των τμημάτων ανάλογα με την επίδοση των μαθητών.
                Ολοκληρωμένο σύστημα αξιολόγησης: συνεχής παρακολούθηση της επίδοσης των μαθητών μέσα από ένα σύστημα αξιολόγησης που περιλαμβάνει τεστ, διαγωνίσματα, εργασίες στο σπίτι, κ.τ.λ. Ιδιαίτερη έμφαση δίνεται στα υποχρεωτικά τρίωρα διαγωνίσματα καθ΄ όλη τη διάρκεια της χρονιάς βάσει καθορισμένου προγράμματος που καθορίζεται από την έναρξή της. Η μορφή και το περιεχόμενό τους εξασφαλίζει, μεταξύ των άλλων, την εξοικείωση των μαθητών με τις Πανελλήνιες εξετάσεις.
                Επαγγελματικός προσανατολισμός: συμμεριζόμενοι την αγωνία των παιδιών μας,  ανταποκριθήκαμε ερχόμενοι σε συνεργασία με την έγκυρη εταιρία Επαγγελματικού Προσανατολισμού Edu Job (www.edujob.gr) , προσφέροντας στους μαθητές μας τη δυνατότητα διερεύνησης των κλίσεων, των ικανοτήτων και των προτιμήσεών τους. Οι ειδικοί της Edu Job αναλύουν τις απαντήσεις των παιδιών και η έκθεση παρουσιάζεται στους γονείς και το μαθητή. Η συνολική εκτίμηση των αποτελεσμάτων, διευκολύνουν και θωρακίζουν το μαθητή ώστε να κάνει τη σωστή επιλογή.
                Ομάδες συμβουλευτικής: κάτω από την επίβλεψη καταρτισμένου επιστημονικού δυναμικού οι ομάδες συμβουλευτικής έχουν ως σκοπό τη διαχείριση του άγχους κατά τη διάρκεια της προετοιμασίας των εξετάσεων. Στο ίδιο πλαίσιο δίνεται και η δυνατότητα δημιουργίας ομάδας γονέων ώστε να μπορούν να σταθούν κατάλληλα δίπλα στα παιδιά διαχειριζόμενοι και αυτοί με τη σειρά τους τις αγωνίες και το άγχος τους.
                Παράλληλα το Δυναμικό Φροντιστήριο Πεύκης   διοργανώνει κοινωνικές εκδηλώσεις, συζητήσεις, εκθέσεις φωτογραφίας ,  εκδρομές συμβάλλοντας στην ενημέρωση και τη ψυχαγωγία και επενδύοντας σε αρκετές πτυχές της ανθρώπινης προσωπικότητας.

                Σας ευχαριστούμε για την αγάπη που μας περιβάλλει όλα αυτά τα χρόνια της λειτουργίας μας και δεσμευόμαστε πως θα συνεχίσουμε με αμείωτο ρυθμό να μοχθούμε προς όφελος των μαθητών μας.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 7, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


        /*=============== 5 Μαθητική Επιλογή ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Μαθητική Επιλογή', 'email' => 'info@mathepilogi.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'mathepilogi'])->id,
            'address' => 'Αγιού Νικολάου 108,  Ίλιον',
            'city' => 'Αθήνα',
            'phone' => 2155556191,
            'type_id' => 3,
            'website' => 'mathepilogi.gr',
            'approved' => 1,
            'about' => '
                Η Μαθηματική Επιλογή βοηθάει τον μαθητή να αποκτήσει σωστές βάσεις από το γυμνάσιο, να καλύψει τυχόν κενά προηγούμενων ετών στο λύκειο, με σκοπό την επιτυχία του στις πανελλήνιες. Είμαστε δίπλα στο  μαθητή σε ατομικό επίπεδο αντιμετωπίζοντας οποιαδήποτε δυσκολία του, επιβραβεύοντας και ενισχύοντας κάθε προσπάθειά του.
                Πραγματοποιείται διετής προετοιμασία για τις πανελλήνιες εξετάσεις. Οι μαθητές διδάσκονται παράλληλα με την ύλη της Β΄ Λυκείου και ένα τμήμα ύλης της Γ΄ Λυκείου. Με αυτό τον τρόπο οι μαθητές έχουν πολύ χρόνο στη διάθεσή τους να αφομοιώσουν την ύλη για τις πανελλήνιες αποφεύγοντας το άγχος και το πανικό.
                Το φροντιστήριο διοργανώνει  τρεις κύκλους διαγωνισμάτων προγραμματισμένους από την αρχή της σχολικής χρονιάς και επιπλέον συμμετέχει στις εξετάσεις της Ο.Ε.Φ.Ε.(Ομοσπονδία εκπαιδευτικών φροντιστηρίων Ελλάδος), στις οποίες οι μαθητές μας διαγωνίζονται την ίδια μέρα στα ίδια θέματα με μαθητές πολλών φροντιστηρίων σε όλη την Ελλάδα. Η διαδικασία αυτή αποτελεί προσομοίωση πανελληνίων εξετάσεων.
                Σας περιμένουμε στο χώρο μας για μια προσωπική επικοινωνία.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/mathepilogi');




        /*=============== 6 Άξονας Ταύρος ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Άξονας Ταύρος', 'email' => 'info@axonas.fro.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'axonasTayros'])->id,
            'address' => 'Πειραιώς 200, Ταύρος',
            'city' => 'Αθήνα',
            'phone' => 2103463816,
            'type_id' => 3,
            'website' => 'axonas.fro.gr',
            'approved' => 1,
            'about' => '
               Στα Φροντιστήρια ΑΞΟΝΑΣ Σ.ΒΑΡΑΤΑΣΗΣ η εκπαιδευτική φιλοσοφία υλοποιείται μέσα από μια σειρά ολοκληρωμένων προγραμμάτων διδασκαλίας και διαγωνισμάτων, διαφορετικών για κάθε τύπο λυκείου και για κάθε τάξη, με συγκεκριμένα χρονοδιαγράμματα ύλης, ώστε να αξιοποιείται ο χρόνος του μαθητή και η εξεταστέα ύλη να ολοκληρώνεται έγκαιρα προσφέροντας επαρκή χρόνο εποικοδομητικών επαναλήψεων και κατανόησης.
               Από την έναρξη της λειτουργίας των Φροντιστηρίων ΑΞΟΝΑΣ Σ.ΒΑΡΑΤΑΣΗΣ στην Αθήνα στη περιοχή του Ταύρου ήδη από το 1991 στόχος μας είναι η υπεύθυνη υποστήριξη της μαθητικής προσπάθειας, η απερίσπαστη ολοκλήρωση των σχολικών σπουδών των μαθητών μας και η επιτυχής μετάβασή τους στη φοιτητική ζωή.
               Η εκπαιδευτική μεθοδολογία που εφαρμόζουμε, εξελίσσουμε και διαρκώς προσαρμόζουμε στα νέα εκπαιδευτικά δεδομένα στηρίζεται στους έμπειρους καθηγητές μας, στο προγραμματισμό και στη προσωπική στήριξη στο κάθε μαθητή μας. Εφαρμόζουμε ένα ευέλικτο και ιδιαίτερο σύστημα διδασκαλίας, ώστε να αναδείξουμε τις δυνατότητες του κάθε μαθητή μας και να εξασφαλίσουμε την πρόοδό του
            ',
            'background' => $background,
        ]);

        new Portal($fake,1, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');



        /*=============== 7 ================*/

//        $fake = factory(App\Models\School::class)->create([
//            'user_id' => factory(App\User::class)->create(['name' => '', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
//            'address' => '',
//            'city' => 'Αθήνα',
//            'phone' => 210,
//            'type_id' => 3,
//            'website' => '',
//            'approved' => 1,
//            'about' => '
//
//            ',
//            'background' => $background,
//        ]);
//
//        new Portal($fake, 5, 'frontistirio');
//
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
//        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
//        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/'


    }



}
