<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria1 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;


        /*=============== 1  Oidaniko ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο ΟιδαΝικώ', 'email' => 'info@oidaniko.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'oidaniko'])->id,
            'address' => 'Μ. Αλεξάνδρου 88, Εύοσμος',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310776728,
            'type_id' => 3,
            'website' => 'www.oidaniko.edu.gr',
            'approved' => 1,
            'about' => '
            Η Γνώση είναι η Δύναμη που φέρνει την Επιτυχία.
            Στο Φροντιστήριο Οιδανικώ η φιλοσοφία μας αποτυπώνεται στο όνομά μας: η Γνώση φέρνει την Επιτυχία. Εκμεταλλευόμαστε όλες μας τις δυνατότητες, καινοτομούμε, δημιουργούμε πρωτοποριακές υπηρεσίες για να φτάσουμε στο στόχο μας: οι μαθητές μας να μπούνε στη μάχη των Πανελληνίων εξοπλισμένοι με όλα τα απαραίτητα εφόδια και να βγούνε νικητές, να εισαχθούν στην τριτοβάθμια εκπαίδευση στη σχολή της επιλογής τους.
            Στο Οιδανικώ πλάθουμε Νικητές.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Oidaniko');
        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/oidaniko_frontistirio/');
        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCY7I-xkpy-JPJGwMl641soA');

        /*=============== 2 PoukamisasThessKentro ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστηρια Πουκαμισάς Θεσσαλονίκη Κέντρο', 'email' => 'thessaloniki-kentro@poukamisas.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'PoukamisasThessKentro'])->id,
            'address' => 'Αγίας Θεοδώρας 15',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2313047479,
            'type_id' => 3,
            'website' => 'www.poukamisas.gr',
            'approved' => 1,
            'about' => '
Η σοφή στελέχωση μιας φροντιστηριακής επιχείρησης αξιώσεων αποτελεί έναν από τους κύριους οργανωτικούς πυλώνες της.
Κατά συνέπεια, στον Εκπαιδευτικό Όμιλο Πουκαμισάς  η ολοκληρωμένη γνώση η οποία παρέχεται δε θα μπορούσε παρά να αποτελεί το αντικείμενο μιας προσεκτικά μελετημένης διαχείρισης, εφόσον είναι το αποτέλεσμα μιας απόλυτα συντονισμένης και συλλογικής προσπάθειας. Η εμπειρία, η εκπαίδευση και οι αποδεδειγμένες ικανότητες των στελεχών μας αποτελούν παράγοντες εγγυημένης επιτυχίας. Η οργανωτική δομή και η ακριβής περιγραφή ρόλων και αρμοδιοτήτων εξασφαλίζουν την εύρυθμη λειτουργία και αποτελεσματικότητα του δικτύου.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 7, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook',  'https://www.facebook.com/poukamisasgr');
        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/explore/tags/poukamisas');
        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UC-MmG-HVlSH7sBEoVIxUs1A');
        Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/poukamisas');


        /*=============== 3 SystimaPylaia ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Σύστημα Πυλαία', 'email' => 'info@systimapylaia.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'systimaPylaia'])->id,
            'address' => 'Προφήτη Ηλία 35, Πυλαία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310303761,
            'type_id' => 3,
            'website' => 'www.systimapylaia.gr',
            'approved' => 1,
            'about' => '
Στόχος μας να υπηρετούμε την εκπαίδευση με τον καλύτερο δυνατό τρόπο ,να προσφέρουμε στους μαθητές μας ποιοτική παιδεία και εφόδια που θα τους βοηθήσουν να προχωρήσουν και να υλοποιήσουν τους στόχους τους.
Για εμάς η ποιότητα της παρεχόμενης εκπαίδευσης αποτέλεσε και συνεχίζει να αποτελεί πρωτεύον μέλημά μας και ως προς αυτήν την κατεύθυνση εργαζόμαστε όλοι στα Φροντιστήρια ΣΥΣΤΗΜΑ ΠΥΛΑΙΑΣ - ΣΥΣΤΗΜΑ ΠΑΝΟΡΑΜΑΤΟΣ - ΣΥΣΤΗΜΑ ΧΟΡΤΙΑΤΗ με συνέπεια και επαγγελματισμό πάντα αλλά και με την πεποίθηση ότι οι διακρίσεις και επιτυχίες των μαθητών μας δικαιώνουν το έργο μας.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Φροντιστήρια-Σύστημα-Πυλαία-Πανόραμα-Χορτιάτης-248719801908066');
        //        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
        //        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 4 SystimaXortiatis ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Σύστημα Χορτιάτης', 'email' => 'info@systimahortiatis.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'systimaXortiatis'])->id,
            'address' => 'Μεταμορφώσεως 3, Χορτιάτης',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310349840,
            'type_id' => 3,
            'website' => 'www.systimapylaia.gr',
            'approved' => 1,
            'about' => '
Στόχος μας να υπηρετούμε την εκπαίδευση με τον καλύτερο δυνατό τρόπο ,να προσφέρουμε στους μαθητές μας ποιοτική παιδεία και εφόδια που θα τους βοηθήσουν να προχωρήσουν και να υλοποιήσουν τους στόχους τους.
Για εμάς η ποιότητα της παρεχόμενης εκπαίδευσης αποτέλεσε και συνεχίζει να αποτελεί πρωτεύον μέλημά μας και ως προς αυτήν την κατεύθυνση εργαζόμαστε όλοι στα Φροντιστήρια ΣΥΣΤΗΜΑ ΠΥΛΑΙΑΣ - ΣΥΣΤΗΜΑ ΠΑΝΟΡΑΜΑΤΟΣ - ΣΥΣΤΗΜΑ ΧΟΡΤΙΑΤΗ με συνέπεια και επαγγελματισμό πάντα αλλά και με την πεποίθηση ότι οι διακρίσεις και επιτυχίες των μαθητών μας δικαιώνουν το έργο μας.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

//        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
        //        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
        //        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 5 Akadimia ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Ακαδημία', 'email' => 'info@academia.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'academia'])->id,
            'address' => 'Λεωφόρος Στρατού 28',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310858541,
            'type_id' => 3,
            'website' => 'academia.edu.gr',
            'approved' => 1,
            'about' => '
Το ποσοστό επιτυχίας είναι ένας αριθμός που για τους περισσότερους αποδεικνύει την απόδοση και την αποτελεσματικότητα. Για εμάς το σημαντικό είναι αυτό που εκφράζει αυτή η σχέση, που στην περίπτωσή μας, επιτυχία αποτελεί η πρόσβαση στις σχολές των πρώτων πέντε επιλογών που οι μαθητές μας έθεσαν ως στόχο.
Αυτό αποτελεί επιτυχία και για εμάς αυτή η σχέση ισορροπεί ετησίως πάνω από το 94%.
Στις αίθουσες του Φροντιστηρίου Ακαδημία καθηγητές και μαθητές κάθονται στο ίδιο στρογγυλό τραπέζι με βασικό κανόνα τη λειτουργία ολιγομελών τμημάτων 4-5 ατόμων ανά τάξη, μια αποδοτική σύνθεση, έτσι ώστε τα παιδιά να αναπτυχθούν συνεργατικά και κοινωνικά, ξεδιπλώνοντας τις δεξιότητες και ικανότητές τους.
Όσον αφορά τς νέες τεχνολογίες, εφαρμόζουμε την εκπαίδευση με χρήση διαδραστικού πίνακα και μια εξελιγμένη ψηφιακή πλατφόρμα επικοινωνίας με τους μαθητές αλλά και τους γονείς. Όλες οι αίθουσες εντάσσονται στο σύγχρονο περιβάλλον του φροντιστηρίου, είναι ευήλιες και διαθέτουν κλιματισμό τελευταίας τεχνολογίας.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/AcademiaFrontistirio');
        //        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
        //        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 6  Analogia ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Αναλογία, Ωραιόκαστρο', 'email' => 'analogia.oraio@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'analogia'])->id,
            'address' => 'Δημοκρατίας 26, Ωραιόκαστρο',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2315313699,
            'type_id' => 3,
            'website' => 'www.analogiaf.gr',
            'approved' => 1,
            'about' => '
            Τα φροντιστήρια ΑΝΑΛΟΓΙΑ δραστηριοποιούνται στο χώρο της Μέσης Εκπαίδευσης από το 2006. Το πρώτο φροντιστήριο δημιουργήθηκε στην περιοχή Σταυρούπολη Θεσσαλονίκης και το 2010 ακολούθησε το δεύτερο φροντιστήριο στο Ωραιόκαστρο Θεσσαλονίκης.
            Στόχος των φροντιστηρίων ΑΝΑΛΟΓΙΑ είναι η παροχή εκπαιδευτικών υπηρεσιών με γνώμονα την υποστήριξη των μαθητών και των γονέων τους στην προσπάθειά τους για εισαγωγή στην τριτοβάθμια εκπαίδευση.
            Οι Υπηρεσίες μας
            εξειδικευμένο διδακτικό προσωπικό σε κάθε εκπαιδευτικό αντικείμενο (η επιλογή των εκπαιδευτικών γίνεται από τους υπεύθυνους του φροντιστηρίου στον κάθε τομέα σπουδών: τομέας φυσικής – χημείας, τομέας μαθηματικών, τομέας φιλολογικός)
            πρόσθετα ενισχυτικά μαθήματα σε όλη τη διάρκεια της χρονιάς, με στόχο την κάλυψη κενών του παρελθόντος και την εστίαση σε λεπτομέρειες της διδακτέας ύλης
            κατάρτιση ατομικού προγράμματος διαβάσματος – μελέτης, με στόχο να βοηθηθεί ο μαθητής στην αποδοτικότερη οργάνωση του χρόνου του
            τμήματα ολιγομελή – ομοιογενή
            διαγωνίσματα προσομοίωσης των πανελλαδικών εξετάσεων (από την αρχή του σχολικού έτους πραγματοποιείται η κατάρτιση ετησίου προγράμματος διαγωνισμάτων σε κάθε διδακτικό αντικείμενο)
            επαναληπτικά διαγωνίσματα (πρόκειται για διαγωνίσματα που ακολουθούν μετά τις εορτές των Χριστουγέννων και του Πάσχα)
            τακτική ενημέρωση των γονέων για την πρόοδο των μαθητών (κάθε χρόνο ανά 2 – 3 μήνες πραγματοποιείται ενημέρωση γονέων για την πρόοδο των μαθητών)
            οργάνωση ημερίδας επαγγελματικού προσανατολισμού (στο τέλος κάθε σχολικού έτους διοργανώνεται ημερίδα επαγγελματικού προσανατολισμού με στόχο την ενημέρωση γονέων και μαθητών: 1. για τις αλλαγές στο εκπαιδευτικό σύστημα, 2. για τις δυνατότητες επαγγελματικής αποκατάστασης ανά σχολή, 3. για τον τρόπο κατάρτισης του μηχανογραφικού)
            διανομή στους μαθητές εκπαιδευτικού υλικού – βοηθημάτων των καθηγητών του φροντιστηρίου ανά εκπαιδευτικό αντικείμενο
            συνεργασία με ειδικούς για αθλητική προετοιμασία
            χρήση διαδραστικού πίνακα
            εγκαταστάσεις υψηλού επιπέδου
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/analogiaf');
        //        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
        //        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 7 Analysi ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Ανάλυση', 'email' => 'pliolios@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'analysi'])->id,
            'address' => 'Μακεδονίας & Γ. Ιωάννου, Τρίλοφος',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2392062209,
            'type_id' => 3,
            'website' => 'www.analisi.edu.gr',
            'approved' => 1,
            'about' => '
Το Φεβρουάριο του 1992 ιδρύσαμε τα φροντιστήρια αναλυση με κινητήρια δύναμη την αγάπη μας για τη διδασκαλία και το ζήλο για τη μετάδοση γνώσεων σε νέους ανθρώπους με όραμα και στόχους. Αργότερα μεταφερθήκαμε σε ιδιόκτητες εγκαταστάσεις και συνεχίσαμε να παρέχουμε - μέχρι σήμερα- με απόλυτη επιτυχία υψηλό επίπεδο σπουδών. Η πολύχρονη πορεία μας στον εκπαιδευτικό χώρο, που υπερκαλύπτει πλέον δύο δεκαετίες, σε συνδυασμό με τα αποτελέσματα εκατοντάδων σπουδαστών μας που εξασφαλίζουν την επιθυμητή θέση στην τριτοβάθμια εκπαίδευση αποτελούν την πιο ισχυρή απόδειξη της ποιότητας των υπηρεσιών μας και δικαιώνουν κάθε χρόνο την απόφαση γονέων και μαθητών να μας εμπιστευτούν.
Το ταξίδι στη γνώση συνεχίζεται, με τις αλλαγές που συντελούνται στο λύκειο να καθιστούν την παρουσία μας απαραίτητη και τη συμβολή μας πολύτιμη στον αγώνα των μαθητών για την εκπλήρωση των ονείρων τους.
Με το ίδιο πάντα πάθος και την ίδια υπευθυνότητα, αλλά με πολύ μεγαλύτερη εμπειρία και βάθος στην εκπαιδευτική διαδικασία πορευόμαστε σταθερά μέχρι σήμερα. Ως εκ τούτου, με θέση πάντα μπροστά από τις εξελίξεις στην εκπαίδευση, παραμένουμε σταθερή αξία στο χώρο της παιδείας έτοιμοι για μοναδικές συνεργασίες με γονείς και μαθητές με κοινό όραμα την απόλυτη επιτυχία…
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Φροντιστηρια-αναλυση-925884437426606');
        //        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
        //        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');


        /*=============== 8 Axiotis  ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Αξιώτη, Τούμπα', 'email' => 'mail@axiotis.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'axiotis'])->id,
            'address' => 'Γρ. Λαμπράκη 209, Μαλακοπή',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310944449,
            'type_id' => 3,
            'website' => 'axiotis.gr',
            'approved' => 1,
            'about' => '
Τα φροντιστήρια ΑΞΙΩΤΗ, λειτουργώντας με συνέπεια και μεθοδικότητα, παρέχουν υψηλής ποιότητας εκπαιδευτικές υπηρεσίες προετοιμάζοντας το μαθητή για την εισαγωγή του στα τμήματα των Ανώτερων Εκπαιδευτικών και Τεχνολογικών ιδρυμάτων της χώρας.

Η άρτια κατάρτιση των καθηγητών, η επάρκεια και αξιοπιστία του παρεχόμενου διδακτικού υλικού, η προσωπική υποστήριξη του κάθε μαθητή αλλά και το οικείο και φιλικό περιβάλλον εγγυώνται την κατάλληλη γνωστική και ψυχολογική προετοιμασία των μαθητών.

Ο εντοπισμός ενδεχόμενων αδυναμιών και δυσκολιών στην αφομοίωση των παρεχόμενων γνώσεων αποτελεί πρωταρχικό μας μέλημα και γι’αυτό υπάρχει διαρκής και επί της ουσίας έλεγχος των παιδιών με σκοπό την αντιμετώπισή τους.

Οι πανελλαδικές εξετάσεις αποτελούν μια πρώτη πρόκληση για τους έφηβους μαθητές. Η επιτυχία σε αυτές προϋποθέτει την κατάλληλη γνωστική κατάρτιση, την όξυνση της κριτικής σκέψης, την δυνατότητα πραγματοποίησης συνδυαστικών συλλογισμών αλλά και την ψυχολογική σταθερότητα και ισορροπία. Απαιτείται λοιπόν, η συνολική προετοιμασία του μαθητή που καλείται να μάθει να ανταποκρίνεται με ηρεμία, μεθοδικότητα και γνώση.

Αυτός είναι ο λόγος για τον οποίο ο σεβασμός της μοναδικότητας του κάθε παιδιού και η παράλληλη αξιοποίηση των δυνατοτήτων του αποτελεί για μας σταθερή επιδίωξη. Στόχος μας είναι να είμαστε όχι απλά κοντά στο μαθητή αλλά ΜΑΖΙ με το μαθητή στην προσπάθεια για την επιτυχία του.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontAxioti');
        //        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
        //        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 9  Axonas ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Άξονας', 'email' => 'info@axonas.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'axonas'])->id,
            'address' => 'Λεωφόρος Βασιλίσσης Όλγας 107',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310860960,
            'type_id' => 3,
            'website' => 'axonas.edu.gr',
            'approved' => 1,
            'about' => '
Στο φροντιστηρίο ΑΞΟΝΑΣ δημιουργήσαμε ένα ολοκληρωμένο πρόγραμμα σπουδών με στόχο να προσφέρουμε την πιο ολοκληρωμένη επιλογή εκπαίδευσης.

Επιλογή αντάξια των προσδοκιών σας και των πιο απαιτητικών πλέον αναγκών που δημιουργεί η εισαγωγή στην τριτοβάθμια εκπαίδευση.
Οι συνεχόμενες αλλαγές στην εκπαίδευση και η αντιστοιχία των σχολών στα επιστημονικά πεδία θέτουν έναν πολύπλοκο γρίφο στην επιλογή της εκπαιδευτικής πορείας του κάθε μαθητή.

Έμπειροι καταξιωμένοι καθηγητές, πρότυποι εκπαιδευτικοί μέθοδοι, σύγχρονα εποπτικά μέσα , σε συνδυασμό με τον πρωτοποριακό θεσμό του προσωπικού Εκπαιδευτικού Συμβούλου Καριέρας θα αναδείξουν ,θα αναπτύξουν και θα αξιοποιήσουν πλήρως τις ικανότητες του κάθε μαθητή ώστε να πετύχουμε το επιθυμητό αποτέλεσμα.

Κλειστά τμήματα και εξατομικευμένα προγράμματα αποτελούν βασικές μας αρχές και μονόδρομο για την επιτυχία. Θα είμαστε δίπλα σας σε κάθε βήμα προς τον κοινό μας στόχο
            ',
            'background' => $background,
        ]);

        new Portal($fake, 9, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/axonas.edu');
        //        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
        //        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 10  Aristeia ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Αριστεία', 'email' => 'info@edu-aristeia.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'aristeia'])->id,
            'address' => 'Μεγάλου Αλεξάνδρου 3-5, Αμπελόκηποι',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310749226,
            'type_id' => 3,
            'website' => 'www.edu-aristeia.gr',
            'approved' => 1,
            'about' => '
            Ολιγομελή τμήματα των 4 – 6 ατόμων.
            Ευέλικτο πρόγραμμα σπουδών με επιλογή μαθημάτων της αρεσκείας σας.
            Διανομή σχολικών βοηθημάτων (CORPORA).
            Δωρεάν παροχή ίντερνετ (free Wifi).
            Ώρες συνεργασίας των μαθημάτων με τους καθηγητές εκτός του καθορισμένου προγράμματος διδασκαλίας.
            Τακτικά διαγωνίσματα για τη συνεχή αξιολόγηση των μαθητών.
            Πρόσθετες ώρες διδασκαλίας πριν την έναρξη των εξετάσεων ακόμη και σε μαθήματα που δεν επέλεξαν να διδαχθούν οι μαθητές κατά τη διάρκεια της σχολικής χρονιάς.
            Βιβλιοθήκη – Αναγνωστήριο
            Συνεχείς ενημερώσεις γονέων για την πρόοδο των μαθητών.
            Ενημέρωση των μαθητών για τις σχολές Α.Ε.Ι και Τ.Ε.Ι καθώς και για τις επαγγελματικές προοπτικές που προσφέρουν.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 7, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistirio.aristeia');
        //        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
        //        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 11  Γνωθι Σαυτόν================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Γνώθι Σαυτόν', 'email' => 'info@gnothi.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'gnothi'])->id,
            'address' => 'Καμπουρίδου 30, Πανόραμα',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2314025849,
            'type_id' => 3,
            'website' => 'www.gnothi.gr',
            'approved' => 1,
            'about' => '
Με πολύ κέφι, όρεξη και καλή διάθεση μα πάνω από όλα με κίνητρό μας την αγάπη για τους μαθητές δημιουργήσαμε το φροντιστήριο μέσης εκπαίδευσης «γνώθι σαυτόν» στο Πανόραμα Θεσσαλονίκης. Όλοι οι διδάσκοντες, μια ομάδα νέων και έμπειρων εκπαιδευτικών, δίνουμε νέα πνοή στην εκπαίδευση, εφαρμόζουμε καινοτόμα εκπαιδευτικά προγράμματα και ξανακάνουμε τη διαδικασία της μάθησης ευχάριστη και απολαυστική! Στόχος του φροντιστηρίου μέσης εκπαίδευσης γνώθι σαυτόν είναι να προσφέρει ολοκληρωμένες και ποιοτικές υπηρεσίες στους μαθητές, προετοιμάζοντας τους άριστα για την επιτυχία στις εξετάσεις μα και εφοδιάζοντάς τους με αξίες και πολύτιμες γνώσεις, απαραίτητα στοιχεία για τη γενική καλλιέργεια του πνεύματος και την ανάπτυξη της κριτικής τους σκέψης. Το φροντιστήριο γνώθι σαυτόν, ένας φορέας παιδείας και εκπαίδευσης, θα είναι αρωγός και συνοδοιπόρος στα όνειρα του κάθε μαθητή ξεχωριστά τόσο με την άρτια προετοιμασία του καθενός για τις εξετάσεις όσο και με τη στήριξη σε κάθε στάδιο αυτής της πορείας προς την επιτυχία!
Σας περιμένουμε για να γνωριστούμε και να συζητήσουμε στον ανακαινισμένο χώρο μας στο Πανόραμα Θεσσαλονίκης!

Αποκλειστικά κλειστά τμήματα
Απόλυτη εξειδίκευση στο θεωρητικό προσανατολισμό / κατεύθυνση
Εξειδικευμένο προσωπικό με πιστοποίηση ελληνικών και ξένων πανεπιστημίων
Πρωτοποριακές μέθοδοι διδασκαλίας
Διαδραστικοί πίνακες
Ευχάριστος και άνετος χώρος
Ανταγωνιστικές τιμές
Έμφαση στην επικοινωνία και το διάλογο
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/gnothi.gr');
        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/gnothi_panorama');
        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/gnothigr');



        /*=============== 12  Δημήτρια ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Δημήτρια', 'email' => 'sykies@dimitriaedu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'dimitria'])->id,
            'address' => 'Επταπυργίου 115, Συκιές',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310215187,
            'type_id' => 3,
            'website' => 'dimitriaedu.gr',
            'approved' => 1,
            'about' => '
Οι σημερινές δύσκολες κοινωνικές και οικονομικές συνθήκες σε συνδυασμό με τις αλλαγές που παρατηρούνται στο εκπαιδευτικό σύστημα επιτείνουν την αγωνία για την επαγγελματική αποκατάσταση των παιδιών σας.

Τα Φροντιστήρια Δημήτρια προσφέρουν όλα τα εχέγγυα για μια εξασφαλισμένη εισαγωγή σε κάποιο Πανεπιστημιακό Ίδρυμα. Κοντά μας οι μαθητές μπορούν να εφοδιαστούν με όλες τις απαραίτητες γνώσεις για να ανταπεξέλθουν στις υψηλές απαιτήσεις των Πανελλαδικών εξετάσεων καθώς και να οδηγηθούν στην καταλληλότερη επαγγελματική επιλογή μέσω της υπεύθυνης επιστημονικής στήριξης που παρέχεται από ειδικούς συμβούλους σταδιοδρομίας. Ελάτε να μας γνωρίσετε και να διαπιστώσετε την υπευθυνότητα και τον επαγγελματισμό μας.

0 ρόλος των Φροντιστηρίων μας δεν περιορίζεται μόνο στη διδακτική ύλη, αλλά και στη διατήρηση της καλής ψυχικής διάθεσης των παιδιών μας.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/FRONTISTIRIADIMITRIA');
        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/frontistiria_dimitria');
        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCVokf2RUmf6yQFZuQ4yiFGQ');
        Scholio::portalSocial($fake, 'google', 'https://plus.google.com/111446848507619323362');






        /*=============== 13  Διακρότημα ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Διακρότημα Θεσσαλονίκη', 'email' => 'branch037@edu.diakrotima.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'diakrotimaThess'])->id,
            'address' => 'Βαφοπούλου 27',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310410344,
            'type_id' => 3,
            'website' => 'www.diakrotima.gr',
            'approved' => 1,
            'about' => '

            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Diakrotima.Frontistiria');
        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/diakrotima_ntepo');
        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCln_zr3t2E35dLQPvHXtbQA');



    }

}
