<?php

use Illuminate\Database\Seeder;

class Frontistirio extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        /*===============  7 Φροντιστήρια Μ.Ε.Υποδομή ================*/
        $school7 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Υποδομή', 'email' => 'info@ypodomi.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ypodomi'])->id,
            'address' => 'Κουγιουμτζίδη 7',
            'city' => 'Γιαννιτσά',
            'phone' => 2382027799,
            'type_id' => 3,
            'website' => 'ypodomi.com',
            'approved' => 1,
            'about' => 'Αγαπητέ μαθητή/τρια, γνωρίζουμε πολύ καλά ότι δεν υπάρχει τίποτε καλύτερο και υψηλότερο για ένα νέο άνθρωπο, απόφοιτο Λυκείου, από το να επιτύχει την είσοδό του στο Πανεπιστήμιο. Όταν μάλιστα η είσοδος αυτή ανταποκρίνεται και στην πρώτη σχολή την οποία επέλεξε, τότε είναι σίγουρο πως η επαγγελματική του σταδιοδρομία είναι εξασφαλισμένη και επιτυχημένη.</p>
<p>Η επιτυχία σου δεν είναι θέμα <strong>τύχης, επιφάνειας και εντύπωσης</strong>, αλλά <strong>μόχθου, βάθους και ουσίας</strong>. Η υλοποίηση των υψηλών στόχων προϋποθέτει όχι μόνο ατομική θέληση, άλλα και υπεύθυνη προετοιμασία, τόσο σε γνωστικό όσο και σε ψυχολογικό επίπεδο.</p>
<p>Το πρόγραμμα μαθημάτων του φροντιστηρίου στηρίζεται στις παρακάτω αρχές:</p>
<p style="text-align: center;"><strong>Διαρκής ανανέωση και βελτίωση</strong><br /><strong>Κλειστά ομοιογενή τμήματα και γκρουπ</strong><br /><strong>Επιλογή άριστα καταρτισμένων καθηγητών</strong><br /><strong>Υψηλό επίπεδο διδασκαλίας</strong><br /><strong>Καλλιεργούμε και αναπτύσσουμε μεθόδους</strong><br /><strong>Επαναληπτικά Διαγωνίσματα </strong><br /><strong>Πρόσθετες ώρες και διαγωνίσματα</strong><br /><strong>Συνεργασία με τους γονείς</strong><br /><strong>Σύσκεψη Καθηγητών</strong><br /><strong>Οργάνωση και λειτουργικότητα</strong></p>
<p><br /><strong>Διαρκής ανανέωση και βελτίωση</strong></p>
<p>Η ανοδική πορεία μας είναι σταθερή και η εξέλιξη συνεχής. Κανένα άλλο Φροντιστήριο δεν έχει να παρουσιάσει τόσες επιτυχίες, τον πρώτο χρόνο λειτουργίας του. Η επιτυχία στις ανώτατες σχολές εξασφαλίζεται:</p>
<p><strong>Με ανελλιπή παρακολούθηση των μαθημάτων μας</strong><br /><strong>Με σκληρή, επίπονη και επίμονη προσωπική μελέτη</strong><br /><strong>Με υποχρεωτική συμμετοχή στα διαγωνίσματα</strong></p>
<p><strong>Κλειστά ομοιογενή τμήματα και γκρουπ</strong></p>
<p>Οι μαθητές χωρίζονται με βάση το πραγματικό τους επίπεδο και όχι με κριτήριο το λύκειο στο οποίο φοιτούν. Το πρόγραμμα του κάθε τμήματος θα είναι ανάλογα διαμορφωμένο και οι μαθητές που θα φοιτούν σ’ αυτά τα τμήματα θα έχουν την δυνατότητα να δουλέψουν σωστά, ώστε και στο σχολείο να μην έχουν καμία δυσκολία, αλλά και το σπουδαιότερο, με άνεση θα μπορούν να στοχεύουν το άριστα στις εξετάσεις της Α’ ,  Β’ Λυκείου, όπως και στις Πανελλαδικές Εξετάσεις της Γ΄ Λυκείου.</p>
<p><strong>Επιλογή άριστα καταρτισμένων καθηγητών</strong></p>
<p>Η επιλογή των καθηγητών γίνεται με αυστηρά κριτήρια, τα οποία στηρίζονται στις εξής αρχές:<br />Την άρτια επιστημονική τους κατάρτιση<br />Την πολυετή τους πείρα<br />Την εργατικότητά τους<br />Το ήθος τους<br />Το ανθρωπιστικό και παιδαγωγικό τους υπόβαθρο<br />Το ενδιαφέρον τους για κάθε μαθητή χωριστά<br />Το σεβασμό για το γονιό</p>',
            'logo' => 'fake/ypodomi-logo.png',
            'background' => $back7,
        ]);

        

        /*===============  9 Ευρωγνώση Τσιμισκή ================*/
        $school9 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ευρωγνώση Τσιμισκή', 'email' => 'tsimiski@eurognosi.info', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'evrognosi'])->id,
            'address' => 'Τσιμισκή 102 & Παύλου Μελά',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310262255,
            'type_id' => 4,
            'website' => 'eurognosi.com',
            'approved' => 1,
            'about' => 'Εκπαιδευτικός Oργανισμός Ευρωπαϊκών Γλωσσών και Πληροφορικής στην Νοτιοανατολική Ευρώπη. Επί σειρά ετών η ΕΥΡΩΓΝΩΣΗ αποτελεί την πρώτη επιλογή εκπαιδευτικού οργανισμού ξένων γλωσσών και πληροφορικής για όλους τους Έλληνες.</p>
<p>Τα <strong>Κέντρα ξένων γλωσσών ΕΥΡΩΓΝΩΣΗ</strong> ιδρύθηκαν το 1989 με σκοπό να παρέχουν σπουδές Ευρωπαϊκών Γλωσσών υψηλής ποιότητας για όλες τις ηλικίες των σπουδαστών της. Σήμερα είναι η 1η Δύναμη στις Ξένες Γλώσσες και την Πληροφορική και ο μεγαλύτερος φορέας ιδιωτικής εκπαίδευσης στην Ελλάδα, την Κύπρο και τη Ρουμανία, με 350 κέντρα Ξένων Γλωσσών και Πληροφορικής σε λειτουργία και περισσότερους από 60.000 σπουδαστές σε μέση ετήσια βάση, αξιοποιώντας έτσι με τον καλύτερο τρόπο τις στρατηγικές συμφωνίες που έχει συνάψει με κορυφαίους εκπαιδευτικούς οργανισμούς παγκοσμίως.</p>
<p>Η ΕΥΡΩΓΝΩΣΗ είναι αδιαμφισβήτητα ο LEADER στον χώρο των εκπαιδευτικών επιχειρήσεων. Παρέχει άριστες εκπαιδευτικές υπηρεσίες με προγράμματα που καλύπτουν το φάσμα των ηλικιών από παιδιά 4 ετών μέχρι ενήλικες και εξειδικευμένα <strong>επιχειρησιακά προγράμματα</strong>, χρησιμοποιώντας τις πιο σύγχρονες μεθόδους διδασκαλίας σε συνδυασμό με καινοτόμες τεχνολογίες. Ειδικότερα, παρέχει <strong>παιδικά προγράμματα, προγράμματα φοιτητών, προγράμματα ενηλίκων</strong> καθώς και ειδικά <strong>εντατικά μαθήματα</strong> για πτυχία ξένων γλωσσών. Για τον λόγο αυτό το όνομά μας είναι από τα πιο αναγνωρίσιμα brands στον ελλαδικό χώρο και όχι μόνο, συνώνυμο της ποιοτικής και αποτελεσματικής εκμάθησης ξένων γλωσσών και πληροφορικής.</p>
<p>Οι χιλιάδες των αποφοίτων και των ενεργών, ευχαριστημένων, σπουδαστών μας κρατούν το όραμα ζωντανό και αποτελούν την κινητήρια δύναμη για την συνεχή εξέλιξη της ΕΥΡΩΓΝΩΣΗ και για νέες κατακτήσεις στον χώρο της ξενόγλωσσης εκπαίδευσης. Ελάτε σε ένα από τα κέντρα ΕΥΡΩΓΝΩΣΗ και απολαύστε μια πραγματικά μοναδική μαθησιακή εμπειρία με την μέθοδο Learn® που μόνο η ΕΥΡΩΓΝΩΣΗ μπορεί να σας παρέχει!<br /><br /></p>
<h2>Όμιλος με Όραμα</h2>
<p><br />Ακαδημαϊκή υπεροχή στους μαθητές μας μέσα από καινοτομία, συστηματικότητα, κερδοφόρο δίκτυο και δυνατό brand.</p>
<p>Το όραμά μας είναι η ΕΥΡΩΓΝΩΣΗ να γίνει ο <strong>παγκόσμιος ηγέτης στο χώρο της ξενόγλωσσης εκπαίδευσης</strong>, υποστηρίζοντας σήμερα ένα σύνολο 350 εταιριών που παντρεύουν το κοινωνικό έργο της εκπαίδευσης και την απόλυτη επιχειρηματικότητα με άξονα την ποιότητα και τις ξεκάθαρες οργανωτικές δομές.</p>',
            'logo' => 'fake/eurognosi-logo.png',
            'background' => $back9,
        ]);

        /*===============  10 Danza Fuerte ================*/
        $school10 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Danza Fuerte', 'email' => 'danzafuerte@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'danza'])->id,
            'address' => 'Αριστοτέλους 23, Κέντρο',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310262255,
            'type_id' => 10,
            'website' => 'danzafuerte.gr',
            'approved' => 1,
            'about' => '<div>Μέσα στα 20 χρόνια λειτουργίας εχουμε αποκτήσει την εμπειρια να καλύπτουμε τις αναγκες του κάθε μαθητη ξεχωριστά. Μια σχολή με προσωπικότητα και ενδιαφέρον. Μια μεγάλη οικογένεια χορού. Όλο το προσωπικό αλλά και ο Διευθυντής της σχολής είναι πάντα κοντά  στους μαθητές.</div>
<div> </div>
<div>
<h3 class="bold-style">ΠΡΑΓΜΑΤΟΠΟΙΟΥΜΕ</h3>
<div>Πάνω από 30 άτομα προσωπικού βρίσκονται καθημερνά στην υπηρεσία των μαθητών για να καλύψουν ακόμα και τις πιο υψηλές σας απαιτήσεις. Όλοι τους επαγγελματίες και καταρτησμένοι αλλά πάνω από όλα άνθρωποι με προσωπικότητα και ενδιαφέρον.</div>
<div> </div>
<div>
<h3 class="bold-style">ΔΗΜΙΟΥΡΓΟΥΜΕ</h3>
<div>Η σχολή χορού είναι ένας ζωντανός οργανισμός. Δεν μένει στάσιμη. Εξελίσσεται με βάση τις απαιτήσεις των μαθητών. Νέα είδη χορών προστίθενται συνεχώς,νέα προγράμματα χορού προσαρμοσμένα στις ανάγκες των μαθητών, party αλλά και εκδηλώσεις παγκόσμιου βεληνεκούς όπως το Record Guinness.</div>
<div> </div>
<div>
<h3 class="bold-style">Η ΣΧΟΛΗ</h3>
<p>     Η Σχολή Χορού Danza Fuerte με τη<strong> 20 έτη</strong> εμπειρία τους, μετατρέπει την τέχνη του χορού σε ένα είδος προσιτό σε όλες τις ηλικίες, για όλα τα γούστα και σε πολύ προσιτές τιμές ώστε να έχουν πρόσβαση όλοι όσοι θέλουν να εκφράσουν συναισθήματα και συνδυάσουν αρμονικά έκφραση και κίνηση.</p>
<p>Μαθαίνει τους ανθρώπους ν\' αποκτήσουν εμπειρίες με το σώμα τους, να κινηθούν, να χορέψουν. Στηρίζει τους εραστές της τέχνης και έκφρασης του χορού.</p>
<p>     Οι Σχολές Χορού Danza Fuerte βρίσκονται κοντά σας εδώ και 20 χρόνια στην καρδιά της Θεσσαλονίκης  Αριστοτέλους 23 -1<sup>ος</sup> (κεντρικό κατάστημα) και Βασιλέως Ηρακλείου 30 – 2<sup>ος</sup> (παράρτημα) διδάσκοντας Λατινοαμερικάνικους (Rumba, Mambo,Cha Cha Cha, Swing, Jive, Paso Doble), Eυρωπαϊκούς (Tango, Waltz,Fox Trot, Vienna Waltz, Quick Step), Eλληνικούς και Mοντέρνους χορούς (Hip Hop, Street Dance, Free Style, R&amp;B). Επίσης υπάρχει η δυνατότητα να ασχοληθεί κανείς με Αθλητικό χορό - Οriental - Τango Αrgentine αλλά και με Kουβανέζικους ( Salsa, Bachata, Merenque, Rueda,Afro ). Ειναι πρωτοπόρος στα επαγγελματικά προγράμματα και δίνει τη δυνατότητα απόκτησης πτυχίων χορού καθώς στη σχολή διδάσκουν πλήθος καταξιωμένων και έμπειρων καθηγητών.</p>
<p>     Μέσα στα 20 χρόνια λειτουργίας έχει αποκτήσει πρωταθλήματα και κύπελλα Ελλάδος, τις μεγαλύτερες διακρίσεις σε διαγωνισμούς εντός και εκτός Ελλάδας. Τον Ιούνιο του 2014 επιτυγχάνει τη μεγαλύτερη διάκριση σε παγκόσμιο επίπεδο διοργανώνοντας τη μεγαλύτερη Salsa Rueda στον κόσμο κερδίζοντας μία θέση στο Βιβλίο των Record Guinness!!! </p>
</div>
</div>
</div>',
            'logo' => 'fake/danzafuerte-logo.png',
            'background' => $back10,
        ]);
    }
}
