<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria17 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;



     /*=============== 1 Ανατολικό, Καλαμαριά ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Ανατολικό, Καλαμαριά', 'email' => 'anatoliko@anatoliko.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'anatolikoKalamaria'])->id,
         'address' => 'Κυριακίδου 1, Καλαμαριά',
         'region' => 'Καλαμαριά',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310446816,
         'type_id' => 3,
         'website' => 'anatoliko.edu.gr',
         'approved' => 1,
         'about' => '
              Καθένας μας είναι μοναδικός.
              Έχει διαφορετικά όνειρα, διαφορετικούς στόχους, διαφορετικές ανάγκες. Για τον καθένα μας, η επιτυχία έχει διαφορετικό όνομα. Στα Φροντιστήρια Ανατολικό, κάθε μαθητής και μαθήτρια είναι για εμάς μοναδικός…
              Ο στόχος σου είναι στόχος μας.
              Αν δεν έχεις κατασταλάξει στον στόχο σου, σε βοηθάμε να τον καθορίσεις: με σύγχρονα επιστημονικά εργαλεία, όπως τα online τεστ προσωπικότητας και επαγγελματικών κλήσεων και με συμβουλευτική καθοδήγηση από τον υπεύθυνο σπουδών.
              Οι ανάγκες σου είναι η προτεραιότητά μας.
              Με συστηματική παρακολούθηση από τον Προσωπικό Καθηγητή σου, καταγράφουμε σε συνεχή βάση τις επιδόσεις σου και εντοπίζουμε έγκαιρα τυχόν αδυναμίες. Σε διαρκή συνεννόηση με τους Καθηγητές σου, προτείνουμε το κατάλληλο πρόγραμμα ενίσχυσης και κάλυψης αναγκών, συνδυάζοντας με τον καλύτερο τρόπο το πρόγραμμα του τμήματος με ατομικά υποστηρικτικά μαθήματα.
              Η επιτυχία σου είναι η αποστολή μας.
              Στεκόμαστε δίπλα σου. Μαζί στην προσπάθεια και τις αγωνίες σου, μαζί στις δυσκολίες και στην επιτυχία σου.
              ♦  Διερεύνηση και καθορισμός των στόχων του μαθητή.
              Ο μαθητής συμπληρώνει το ειδικό τεστ προσωπικών κλίσεων και επαγγελματικού προσανατολισμού Horizon της Orientum, μια εξειδικευμένης εταιρείας συμβούλων επαγγελματικού προσανατολισμού. Με βάση τα αποτελέσματα του τεστ και μετά από ανάλυση/συζήτηση με τον μαθητή και τους γονείς καθορίζονται από κοινού οι στόχοι της προετοιμασίας για την Ανώτατη Εκπαίδευση.
              ♦  Διαγνωστικά τεστ.
              Για την καλύτερη αποτύπωση των ιδιαίτερων αναγκών του μαθητή πριν την οριστική ένταξή του στο φροντιστηριακό πρόγραμμα, χρησιμοποιούνται διαγνωστικά τεστ γνώσεων των βασικών αντικειμένων.
              ♦  Ένταξη του μαθητή στην κατάλληλη ομάδα.
              Οι Υπεύθυνοι Σπουδών, με βάση το προφίλ και τα ιδιαίτερα χαρακτηριστικά του μαθητή, τον εντάσσουν στην κατάλληλη ομάδα, στο κατάλληλο τμήμα προετοιμασίας.
              ♦  Εποπτεία της πορείας του μαθητή από τον καθηγητή - Μέντορά του.
              Κάθε μαθητής έχει τον δικό του καθηγητή - Μέντορα, που είναι επιφορτισμένος με την επίβλεψη της πορείας του μαθητή και την άμεση επαφή με τους γονείς για κάθε θέμα που μπορεί να ανακύψει.
              ♦  Πρόγραμμα ενισχυτικών ατομικών μαθημάτων, παράλληλα με τα μαθήματα του τμήματος. Σε συνεργασία Μέντορα με τον μαθητή και τους γονείς του κι εφόσον κριθεί απαραίτητο, είναι δυνατό να προστεθούν ατομικά μαθήματα υποστήριξης για τον μαθητή, είτε για να καλύψει τυχόν κενά προηγουμένων ετών, είτε για να εξασφαλίσει πρόσθετη υποστήριξη σε ειδικά αντικείμενα των μαθημάτων.
              ♦ On-line ενημέρωση γονέων για την πορεία του μαθητή.
              Όλες οι παράμετροι της πορείας του μαθητή είναι συνεχώς στη διάθεση του γονέα: με την υπηρεσία MyAnatoliko έχετε πρόσβαση άμεσα στο κινητό, το laptop, το tablet ή τον υπολογιστή της δουλειάς σας, σε βαθμούς διαγωνισμάτων, απουσίες, σχόλια καθηγητών, συγκριτικά στοιχεία επιδόσεων κτλ.
              ♦  Ατομική συμπλήρωση μηχανογραφικού δελτίου προτιμήσεων ΑΕΙ/ΤΕΙ.
              Κάθε μαθητής συμπληρώνει το μηχανογραφικό του δελτίο μετά τις Πανελλήνιες Εξετάσεις με την υποστήριξη του Υπεύθυνου Σπουδών σε προκαθορισμένο ατομικό ραντεβού.
              Έλα σε έ­να από τα Φροντιστήρια Ανατολικό και κλείσε ραντεβού για να συζητήσουμε.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio', 20);

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/anatoliko.gr/');
     Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/user/AnatolikoFrontistir');



     /*=============== 2 ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => '', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
         'address' => '',
         'region' => '',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310,
         'type_id' => 3,
         'website' => '',
         'approved' => 1,
         'about' => '

            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio', 50);

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

//     Scholio::portalSocial($fake, 'facebook', '');



     /*=============== xx  ================*/

//     $fake = factory(App\Models\School::class)->create([
//         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
//         'address' => '',
//         'region' => '',
//         'city' => 'Αθήνα',
//         'phone' => 210,
//         'type_id' => 4,
//         'website' => '',
//         'approved' => 1,
//         'about' => '
//
//            ',
//         'background' => $background,
//     ]);
//
//     new Portal($fake, 5, 'frontistirio',50);
//
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Τούρκικα');
//
//
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');
//
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');
//
//
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'LEGO Education');
//
//     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');


    }



}
