<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria3 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;

        /*=============== 1 Διανόηση ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστηρίο Διανόηση', 'email' => 'nikbrks@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'dianoisi'])->id,
            'address' => 'Αγίου Αθανασίου 10, Εύοσμος',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310760699,
            'type_id' => 3,
            'website' => 'www.dianoisi.gr',
            'approved' => 1,
            'about' => '
Το Φροντιστήριο ΔΙΑΝόΗΣΗ  δραστηριοποιείται στον Εύοσμο από το 2000 προετοιμάζοντας τους μαθητές Λυκείου για την εισαγωγή τους στα Τμήματα των Πανεπιστημίων, στις Στρατιωτικές και Αστυνομικές Σχολές καθώς και στα Τ.Ε.Ι.
Το πρόγραμμα σπουδών του και γενικά η δυναμική παρουσία του στο χώρο της εκπαίδευσης αποτελούν την καλύτερη εγγύηση για την επιτυχία στις Εξετάσεις
            ',
            'background' => $background,
        ]);

        new Portal($fake, 11, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistiriadianoisi');
//        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 2  Διαστάσεις ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Διαστάσεις', 'email' => 'diastasis.re@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'diastaseis'])->id,
            'address' => 'Κοιμήσεως Θεοτόκου 12, Πεύκα',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310673838,
            'type_id' => 3,
            'website' => 'diastaseis.gr',
            'approved' => 1,
            'about' => '
...εδώ τα όνειρά σας πραγματοποιούνται...
Το πρότυπο κέντρο φροντιστηριακής εκπαίδευσης "Διαστάσεις", ιδρύθηκε στη Θεσσαλονίκη το 1986 από τη μαθηματικό Αντωνία Γεροβασιλείου. Αποτελείται από 2 παραρτήματα στα Πεύκα (Ρετζίκι) και στους Αμπελόκηπους.
Στόχος μας είναι η επιτυχία των μαθητών μας. Πρωταρχικό μας μέλημα είναι η άψογη κατάρτιση των μαθητών, η οποία επιτυγχάνεται με τη μεθοδική διδασκαλία, τη σωστή μελέτη, τη συνεχή αξιολόγηση και τον εξατομικευμένο προγραμματισμό. Ζωντανή απόδειξη οι εκατοντάδες επιτυχίες των μαθητών μας!
Στις "Διαστάσεις" λειτουργούμε με ολιγομελή τμήματα και δίνουμε έμφαση στα ιδιαίτερα μαθήματα. Φροντίζουμε πάντα τα τμήματα να είναι ομοιογενή, ώστε μέσα από την ιδανικότερη σύνθεσή τους να προκύψει το καλύτερο αποτέλεσμα!
Kατανοούμε τις παρούσες οικονομικές συγκυρίες και φροντίζουμε τα δίδακτρα να είναι χαμηλότερα από τον ανταγωνισμό, ενώ τα δίδακτρα προκύπτουν ανάλογα με το πρόγραμμα που επιλέγει ο κάθε μαθητής. Επίσης, υπάρχουν ειδικές προσφορές για "πακέτα" μαθημάτων καθώς και ειδικές τιμές σε αδέρφια.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistiriadiastaseis');
//        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 3  Διάσταση ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Διάσταση', 'email' => 'diastasi.edu@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'diastasi'])->id,
            'address' => 'Κομνηνών 49, Καλαμαριά',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310480970,
            'type_id' => 3,
            'website' => 'diastasi.edu@gmail.com',
            'approved' => 1,
            'about' => '
            Λαμβάνοντας οπ’ όψη τη διδακτέα ύλη κάθε τάξης της Δευτεροβάθμιας Εκπαίδευσης, όπως ορίζεται ετησίως από το Υπουργείο Παιδείας, παρέχουμε σε όλους τους μαθητές μας ΔΩΡΕΑΝ τα εκπαιδευτικά μας συγγράμματα. Με την προσωπική επιμέλεια του εκπαιδευτικού μας προσωπικού ο μαθητής έχει τη δυνατότητα να έχει στα χέρια του εύχρηστα εγχειρίδια ανά μάθημα τα οποία του εξασφαλίζουν
            α) πληρότητα περιεχομένου ως προς τις απαιτήσεις της εξεταστέας ύλης
            β) διευκρινίσεις και διασάφηση δυσνόητων σημείων των σχολικών εγχειριδίων
            γ) πλούσιο πρόσθετο υλικό για επεξεργασία και αυτενέργεια.
            Με τη χρήση των εκδόσεων μας εντός της τάξης οι καθηγητές μας επιβεβαιώνουν τη συνέπεια ως προς τη μεθόδευση του έργου τους κι οι μαθητές απαλλάσσονται από κοπιαστικές χειρόγραφες σημειώσεις έχοντας τη δυνατότητα να αφοσιωθούν στο εκπαιδευτικό έργο.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 11, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/groups/265617410224676/');
//        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 4 Δυαδικό  ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Δυαδικό', 'email' => 'dyadikoneapoli@hotmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'dyadiko'])->id,
            'address' => 'Ανδρέα Παπανδρέου 48, Νεάπολη',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310613555,
            'type_id' => 3,
            'website' => 'dyadiko.com.gr',
            'approved' => 1,
            'about' => '
            Τα φροντιστήρια «δυαδικό» ιδρύθηκαν το 1989 στη Θεσσαλονίκη.
            Όλα αυτά τα χρόνια έχουν καθιερωθεί στην συνείδηση του κόσμου ως συνώνυμο της ποιότητας, της συνέπειας και της αδιάκοπης φροντίδας και υποστήριξης του μαθητή.
            Σήμερα, το δυαδικό λειτουργεί σε δύο σημεία της Θεσσαλονίκης, στη Νεάπολη και τις Συκιές.

            Τα φροντιστήρια «δυαδικό» αναγνωρίζοντας τις επιταγές της εποχής, επιδιώκουν να προσφέρουν τη γνώση μέσα σε ένα πλαίσιο υπηρεσιών τεχνολογικής εξέλιξης και επιστημονικής εξειδίκευσης. Η επιδίωξη αυτή πραγματοποιείται καθώς:
            ένα άριστο επιτελείο επιστημονικά καταρτισμένων καθηγητών βρίσκεται δίπλα στους μαθητές
            διατίθενται δωρεάν εκπαιδευτικά βοηθήματα για κάθε μάθημα
            παρέχεται εκπαιδευτικό υλικό μέσω τεχνολογίας
            οργανώνονται διαγωνίσματα σε τρεις εξεταστικές περιόδους με χαρακτήρα προσομοίωσης πανελληνίων εξετάσεων
            παρέχεται μόνιμη ψυχολογική υποστήριξη στους μαθητές με συνεργαζόμενο ειδικό ψυχολόγο-παιδαγωγό
            διενεργούνται σεμινάρια και τεστ επαγγελματικού προσανατολισμού
            υπάρχει διαρκής επικοινωνία και ενημέρωση γονέων-κηδεμόνων για την πορεία του μαθητή
            προσφέρονται δωρεάν, επιπλέον μαθήματα, πέραν του προγράμματος σπουδών, αν αυτό κριθεί αναγκαίο.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Φροντιστήρια-δυαδικό-219638875088139');
//        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





        /*=============== 5  Ειρμός ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Ειρμός', 'email' => 'eirmosfr@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'eirmos'])->id,
            'address' => 'Τσιμισκή 41',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310275152 ,
            'type_id' => 3,
            'website' => 'eirmos.gr',
            'approved' => 1,
            'about' => '
                Το Φροντιστήριο ΕΙΡΜΟΣ ιδρύθηκε το 1993. Από τότε μέχρι και σήμερα προετοιμάζει αποκλειστικά τους μαθητές του για την εισαγωγή τους στα Α.Ε.Ι. και Τ.Ε.Ι. της προτίμησής τους.
                Ο ιδρυτής του Φροντιστηρίου Αλιαπούλιος Δημήτρης μαζί με άλλους εκλεκτούς συνεργάτες-  συνιδρυτές, γνωρίζοντας καλά τις ιδιαιτερότητες του χώρου, δημιουργήσαμε τον ΕΙΡΜΟ, με τη φιλοδοξία να είναι ένα φροντιστήριο διαφορετικό και καινοτόμο. Να είναι πιο αποτελεσματικό, να είναι ΚΑΛΥΤΕΡΟ.
                Τα αποτελέσματα μας δικαίωσαν και μας δικαιώνουν. Τα αποτελέσματα επιβεβαιώνουν την ορθότητα των επιλογών μας στην όλη οργάνωση του φροντιστηρίου.
                Κατ’ αρχάς επιλέξαμε να στεγασθούμε σ’ ένα πενταόροφο νεοκλασικό ψηλοτάβανο κτίριο, στο κέντρο της πόλης. Έτσι το φροντιστήριό μας είναι προσβάσιμο από τους μαθητές όλων των Λυκείων της Θεσσαλονίκης. Οι φροντισμένες αίθουσες διδασκαλίας και η αισθητική των χώρων εξασφαλίζουν καλύτερη διάθεση των μαθητών μας και ενισχύουν την προσοχή τους. Τώρα με συσσωρευμένη γνώση και εμπειρία ο Αλιαπούλιος Δημήτρης και οι νέοι συνεργάτες του αποφάσισαν να στεγάσουν τον ΕΙΡΜΟ και σε ένα νέο κτήριο, στην οδό Αλ. Παπαναστασίου 119,  περιοχή Χαριλάου (Οσία Ξένη).

                Στη διαδρομή μας αυτή οι μαθητές που μας εμπιστεύθηκαν την προετοιμασία τους είναι χιλιάδες. Οι επιτυχίες τους είναι εντυπωσιακές και σαφώς υψηλότερες του μέσου πανελλήνιου όρου. Η ικανοποίησή μας είναι μεγάλη, καθώς πολλοί απ’ αυτούς διαπρέπουν σήμερα στον επιστημονικό, στον επιχειρηματικό και στον πολιτικό στίβο στην Ελλάδα και στο εξωτερικό.
                Η Διεύθυνση του Φροντιστηρίου, αρμόδια για την καθολική εφαρμογή της εκπαιδευτικής πολιτικής, παρακολουθεί, επιβλέπει και ελέγχει την υλοποίησή της.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/ΕΙΡΜΟΣ-247841145232790');
//        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 6 Έκκεντρο ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Έκκεντρο, Περαία', 'email' => 'info@ekkentro.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ekkentro'])->id,
            'address' => 'Πέτρου και Παύλου 41, Περαία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2392025800,
            'type_id' => 3,
            'website' => 'www.ekkentro.edu.gr',
            'approved' => 1,
            'about' => '
                Αγαπητοί Γονείς-Φίλοι Μαθητές
                Είναι γεγονός η γενικότερη σύγχυση και αβεβαιότητα που επικρατεί στο χώρο του ΓΕΝΙΚΟΥ ΛΥΚΕΙΟΥ και του εκπαιδευτικού συστήματος εν γένει. Στα φροντιστήρια "ΕΚΚΕΝΤΡΟ" γίνεται μια συνεχής προσπάθεια να σας ενημερώνουμε σε γενικές γραμμές για το πλαίσιο σπουδών και τον τρόπο αξιολόγησης για την εισαγωγή σας στην τριτοβάθμια εκπαίδευση.
                Τα φροντιστήρια “ΕΚΚΕΝΤΡΟ” έχουν αντιπαρατάξει σ΄ αυτό το συγκεκριμένο κλίμα σύγχυσης την πολύχρονη εμπειρία, το άριστα εκπαιδευμένο διδακτικό προσωπικό καθώς επίσης τη συνεχή και επίμοχθη προσπάθεια για τη δημιουργία της κατάλληλης υποδομής, προκειμένου πάνοπλοι να αντιμετωπίσετε το νέο πνεύμα και ύφος των Πανελλαδικών Εξετάσεων.
                Σήμερα περισσότερο από ποτέ άλλοτε, επιβάλλεται η έγκαιρη και έγκυρη φροντιστηριακή προετοιμασία καθώς, αφενός μεν έχει αλλάξει ριζικά και το γνωστικό πλαίσιο των σπουδών και ο τρόπος εξέτασης, και αφετέρου περιορίζεται εξαιρετικά η δυνατότητα του υποψηφίου να βελτιώσει τη βαθμολογία των γραπτών του.
                Ενώ δε θεωρητικά το νέο εκπαιδευτικό σύστημα επαγγέλλεται την ελεύθερη πρόσβαση των υποψηφίων στα πανεπιστήμια, ουσιαστικά τους εισάγει σε ένα “λαβύρινθο” αλλεπάλληλων γραπτών εξετάσεων, καθοριστικών για τη μετέπειτα πορεία τους, στερώντας τους μάλιστα τη δυνατότητα βελτίωσης της βαθμολογίας.
                Είναι προφανές λοιπόν ότι απαιτείται συστηματική και υπεύθυνη προσπάθεια για την αντιμετώπιση των δυσκολιών που υπάρχουν.
                Τα φροντιστήρια “ΕΚΚΕΝΤΡΟ” με την πολύχρονη εμπειρία των στελεχών τους, θα σας βοηθήσουν ουσιαστικά να αντιμετωπίσετε τα νέα δεδομένα.
                Οι χιλιάδες μαθητές μας και σημερινοί επιστήμονες είναι οι αψευδέστεροι μάρτυρες του έργου που συντελείται στο χώρο μας.
                Δεσμευόμαστε λοιπόν, ότι συνεργαζόμενοι μέσα σε πνεύμα αμοιβαίου σεβασμού και παραγωγικής διάθεσης, θα στηρίξουμε ουσιαστικά την προσπάθειά σας για την επίτευξη του δύσκολου αλλά πολυπόθητου Στόχου.

                Με σεβασμό στην προσπάθειά σας
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/ekkentro.fro');
//        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 7  Επιλογή ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Επιλογή', 'email' => 'petropoulos@the.forthnet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'epilogi'])->id,
            'address' => 'Παύλου Μελά 23',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310233671,
            'type_id' => 3,
            'website' => 'www.frontistirio-epilogi.com',
            'approved' => 1,
            'about' => '
Αγαπητοί γονείς και μαθητές

Το φροντιστήριο ΕΠΙΛΟΓΗ αποτελεί ένα ΔΥΝΑΜΙΚΟ και ΣΥΓΧΡΟΝΟ ΕΚΠΑΙΔΕΥΤΙΚΟ ΟΡΓΑΝΙΣΜΟ που επί 30 και πλέον χρόνια προσφέρει αδιάκοπα στους μαθητές του όλες αυτές τις γνώσεις και τα εφόδια που απαιτούνται για την ΕΠΙΤΥΧΙΑ τους στις Πανελλαδικές Εξετάσεις.

Σκοπός του φροντιστηρίου ΕΠΙΛΟΓΗ είναι η κατάλληλη προετοιμασία των μαθητών που θα τους οδηγήσει με σίγουρα και σταθερά βήματα στην επίτευξη ακόμα και των πιο υψηλών στόχων τους.
Ζούμε σήμερα σε μια κοινωνία γνώσης. Οι απαιτήσεις για εκπαίδευση και κατάρτιση είναι πάρα πολύ υψηλές. Και η εκπαίδευση είναι πλέον «μάθηση» και όχι μια παθητική συσσώρευση πληροφοριών.
Επομένως πρωταρχικός στόχος του φροντιστηρίου μας είναι να βοηθήσει το μαθητή να κατανοήσει όχι το πώς να διαβάζει αλλά το πώς να μαθαίνει. Γιατί ...

«Ο αναλφάβητος του μέλλοντος δεν θα είναι ο άνθρωπος που δεν ξέρει να διαβάζει. Θα είναι εκείνος που δεν ξέρει πώς να μαθαίνει.»
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/epilogi.frontistirio');
//        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 8  Επιτυχία ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Επιτυχία', 'email' => 'info@epityxia.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'epityxia'])->id,
            'address' => '28ης Οκτωβρίου 18, Νέα Ραιδεστός',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310338883,
            'type_id' => 3,
            'website' => 'epityxia.edu.gr',
            'approved' => 1,
            'about' => '
                Το πρώτο Φροντιστήριο "ΕΠΙΤΥΧΙΑ" ιδρύεται το 1993 με έδρα το Καμπάνη Κιλκίς. Ξεκινά από το μεράκι και το όραμα δύο νέων, του Κων/νου Τσαραβά, φυσικού, και της Λεμονιάς Αμοιρίδου - Τσαραβά, φιλολόγου, να δημιουργήσουν και να προσφέρουν τις γνώσεις τους στον πολύπαθο χώρο της παιδείας. Δύο χρόνια μετά ιδρύουν και το δεύτερο Φροντιστήριο "ΕΠΙΤΥΧΙΑ" στο Πλαγιάρι Θεσ/νίκης, πάντα με την ίδια όρεξη και ίσως με μεγαλύτερη πείρα τώρα πια.
                Το 1999 ιδρύεται το τρίτο Φροντιστήριο "ΕΠΙΤΥΧΙΑ" στο Δήμο Συκεών στη Θεσ/νίκη. Μαζί στην ομάδα πια και η Δουκαίνη Τσαραβά, οικονομολόγος.
                Βασικές αρχές των Φροντιστηρίων, από την πρώτη στιγμή της ύπαρξής τους είναι οι εξής:
                ΠΑΝΤΑ ΚΟΝΤΑ ΣΤΟ ΜΑΘΗΤΗ,
                όχι μόνο πάνω στα μαθησιακά του προβλήματα, αλλά και πάνω στην ψυχολογία του, την ψυχοσύνθεσή του. Πάντα με διάθεση για επικοινωνία - βοήθεια, χωρίς να αλλοιώνεται και η προσωπική σχέση δασκάλου - μαθητή.
                ΣΥΝΕΡΓΑΣΙΑ ΜΕ ΤΟ ΓΟΝΕΑ:
                επιδιώκεται πάντα η επαφή με τους γονείς, γιατί είναι απαραίτητη για τη συνεργασία με το μαθητή. Συχνή ενημέρωση γονέων για την πρόοδο των παιδιών τους, για τις τυχόν αδικαιολόγητες απουσίες τους, για την επαφή τους με τα διαγωνίσματα, για τη συμπεριφορά τους στην τάξη.
                ΑΓΑΣΤΗ ΣΥΝΕΡΓΑΣΙΑ ΜΕ ΤΟΥΣ ΚΑΘΗΓΗΤΕΣ,
                ελευθερία στις κινήσεις τους, παρακολούθηση της ύλης, της πορείας του μαθήματός τους, ενίσχυση της γνώσης τους, πάντα πιστοί στην εφαρμογή μεθόδου, με καλοπροαίρετες συμβουλές, όπου χρειάζεται.
                ΣΥΝΕΧΗΣ ΕΝΗΜΕΡΩΣΗ
                γύρω από τις αλλαγές στον εκπαιδευτικό χώρο, τις μεταρρυθμίσεις, τις βάσεις κάθε χρονιάς, συγκριτικά αποτελέσματα.
                ΘΕΡΙΝΑ ΤΜΗΜΑΤΑ
                επανάληψης της ύλης, εμπέδωση της προηγούμενης ύλης.
                ΠΟΛΛΑ ΕΠΟΠΤΙΚΑ ΜΕΣΑ ΣΤΗ ΔΙΑΘΕΣΗ ΟΛΩΝ:
                multi - media, βίντεο - tv projector, φωτοτυπικό μηχάνημα, θερμοκολλητής, fax, Η/Υ - internet.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/tsarabas');
//        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCzdxFuL1RiXyyEQOUhhAUYA/videos');



        /*=============== 9  Ηλιάσκος ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Ηλιάσκος, Χαριλάου', 'email' => 'info@iliaskos.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'iliaskos'])->id,
            'address' => 'Κων/νου Καραμανλή 149, Χαριλάου',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310323245,
            'type_id' => 3,
            'website' => 'iliaskos.gr',
            'approved' => 1,
            'about' => '
Ο όμιλος «ΗΛΙΑΣΚΟΣ ΦΡΟΝΤΙΣΤΗΡΙΑ»Υπηρεσίες Παιδείας Υψηλού Επιπέδουδημιουργήθηκε από τον έμπειρο εκπαιδευτικό κύριο Καλόγνωμο Ηλιάσκο χημικό του ΑΠΘ.
Στόχος του ομίλου είναι όχι μόνο να προετοιμάσει τους μαθητές του άριστα για τις ενδοσχολικές και τις πανελλαδικές εξετάσεις αλλά και να τους κάνει ανθρώπους με αυτοεκτίμηση, ψυχραιμία και θάρος για την αντιμετώπιση των εξετάσεων.
Οι καθηγητές του ομίλου«ΗΛΙΑΣΚΟΣ ΦΡΟΝΤΙΣΤΗΡΙΑ» είναι καταξιωμένοι επιστήμονες εκπαιδευτικοί που με κατανόηση και αγάπη αντιμετωπίζουν το κάθε πρόβλημα του μαθητή.
Η ποικίλη ενημέρωση με σεμινάρια όπως διαχείριση άγχους, επαγγελματικού προσανατολισμού και άλλα ολοκληρώνουν την προσωπικότητα των μαθητών και αποδίδονται με πολλά εφόδια στην κοινωνία.
Τους μαθητές του ομίλου μας δεν τους θεωρούμε απλώς πελάτες του φροντιστηρίου, τους αντιμετωπίζουμε σαν δικά μας παιδιά και τους έχουμε κοντά μας σε ένα περιβάλλον ζεστό, φιλικό και άψογο τόσο τεχνολογικά όσο και αισθητικά. Τους υποστηρίζουμε από κάθε άποψη και επικεντρωνόμαστε όχι απλά στο να παράγουμε επιστήμονες, αλλά το κυριότερο ανθρώπους με ήθος, με κατάρτιση και με εργατικότητα για το καλό όλων.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/iliaskos.frontistiria');
//        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 10  Ηλιος  ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Ήλιος', 'email' => 'ilios@frontistirio-ilios.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ilios'])->id,
            'address' => 'Πασαλίδη 77, Καλαμαριά',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310454541,
            'type_id' => 3,
            'website' => 'frontistirio-ilios.gr',
            'approved' => 1,
            'about' => '
Δημιουργήσαμε το φροντιστήριο Ήλιος πριν από 40 χρόνια στην Καλαμαριά από αγάπη για την περιοχή και τους μαθητές της. Καθώς δεν υπήρχαν άλλα φροντιστήρια άξια εμπιστοσύνης επιλέξαμε να παραμείνουμε στην Καλαμαριά, έχοντας την φιλοδοξία να βοηθήσουμε με όλες μας τις δυνάμεις τους μαθητές της στην προσπάθειά τους για ένα καλύτερο μέλλον.
Σήμερα, μετά από 40 χρόνια επίμονης διαδρομής το φροντιστήριο ‘Ηλιος είναι το πιο σύγχρονο φροντιστήριο στη Θεσσαλονίκη. Δεν έχει παραρτήματα και έτσι αποφεύγεται η αναποτελεσματικότητα που φέρνει η πολυδιάσπαση.
Από τότε που ιδρύσαμε το φροντιστήριο Ήλιος, ανεξάρτητα από την υψηλή ποιότητα των καθηγητών του και των προγραμμάτων του, βασική μας προτεραιότητα είναι η ενεργοποίηση του κάθε μαθητή μας ξεχωριστά, ώστε να κατανοήσει ότι αυτός και μόνο αυτός είναι ο αποκλειστικός παράγοντας της επιτυχίας.
Η εμπιστοσύνη που μας δείχνει επί 40 χρόνια τώρα η συντριπτική πλειονότητα των μαθητών και γονέων της Καλαμαριάς, οι μεγάλες και πολλές κάθε χρόνο επιτυχίες μας, και το κυριότερο οι 5000 καταξιωμένοι σημερινοί επιστήμονες που ήταν μαθητές μας, είναι η καλύτερη εγγύηση για εσάς και η ηθική ικανοποίηση για εμάς που μας ωθεί να γινόμαστε συνεχώς καλύτεροι.
        ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistirio.ilios');
//        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 11  ================*/

//        $fake = factory(App\Models\School::class)->create([
//            'user_id' => factory(App\User::class)->create(['name' => '', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
//            'address' => '',
//            'city' => 'Θεσσαλονίκη',
//            'phone' => 2310,
//            'type_id' => 3,
//            'website' => '',
//            'approved' => 1,
//            'about' => '
//
//            ',
//            'background' => $background,
//        ]);
//
//        new Portal($fake, 5, 'frontistirio');
//
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
//        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
//        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

//        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//        Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//        Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




    }

}
