<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria5 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;


        /*=============== 1 Φάσμα ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Φάσμα', 'email' => 'info@fasmaedu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'fasma'])->id,
            'address' => 'Παύλου Μελά 13, Εύοσμος',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310708723,
            'type_id' => 3,
            'website' => 'fasmaedu.gr',
            'approved' => 1,
            'about' => '

            ',
            'background' => $background,
        ]);

        new Portal($fake, 7, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Φάσμα-Φροντιστήριο-200037953485517');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 2 Φως ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Φως', 'email' => 'frontistiriofos@yahoo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'fos'])->id,
            'address' => 'Παπάφη 182, Τούμπα',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310922412,
            'type_id' => 3,
            'website' => 'fos.edu.gr',
            'approved' => 1,
            'about' => '
            Ιστορικό
            Εκπαίδευση σημαίνει ΦΩΣ. Το ΦΩΣ αυτό πριν 45 χρόνια άναψαν οι δύο καταξιωμένοι καθηγητές Παπατζίκος Χάρης και Κυριακίδης Γρηγόρης. Από τότε πέρασαν αρκετές δεκαετίες και χιλιάδες μαθητές γεύτηκαν το ΦΩΣ που δίνει η γνώση στον άνθρωπο, που τολμά να το αντικρίσει. Δεκαετίες τώρα, έρχονται σ’ εμάς νέοι με με τις ίδιες ανησυχίες και τους ίδιους προβληματισμούς και με το φόβο που δημιουργεί κάθε τι καινούριο, κάθε νέα προσπάθεια. Χωρίς να το ξέρουν ενσαρκώνουν κατά κάποιο τρόπο το φόβο του Καβάφη «Ίσως το φως νά ‘ναι μια νέα τυραννία. Ποιος ξέρει τι καινούργια πράγματα θα δείξει», αλλά δεν αργούν να καταλάβουν ότι «Υπάρχουν δυο τρόποι για να λάμπεις: είτε να αντανακλάς το ΦΩΣ είτε να το δημιουργείς». Και μαζί, με κάθε μαθητή μας ξεχωριστά συνεχίζουμε να δημιουργούμε «ΦΩΣ, περισσότερο ΦΩΣ». Γιατί «η ψυχή του διαμαντιου είναι το ΦΩΣ» και εμείς, οι εκπαιδευτικοί του φροντιστηρίου, προσπαθούμε να αναδείξουμε το διαμάντι που κρύβει ο καθένας μέσα του.

            Μακροχρόνια παρουσία στην εκπαίδευση
            Τα τελευταία 45 χρόνια τα Φροντιστήρια Φως πρωταγωνιστούν στα εκπαιδευτικά δρώμενα της πόλης καθώς συνδυάζουν την εμπειρία και τη γνώση με τις νέες μεθόδους διδασκαλίας. Παρακολουθώντας τις εξελίξεις στην Παιδαγωγική επιστήμη καταφέρνουμε με ευελιξία να ανανεώνουμε τις εκπαιδευτικές μας υπηρεσίες και να προσαρμόζουμε το πρόγραμμα σπουδών στις ανάγκες του κάθε μαθητή.

            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistiriofos');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/frontistiriofos');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





        /*=============== 3 Activum ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Activum Ευκαρπία', 'email' => 'neaefkarpia@activum.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ActivumEykarpia'])->id,
            'address' => 'Εθν. Αντιστάσεως 17, Ευκαρπία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310681414,
            'type_id' => 3,
            'website' => 'activum.gr',
            'approved' => 1,
            'about' => '
            Γνωριμία με τον Εκπαιδευτικό Όμιλο Activum
            Ο Εκπαιδευτικός όμιλος ACTIVUM, δημιούργησε και λειτουργεί από το 2001, τα Φροντιστήρια Μέσης Εκπαίδευσης ACTIVUM group.
                Η ιδέα ξεκίνησε όταν η πολύπλευρη εμπειρία στον εκπαιδευτικό χώρο και η αγάπη για την παροχή δυναμικής εκπαίδευσης των στελεχών που αποτελούν τις Κεντρικές Υπηρεσίες του ομίλου, συνδυάστηκε με τον επαγγελματισμό και την γνώση ειδικών επιστημόνων.
                Η εκπαιδευτική μέθοδος ACTIVUM, η βέλτιστη αξιοποίηση του έμψυχου δυναμικού, η άριστη οργάνωση, διαχείριση & λειτουργία του Φροντιστηρίου, έδωσε στους μαθητές μας, όλα αυτά τα χρόνια τις καλύτερες προοπτικές επιτυχίας στις επιλογές τους.
                Ο στόχος για την προσφορά υψηλής ποιότητας εκπαιδευτικών υπηρεσιών, υπήρξε από την αρχή απαραβίαστη αρχή και δέσμευση για όλους μας.
                Σήμερα ο Εκπαιδευτικός όμιλος ACTIVUM, με την πολυετή εμπειρία και την εντατική έρευνα των στελεχών του, είναι σε θέση να προσφέρει μια νέα δυναμική σε όλο το φάσμα της μη τυπικής Εκπαίδευσης, με βάθος χρόνου και όραμα, παρέχοντας ολοκληρωμένες λύσεις σε μαθητές όλων των βαθμίδων, σε φοιτητές, αλλά και σε ενήλικες.
                Το σύγχρονο εκπαιδευτήριο, θα πρέπει να συνδυάζει την υποστήριξη τμημάτων μελέτης μαθητών Δημοτικού και Γυμνασίου, την προετοιμασία μαθητών Λυκείου για την εισαγωγή τους στα Ανώτατα Πανεπιστημιακά Ιδρύματα, την παροχή βοήθειας σε φοιτητές (μαθήματα, εργασίες,..), την εκμάθηση ξένων γλωσσών, την παροχή ολοκληρωμένων συμβουλευτικών υπηρεσιών σε όλες τις βαθμίδες της εκπαίδευσης, την διενέργεια εξειδικευμένων σεμιναρίων, αλλά και την απόκτηση και πιστοποίηση γνώσεων πληροφορικής.
                Η ολοκληρωμένη εκπαιδευτική πρόταση ή πολυχώρος εκπαίδευσης (multibrand unit), υλοποιείται από τον Εκπαιδευτικό Όμιλο ACTIVUM που εκπροσωπώ και ο οποίος αναπτύσσεται πανελλαδικά με τη μέθοδο της δικαιόχρησης (franchising) !
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/activumeukarpia');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/activumgroup');




        /*=============== 4 Κορυφή ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστηριακό Συγκρότημα Κορυφή', 'email' => 'korifi@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'korifi'])->id,
            'address' => 'Θεμιστοκλή Σοφούλη 2, Ντεπώ',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310425990,
            'type_id' => 3,
            'website' => 'korifi.edu.gr',
            'approved' => 1,
            'about' => '
            Αγαπητοί γονείς
            και μαθητές
            Το Φροντιστήριο Κορυφή έχει καταξιωθεί στη συνείδηση των Θεσσαλονικέων ως το Φροντιστήριο των επιτυχιών. Εδώ και δεκαετίες πρωτοστατεί στη φροντιστηριακή εκπαίδευση της πόλης μας, προετοιμάζοντας υποψηφίους για την τριτοβάθμια παιδεία και γιορτάζοντας μαζί τους την επιτυχία τους.
            Είναι τιμή μας που στις αίθουσες της Κορυφής φοίτησαν ως μαθητές καταξιωμένοι σήμερα επιστήμονες της πόλης μας. Αυτό το έργο της γαλούχησης μαθητών ως μελλοντικών επιστημόνων συνεχίζουμε μέχρι σήμερα, έχοντας απόλυτη συνείδηση της ευθύνης που αναλαμβάνουμε. Το έργο μας τροφοδοτείται από τον σεβασμό μας προς την ιδιαίτερη προσωπικότητα του κάθε μαθητή μας και την υπευθυνότητα προς τους γονείς, που αγωνιούν για το μέλλον των παιδιών τους. Το υπηρετούμε με συνέπεια όλοι μας, γραμματεία, καθηγητές και διεύθυνση, έχοντας ως μοναδικό στόχο την πλήρωση των αναγκών κάθε μαθητή.
            Επιδίωξή μας είναι στο τέλος της κάθε χρονιάς να αποχαιρετούμε χαμογελαστά πρόσωπα ευτυχισμένων φοιτητών και συγκινημένων γονέων. Και το πετυχαίνουμε, δικαιώνοντας όσους μας επέλεξαν.
            Μέθοδος διδασκαλίας
            Έχοντας μέλημα τη συνεχή επικοινωνία και την ουσιαστική συνεργασία μαθητή-καθηγητή, διαμορφώνουμε ολιγομελή τμήματα. Έτσι ο κάθε μαθητής μπορεί να εκφράσει απορίες, αλλά και ο καθηγητής να ελέγχει διαρκώς το επίπεδο κατανόησης και εμπέδωσης της ύλης, ώστε να αναπροσαρμόζει τη διδασκαλία του αν κριθεί απαραίτητο. Παράλληλα, φροντίζουμε τα τμήματά μας να είναι ομοιογενή, ώστε όλοι οι μαθητές να συμβαδίζουν και να αφομοιώνουν την ύλη στο βαθμό που απαιτείται για τις εξετάσεις.
            Στην Κορυφή προσφέρονται όλα τα μαθήματα όλων των προσανατολισμών και ο μαθητής μπορεί να επιλέξει αυτά που θέλει να παρακολουθήσει. Επιπλέον, ήδη από τη Β΄ Λυκείου ξεκινάμε την προετοιμασία των μαθητών μας στην ύλη της Γ΄ Λυκείου, που είναι και η εξεταζόμενη, πάντα από μηδενική βάση, για να είναι όλοι σε θέση να παρακολουθήσουν και να αφομοιώσουν.
            Συγγράμματα
            Έχοντας μέλημα τη συνεχή επικοινωνία και την ουσιαστική συνεργασία μαθητή-καθηγητή, διαμορφώνουμε ολιγομελή τμήματα. Έτσι ο κάθε μαθητής μπορεί να εκφράσει απορίες, αλλά και ο καθηγητής να ελέγχει διαρκώς το επίπεδο κατανόησης και εμπέδωσης της ύλης, ώστε να αναπροσαρμόζει τη διδασκαλία του αν κριθεί απαραίτητο. Παράλληλα, φροντίζουμε τα τμήματά μας να είναι ομοιογενή, ώστε όλοι οι μαθητές να συμβαδίζουν και να αφομοιώνουν την ύλη στο βαθμό που απαιτείται για τις εξετάσεις.
            Στην Κορυφή προσφέρονται όλα τα μαθήματα όλων των προσανατολισμών και ο μαθητής μπορεί να επιλέξει αυτά που θέλει να παρακολουθήσει. Επιπλέον, ήδη από τη Β΄ Λυκείου ξεκινάμε την προετοιμασία των μαθητών μας στην ύλη της Γ΄ Λυκείου, που είναι και η εξεταζόμενη, πάντα από μηδενική βάση, για να είναι όλοι σε θέση να παρακολουθήσουν και να αφομοιώσουν.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/korifithessaloniki');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





        /*=============== 5 Όμικρον ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Όμικρον', 'email' => 'info@omikron.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'omikron'])->id,
            'address' => 'Φιλίππου Φλώρου 62, Εύοσμος',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310558585,
            'type_id' => 3,
            'website' => 'omikron.edu.gr',
            'approved' => 1,
            'about' => '
            Το Φροντιστήριο Όμικρον ήρθε για να αλλάξει τα δεδομένα στη δευτεροβάθμια εκπαίδευση.
            Αξιοποιώντας τη νέα τεχνολογία στον τομέα της εκπαίδευσης, εφαρμόζοντας τις πιο σύγχρονες εκπαιδευτικές μεθόδους, με ευέλικτα ολιγομελή τμήματα και με την υποστήριξη των πλέον έμπειρων και εξειδικευμένων καθηγητών.
            Μέσα από ένα σύγχρονο εκπαιδευτικό περιβάλλον, παρέχοντας ολοκληρωμένες εκπαιδευτικές υπηρεσίες, στοχεύουμε στην πλήρη κατάρτιση των μαθητών και στην επιτυχημένη εισαγωγή τους στην τριτοβάθμια εκπαίδευση.
            Με γνώμονα τις εξατομικευμένες ανάγκες κάθε μαθητή, παρέχουμε:

            Σύγχρονο εκπαιδευτικό περιβάλλον
            Σύγχρονα συστήματα διδασκαλίας με Διαδραστικούς Πίνακες
            Έμπειρους και εξειδικευμένους καθηγητές
            Ολιγομελή ευέλικτα τμήματα (5 - 8 ατόμων)
            ΕΛΟΤ 1433 - Πιστοποίηση Ποιότητας Υπηρεσιών Εκπαίδευσης
            ',
            'background' => $background,
        ]);

        new Portal($fake, 16, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/omikron.frontistirio');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





        /*=============== 6 sxediazoume ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Σχολή sxediazoume', 'email' => 'sxediazoume@yahoo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'sxediazoume'])->id,
            'address' => 'Αγίας Σοφίας 16',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310224000,
            'type_id' => 3,
            'website' => 'sxediazoume.gr',
            'approved' => 1,
            'about' => '
            Η σχολή μας είναι το αποτέλεσμα της δημιουργικής συνεργασίας μιας ομάδας αρχιτεκτόνων, εικαστικών και ιστορικών της τέχνης. Φίλοι εδώ και χρόνια, πέραν όλων των άλλων, μας συνέδεε η παράλληλη πολυετής μας πορεία στο χώρο της εικαστικής εκπαίδευσης. Έτσι, αποφασίσαμε να ενώσουμε τις δυνάμεις μας, καθώς κοινός παρονομαστής όλων μας ήταν η αγάπη για τη διδασκαλία και το αντικείμενό μας και φυσικά η γεμάτη ενέργεια σχέση με τα παιδιά. Επιλέξαμε ένα υπέροχο διατηρητέο κτίριο ογδόντα ετών στον πεζόδρομο της Αγίας Σοφίας και η εμπιστοσύνη παλιών και νέων μας μαθητών υποστηρίζει την προσπάθειά μας και μας δίνει τη δύναμη να συνεχίσουμε.
            Σήμερα, το sxediazoume αποτελεί πολύ περισσότερα από ένα φροντιστήριο σχεδίου με την περιορισμένη σημασία των λέξεων. Απευθύνεται σε οποιονδήποτε θέλει να ασχοληθεί με το σχέδιο, την αρχιτεκτονική και τη ζωγραφική, αλλά κυρίως ενισχύει την επιμονή και τη δημιουργικότητα του σπουδαστή. Καθώς, κατά τη γνώμη μας, το ταλέντο ή η φυσική κλίση με τα οποία είναι προικισμένος κανείς, διευκολύνουν τη διαδικασία, αλλά δεν αρκούν, επικεντρώνουμε την προσοχή μας στα ιδιαίτερα εκείνα χαρακτηριστικά που κάθε εκπαιδευόμενος διαθέτει και φροντίζουμε να τα αναδείξουμε με τον καλύτερο δυνατό τρόπο.
            Ταυτόχρονα, φροντίζουμε για την ενίσχυση της συνολικής εικαστικής και αρχιτεκτονικής παιδείας των μαθητών μας, με τακτικές επισκέψεις σε εκθεσιακούς χώρους της πόλης και κύκλους σεμιναρίων πρακτικού και θεωρητικού ενδιαφέροντος. Επιπλέον, η πλούσια βιβλιοθήκη μας, που αριθμεί περισσότερους από διακόσιους τίτλους βιβλίων και ανανεώνεται διαρκώς, είναι στην άμεση διαθεσιμότητά τους, ενώ στο blog μας μπορεί ο καθένας να ενημερωθεί για ζητήματα τέχνης, αρχιτεκτονικής και πολιτισμού. Έτσι, τόσο οι μικροί όσο και οι μεγάλοι μας σπουδαστές λειτουργούν σε ένα δημιουργικό και ευχάριστο περιβάλλον, με τη συνεχή παρουσία και υποστήριξή μας και βέβαια, με απόλυτη επιτυχία.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');



        Scholio::portalStudy($fake, 'Τμήμα ενηλίκων', 'Εργαστήριο', 'Ζωγραφική');
        Scholio::portalStudy($fake, 'Λυκείο', 'Σχολή Καλών Τεχνών', 'Καλών Τεχνών');
        Scholio::portalStudy($fake, 'Λυκείο', 'Θετικών Σπουδών', 'Ελεύθερο Σχέδιο');
        Scholio::portalStudy($fake, 'Λυκείο', 'Θετικών Σπουδών', 'Γραμμικό Σχέδιο');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/www.sxediazoume.gr');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/sxediazoume/');
       Scholio::portalSocial($fake, 'twitter', 'https://www.twitter.com/sxediazoume/');



        /*=============== 7 Κεντρικό ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Κεντρικό', 'email' => 'info@kentriko.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'kentriko'])->id,
            'address' => 'Τζαβέλλα 4, Εύοσμος',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310,
            'type_id' => 3,
            'website' => 'kentriko.edu.g',
            'approved' => 1,
            'about' => '
            Στοχεύουμε στην ποιότητα
            Γιατί το Φροντιστήριο ΚΕΝΤΡΙΚΟ είναι σύγχρονο εκπαιδευτικό κέντρο, προσαρμοσμένο στις ανάγκες εισαγωγής στην Τριτοβάθμια εκπαίδευση.

            Στοχεύουμε στην ποιότητα του εκπαιδευτικού μας έργου, επικεντρώνοντας παράλληλα στις ιδιαίτερες ανάγκες και απαιτήσεις του κάθε μαθητή / μαθήτριας.
            Αντιλαμβανόμενοι τις δυσκολίες της εποχής, καταρτίσαμε προγράμματα σπουδών που συνδυάζουν τη σωστή και πλήρη προετοιμασία των υποψηφίων με τις ανταγωνιστικές τιμές.

            Στόχος η επιτυχία. Στο επίκεντρο εσύ!
            Ορισμένοι λόγοι για να επιλέξετε το φροντιστήριο ΚΕΝΤΡΙΚΟ

            Έμπειροι καθηγητές, εξειδικευμένοι στο αντικείμενο διδασκαλίας τους
            Πρόγραμμα σπουδών που ανταποκρίνεται στις απαιτήσεις των εξετάσεων
            Ολιγομελή τμήματα (5 έως 7 άτομα)
            Τραπέζι εργασίας που βοηθά την αμεσότητα στη σχέση μαθητή καθηγητή
            Πλήρης και δωρεάν σειρά συγγραμμάτων που επιμελήθηκε το διδακτικό μας προσωπικό
            Συνεχή επαναληπτικά διαγωνίσματα
            Συνεχής επικοινωνία με τους γονείς
            Συχνές συναντήσεις με Σχολικό Ψυχολόγο για παιδιά και γονείς
            Φιλικό περιβάλλον
            Αξιοποίηση της τεχνολογίας (χρήση οπτικοακουστικών μέσων)
            Εγκεκριμένο μέλος του Συλλόγου Φροντιστών Βορείου Ελλάδος (Σ.Φ.Β.Ε.)

            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/kentriko.edu.gr');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 8 Θεωρεία + Πράξη ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Θεωρεία + Πράξη', 'email' => 'info@theoria-praxi.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'theoriaPraxi'])->id,
            'address' => '25ης Μαρτίου 104, Εύοσμος',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310608611,
            'type_id' => 3,
            'website' => 'theoria-praxi.edu.gr',
            'approved' => 1,
            'about' => '
                Με έντονα αυξημένο το αίσθημα ευθύνης και συμμεριζόμενοι την αγωνία του κάθε γονέα δημιουργήσαμε το φροντιστήριο μας. Το Φροντιστήριο «Θεωρία και πράξη» ξεκίνησε την δραστηριότητα του τον Μάρτιο του 2004. Εδώ και 10 χρόνια λειτουργούμε με επίκεντρο τον μαθητή και την προσπάθεια του για την εισαγωγή του σε σχολές Α.Ε.Ι. και Τ.Ε.Ι. της επιθυμίας του. Η δεκαετή πείρα μας σε συνδυασμό με την άριστη δόμηση του τρόπου διδασκαλίας μας καθιστά την  επιλογή του φροντιστηρίου μας μια αξιόπιστη και σταθερή λύση.
                Είμαστε πολύ αυστηροί με τον εαυτό μας, υιοθετούμε τους στόχους του κάθε μαθητή, δημιουργούμε το κατάλληλο κλίμα ανάμεσα σε μαθητές και καθηγητές, κάνουμε σωστή και μεθοδική οργάνωση κατανομή χρόνου για τον κάθε μαθητή ξεχωριστά, δημιουργούμε αυστηρώςκλειστά τμήματα το πολύ μέχρι 6 ατόμων για καλύτερες επιδόσεις των μαθητών, διαθέτουμε καθηγητές άρτια εκπαιδευμένους με μεγάλη γνώση και ειδίκευση, οργανώνουμε ημερίδες επαγγελματικού προσανατολισμού και συνεδρίες σε καθηγητές, γονείς και μαθητές για την κατάλληλη ψυχολογική υποστήριξη.
                Έτσι λοιπόν υιοθετήσαμε την άποψη πως «Η επιτυχία είναι επιλογή. » και η επιλογή η δική μας είναι να συνεχίζουμε τη σκληρή δουλειά και την παράδοση που δημιουργήσαμε εδώ και 10 χρόνια με τοποσοστό επιτυχίας να ξεπερνά το 90 % σε στόχους που έθεσαν οι μαθητές από την αρχή της χρονιάς και όχι στόχους που δημιουργήθηκαν εκ του αποτελέσματος. Αν λοιπόν στόχος σας είναι η άριστη δουλειά ενός φροντιστηρίου και όχι οι κοινωνικές εκδηλώσεις του τότε σίγουρα η επιλογή του φροντιστηρίου μας θα σας αφήσει πλήρως ικανοποιημένους .
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Frontistiriotheoriapraxi');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





        /*=============== 9 Κουσουρνάς ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Κουσουρνά', 'email' => 'info@kousournas.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'kousournas'])->id,
            'address' => '40 Εκκλησιών 25, Αγιος Αθανάσιος',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310701301,
            'type_id' => 3,
            'website' => 'kousournas.edu.gr',
            'approved' => 1,
            'about' => '
                Το φροντιστήριο μας, αποτελεί δημιούργημα της μακρόχρονης εμπειρίας μας στο χώρο της εκπαίδευσης και συνεχίζει να αγωνίζεται αδιάκοπα στοχεύοντας ακόμη περισσότερο στη βελτίωση του, όσον αφορά στις γνώσεις που παρέχει στους εκπαιδευόμενους.
                ΠΙΟ ΑΝΑΛΥΤΙΚΑ:
                Η Α΄Λυκείου, από τις αρχές Σεπτεμβρίου, ξεκινά να προετοιμάζεται δυναμικά με βάση το νέο σύστημα εισαγωγής στην τριτοβάθμια εκπαίδευση, έτσι ώστε να μπορεί να ανταποκριθεί πλήρως στα νέα δεδομένα της εκπαίδευσης.
                Οι μαθητές της Β΄Λυκείου συνεχίζουν σταθερά την προετοιμασία τους προς την επίτευξη των στόχων τους σε συνεργασία με τους άρτια καταρτισμένους καθηγητές. Κατά τη διάρκεια της φοίτησης τους παρέχονται μαθήματα προετοιμασίας για τη Γ΄Λυκείου που σε συνδυασμό με τα καλοκαιρινά μαθήματα, αποκτούν τα κατάλληλα εφόδια, ώστε να συνεχίσουν πληρέστερα προετοιμασμένοι στη Γ΄Λυκείου.
                Στη Γ΄Λυκείου παρέχονται όλες οι απαραίτητες γνώσεις, υψηλού επιπέδου, προκειμένου οι μαθητές να πετύχουν και να λάβουν την προσωπική τους επιβράβευση, με την εισαγωγή τους στις σχολές της επιλογής τους. Αυτό πετυχαίνεται μέσω μιας διαρκούς και συνεχής εκμάθησης δια μέσου της διδασκαλίας - ωριαίων test και πολλών άλλων σύγχρονων μεθόδων.
                Οι μαθητές στο φροντιστήριο μας σε όλες τις τάξεις μετέχουν στα θέματα Προσομοίωσης της

                Ομοσπονδίας Εκπαιδευτικών Φροντιστών Ελλάδος (Ο.Ε.Φ.Ε.).
            ',
            'background' => $background,
        ]);

        new Portal($fake, 11, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/kousournas');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 10 Σπουδαστήριο ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Σπουδαστήριο', 'email' => 'spoudast@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'spoudastirio'])->id,
            'address' => 'Περραιβού 13, Άνω Τούμπα',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310906613,
            'type_id' => 3,
            'website' => 'spoudastirio.edu.gr',
            'approved' => 1,
            'about' => '
                Γενάρης 2001
                Τότε ήταν. Εκεί στην ώριμη ηλικία των 32-34, κάνουμε πράξη ένα όνειρο που μεγάλωνε μαζί μας. Με πολλές «ώρες πτήσης» στους μαυροπίνακες των φροντιστηρίων και στα θρανία γκρουπάδικων και ιδιαιτέρων, αποφασίσαμε να καταθέσουμε τη δική μας εκπαιδευτική πρόταση. Έτσι απλά.
                Οδηγός μας η όρεξη για δουλειά, μα πάνω απ’ όλα η αγάπη για αυτό που ήδη κάναμε μέχρι τότε. Τη διδασκαλία.
                Το όνειρό μας από την αρχή είχε το δικό του «παράξενο» όνομα...Σπουδαστήριο!
                Το πρώτο μας διαφημιστικό φυλλάδιο, με αφιέρωση «Στα παιδιά που τα θέλουνε όλα…», προσπάθησε να λύσει τις απορίες.


                Φροντιστήριο ή Σπουδαστήριο;

                Σπουδαστήριο:

                Ένας χώρος φτιαγμένος με μεράκι, φαντασία, όρεξη για δουλειά, μα πάνω απ’ όλα με το όνειρο το δικό μας και των συνεργατών μας, να μοιραστούμε μαζί σου την αγάπη μας για τη δουλειά και την επιστήμη μας.
                Ένας χώρος έκφρασης και δημιουργίας, μα πάνω από όλα μελέτης.
                Χώρος όπου ο καθένας έχει το ρόλο του.
                Εσύ, στο ρόλο αυτού που θα θελήσει, θα προσπαθήσει, θα μάθει, θα κατακτήσει.
                Εμείς, στο ρόλο του δασκάλου, του βοηθού, του φίλου.
                Οι γονείς σου, στο ρόλο του ακούραστου συνεργάτη, δικού σου και δικού μας.
                Όλοι μας, συμμέτοχοι στο δύσκολο μα γοητευτικό ταξίδι της γνώσης, με στόχο την κατάκτηση του δικού σου ονείρου.

                Αυτό ήταν τότε για εμάς το Σπουδαστήριο, αυτό είναι ακόμα και σήμερα.
                Εκεί στο εκπαιδευτικό μας στέκι, στην Περραιβού, θα μας βρείτε ακόμα να διδάσκουμε.
                Με μια διαφορά μόνο.
                Σ’ αυτή τη συμμετοχική διαδικασία της γνώσης δεν πιστεύουμε πλέον μόνο εμείς αλλά και οι συνεργάτες μας. Τους ευχαριστούμε για τη στήριξη όπως και εσάς για την εμπιστοσύνη σας.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 9, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 11 ================*/

//        $fake = factory(App\Models\School::class)->create([
//            'user_id' => factory(App\User::class)->create(['name' => '', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
//            'address' => '',
//            'city' => 'Θεσσαλονίκη',
//            'phone' => 2310,
//            'type_id' => 3,
//            'website' => '',
//            'approved' => 1,
//            'about' => '
//
//            ',
//            'background' => $background,
//        ]);
//
//        new Portal($fake, 5, 'frontistirio');
//
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
//        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
//        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');


    }



}
