<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria15 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;




     /*=============== 1 Lets Learn ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Lets Learn', 'email' => 'letslearn28@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'letslearn'])->id,
         'address' => 'Γρηγορίου Αυξεντίου 37, Καματερό',
         'region' => 'Καματερό',
         'city' => 'Αθήνα',
         'phone' => 2102615888,
         'type_id' => 4,
         'website' => 'letslearn-ls.blogspot.com',
         'approved' => 1,
         'ranking' => 50,
         'about' => '
            Το κέντρο ξένων γλωσσών Let\'s Learn λειτουργεί στο Καματερό, συγκεκριμένα στο Γεροβουνό, από τον Σεπτέμβριο του 2011, αρχικά στην οδό Τήνου 28, και αργότερα τον Γενάρη του 2015 όταν και έγινε η μεταστέγαση στην οδό Γρηγορίου Αυξεντίου 37. Στους χώρους μας διδάσκεται η Αγγλική, η Γαλλική και η Γερμανική γλώσσα σε παιδιά αλλά και σε ενήλικες. Η εκμάθηση της ξένης γλώσσας γίνεται με μεθοδικότητα, συνέπεια και ανθρωποκεντρική προσέγγιση με ιδιαίτερη έμφαση στις ανάγκες κάθε μαθητή ξεχωριστά. Αξιοποιώντας κάθε δυνατή μέθοδο αλλά και την δύναμη της σύγχρονης τεχνολογίας, έχουμε στρέψει την προσοχή και την προσήλωσή μας στην δημιουργική εκμάθηση της ξένης γλώσσας θέτοντας στόχους όχι μόνο την απόκτηση του επιθυμητού πτυχίου για τους σπουδαστές και τις σπουδάστριες αλλά και την γνώση σε ό,τι αφορά στον πολιτισμό και τα ήθη της αντίστοιχης με τη γλώσσα ξένης χώρας.
            Παρά το γεγονός πως διανύουμε μια εποχή κρίσης σχεδόν σε κάθε τομέα και γεμάτη προκλήσεις και δυσκολίες, τα ποσοστά επιτυχίας του κέντρου μας είναι υψηλά τόσο σε επίπεδο lower (Β2) αλλά και proficiency (C2). Αυτό συμβαίνει χάρη στην αφοσίωση, την εμπειρία και την αγάπη των εκπαιδευτικών μας για το λειτούργημα του δασκάλου. Έτσι σκοπεύουμε να πράξουμε και τα επόμενα χρόνια προσαρμόζοντας διαρκώς τις μεθόδους μας στις ανάγκες του κοινωνικού συνόλου που στρέφεται σε εμάς.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Lets-learn-478928312140810/');





     /*=============== 2 Αμουργιανός ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών Αμουργιανός', 'email' => 'info@amourgianos.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'amourgianos'])->id,
         'address' => 'Μιχαλακοπούλου 98, Περιστέρι',
         'region' => 'Περιστέρι',
         'city' => 'Αθήνα',
         'phone' => 2105751820,
         'type_id' => 4,
         'website' => 'amourgianos.edu.gr',
         'approved' => 1,
         'ranking' => 50,
         'about' => '
             Το Κέντρο Ξένων Γλωσσών Αμουργιανός μετρά 38 χρόνια απόλυτης επιτυχίας και ανοδικής πορείας στο χώρο της ξενόγλωσσης εκπαίδευσης. Ιδρυτής του σχολείου υπήρξε ο κος Αμουργιανός Αντώνης, ο οποίος καθιέρωσε πρωτοποριακές μεθόδους διδασκαλίας θέτοντας τις βάσεις για την περαιτέρω ανάπτυξη του σχολείου.
             Δώδεκα χρόνια τώρα ο κος Αμουργιανός Γεράσιμος σφραγίζει την πορεία του κέντρου με την άριστη τεχνογνωσία και κατάρτισή του ανοίγοντας νέους ορίζοντες στην ξενόγλωσση εκπαίδευση. Με πολυετείς σπουδές στην Αγγλική Γλωσσολογία (BA HONS in English Linguistics and Italian, UNIVERSITY OF WALES - SWANSEA) και εξειδίκευση στη διδασκαλία της Αγγλικής γλώσσας (Advanced Diploma - ESP - in teaching English as a foreign / second language TEFL / TESL - The English Language Centre London) έχει εισαγάγει νέες μεθόδους για τις ξεχωριστές ανάγκες του κάθε μαθητή εφαρμόζοντάς τες και με προσωπική διδασκαλία.
             Συνοδοιπόρος στην προσπάθεια αυτή είναι η κα Αμουργιανού Αγγελική, η οποία αποτελεί σημαντικό κομμάτι του συντονισμού και οργάνωσης του Κέντρου Ξένων Γλωσσών "Αμουργιανός".
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');



     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');








     /*=============== 3 Ευρωδιάσταση ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρα Ξένων Γλωσσών Ευρωδιάσταση', 'email' => 'aig5eu@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'eurodiastasi'])->id,
         'address' => 'Χαλκοκονδύλη 5, Πλατεία Κάνιγγος',
         'region' => 'Πλατεία Κάνιγγος',
         'city' => 'Αθήνα',
         'phone' => 2103844888,
         'type_id' => 4,
         'website' => 'eurodiastasi.gr',
         'approved' => 1,
         'ranking' => 50,
         'about' => '
            Με 22 χρόνια δημιουργικής παρουσίας στο χώρο της ξενόγλωσσης εκπαίδευσης και 36.000 επιτυχημένους σπουδαστές στο ενεργητικό τους, τα Κέντρα Ξένων Γλωσσών Ευρωδιάσταση αποτελούν αδιαμφισβήτητα μία από τις καλύτερες επιλογές για οποιονδήποτε ενήλικο ενδιαφέρεται να μάθει σωστά και γρήγορα ξένες γλώσσες και να πιστοποιήσει τις γνώσεις του.
            Το προφίλ των Κέντρων Ξένων Γλωσσών Ευρωδιάσταση είναι απόλυτα συγκεκριμένο: απευθύνονται αποκλειστικά και μόνο σε συνειδητοποιημένους ενήλικες, οι οποίοι επιθυμούν να μάθουν γρήγορα, σοβαρά και σε ικανοποιητικό επίπεδο μία ή περισσότερες ξένες γλώσσες και να αποκτήσουν ένα ή περισσότερα πτυχία γλωσσομάθειας. Τα Κέντρα Ξένων Γλωσσών Ευρωδιάσταση ΔΕΝ απευθύνονται σε σπουδαστές οι οποίοι επιθυμούν να μάθουν μία γλώσσα με αργούς ρυθμούς και καθαρά ως "χόμπι". Είναι χαρακτηριστικό ότι το 90% των προγραμμάτων που παρέχουν τα Κέντρα Ξένων Γλωσσών Ευρωδιάσταση οδηγούν στην απόκτηση αναγνωρισμένου πτυχίου γλωσσομάθειας σε 7-14 μήνες. Ο χρόνος προετοιμασίας για την απόκτηση πτυχίου στα Κέντρα Ξένων Γλωσσών Ευρωδιάσταση είναι 2-3 φορές λιγότερος από το "σύνηθες", χωρίς καμία θυσία και συμβιβασμό σε θέματα ποιότητας, χωρίς την παραμικρή αντι-εκπαιδευτική περικοπή ωρών.
            Το υψηλό επίπεδο διοικητικής και ακαδημαϊκής οργάνωσης των σχολών μας, σε συνδυασμό με το μεγάλο αριθμό σπουδαστών που φοιτούν σε αυτές, μας επιτρέπει να παρέχουμε στους σπουδαστές μας μία μοναδική ευκολία: τη δυνατότητα αλλαγής ωραρίου, αναπλήρωσης μαθημάτων και εναλλάξ παρακολούθησης τμημάτων σε οποιοδήποτε χρονικό σημείο του προγράμματος που παρακολουθούν.
            Πολιτική διδάκτρων και παροχών: η ελκυστική πολιτική διδάκτρων και παροχών που ακολουθεί η Ευρωδιάσταση δίνει τη δυνατότητα σε όλους τους σπουδαστές, ανεξαρτήτως οικονομικών δυνατοτήτων, να παρακολουθήσουν τα προγράμματά μας. Η αναγνωρισιμότητα των σχολών μας μεταξύ των ενήλικων σπουδαστών, γεγονός που καθιστά περιττή την προσφυγή τους σε πολυδάπανες διαφημιστικές ενέργειες, μας επιτρέπει να μην επιβαρύνουμε τους σπουδαστές μας με οποιοδήποτε άλλο κόστος πέραν αυτού που αφορά στην παροχή του εκπαιδευτικού μας έργου.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 8, 'frontistirio');



     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');



       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/eurodiastasi');




     /*=============== 4 Παγουλάτου - Βλάχου ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρα Ξένων Γλωσσών Παγουλάτου - Βλάχου', 'email' => 'pvschools@ath.forthnet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'vlaxouPagoulatou'])->id,
         'address' => 'Μακ Μίλλαν 13, Άνω Πατήσια',
         'region' => 'Άνω Πατήσια',
         'city' => 'Αθήνα',
         'phone' => 2102280270,
         'type_id' => 4,
         'website' => 'pvlc.gr',
         'approved' => 1,
         'ranking' => 50,
         'about' => '
             Μέθοδοι Διδασκαλίας

             Διαφοροποιημένη Διδασκαλία
             Ο κάθε μαθητής μαθαίνει με διαφορετικό τρόπο (γλωσσική νοημοσύνη, λογικο-μαθηματική νοημοσύνη, διαπροσωπική νοημοσύνη... κ.α.) αλλά και με διαφορετικό ρυθμό. Στο σχολείο μας οι έμπειροι καθηγητές μας, δημιουργούν περιβάλλον μαθητοκεντρικής προσέγγισης, σεβόμενοι τις διαφορετικές ανάγκες των παιδιών και προσαρμόζοντας το μάθημα έτσι, ώστε να καλύπτονται οι περισσότεροι μαθησιακοί τύποι παιδιών.

             Βιωματική Διδασκαλία
             Δίνεται έμφαση στο σημαντικό ρόλο που παίζει η εμπειρία στη διαδικασία της μάθησης, καθώς και στους δεσμούς μεταξύ της σχολικής τάξης και της καθημερινής ζωής των μαθητών. Στόχος μας είναι οι μαθητές μας να εμπλέκονται ενεργητικά στη διαδικασία της μάθησης. Έτσι, βοηθώντας τους να εξερευνήσουν τα συναισθήματά τους, τις απόψεις τους, τους φόβους και προβληματισμούς τους σε σχέση με θέματα της καθημερινής ζωής, γίνονται αυτόνομοι και ανεξάρτητοι.

             Εκπαίδευση με Θεατρικό Παιχνίδι
             Μέσα από το θεατρικό παιχνίδι ο μαθητής μαθαίνει ξένες γλώσσες με ευχάριστο τρόπο και ταυτόχρονα μαθαίνει να εκφράζεται λεκτικά και σωματικά. Επίσης, οι μαθητές αναπτύσσουν διάφορες ικανότητες, όπως κοινωνικότητα, σεβασμό, δημιουργικότητα, αίσθημα ευθύνης, συνεργασία, πρωτοβουλία.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'ESB');

     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/pvschoolanguages');






     /*=============== 5 Polyglosso ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρα Ξένων Γλωσσών Polyglosso', 'email' => 'info@polyglosso.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'polyglosso'])->id,
         'address' => 'Κρητών 16, Νέος Κόσμος',
         'region' => 'Νέος Κόσμος',
         'city' => 'Αθήνα',
         'phone' => 2109016732,
         'type_id' => 4,
         'website' => 'polyglosso.com',
         'approved' => 1,
         'ranking' => 50,
         'about' => '
             ΚΑΛΩΣ ΗΡΘΑΤΕ!
             To Polyglosso, εδώ και 25 χρόνια, είναι από τα γνωστότερα και σημαντικότερα κέντρα ξένων γλωσσών και πληροφορικής, με μοναδική ποιότητα διδασκαλίας. Έως σήμερα, πάνω από 30.000 μαθητές μας εμπιστεύθηκαν την ξενόγλωσση εκπαίδευσή τους και οι περισσότεροι από αυτούς μας ξαναεπισκέπτονται είτε για να τελειοποιήσουν τις γνώσεις τους σε κάποια γλώσσα, είτε για να ξεκινήσουν κάποια άλλη.
             Το σύνολο των εκπαιδευτικών προγραμμάτων που υποστηρίζεται από τα Κέντρα Ξένων Γλωσσών και Πληροφορικής Polyglosso βελτιώνεται, αλλάζει ή εκσυγχρονίζεται καθώς αλλάζει η καθημερινότητα και οι ανάγκες του σπουδαστή ενώ ταυτόχρονα δημιουργούμε συνεχώς νέα καινοτόμα προγράμματα και υπηρεσίες.
             Η επιτυχία μας, στηρίζεται στην οργάνωση και ποικιλία των εκπαιδευτικών μας προγραμμάτων, στη δυνατότητα να επιλέγουμε τους καλύτερους καθηγητές γλωσσών, να παρέχουμε άριστης ποιότητας διδασκαλία και φροντίδα στον κάθε μαθητή ατομικά αλλά και κυρίως στη δυνατότητά μας να είμαστε ένα μεγάλο εκπαιδευτήριο που όμως διατηρεί την προσωπική και ανθρώπινη επαφή με τους μαθητές και τους γονείς τους.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');



     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'ELT');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Πληροφορική', 'Πληροφορική e-learning');
     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Polyglosso');




     /*=============== 6 Παπαβαρσάμη ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Kέντρα Ξένων Γλωσσών Παπαβαρσάμη', 'email' => 'info@papavarsami.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'papavarsami'])->id,
         'address' => 'Ξηρογιάννη 50, Άνω Ιλίσια',
         'region' => 'Άνω Ιλίσια',
         'city' => 'Αθήνα',
         'phone' => 2107773378,
         'type_id' => 4,
         'website' => 'papavarsami.gr',
         'approved' => 1,
         'ranking' => 50,
         'about' => '
            Τα Kέντρα Ξένων Γλωσσών Παπαβαρσάμη βρίσκονται στο χώρο της ξενόγλωσσης εκπαίδευσης από το 1986 με δύο σχολεία στην περιοχή των Άνω Ιλισίων. Πρόκειται για σύγχρονους παιδαγωγικούς χώρους με αρχές την πίστη στις μοναδικές δυνατότητες του ατόμου, την πεποίθηση ότι η γνώση της γλώσσας μπορεί να ευδοκιμήσει μέσα στην ομάδα και στο κλίμα που μόνο η συλλογική μάθηση μπορεί να προσφέρει.
            Γνωρίζουμε ότι η εκμάθηση της γλώσσας αποτελεί μαθησιακή εμπειρία, «γνώση του κόσμου», επικοινωνία, μελέτη πολιτισμού, δεν σταματάει ποτέ, γι\'αυτό και η απόκτηση πτυχίων αποτελεί έναν από τους στόχους μας χωρίς να είναι όμως ούτε ο τελικός ούτε ο μοναδικός.
            Έχουμε καταφέρει να αισθανόμαστε μία μεγάλη οικογένεια που αποτελείται από τους μαθητές μας, τους καθηγητές και από τη διεύθυνση, και έχουμε μάθει να δουλεύουμε συλλογικά έχοντας κοινό όραμα το σχολείο μας να αποτελεί χώρο γνώσης, δημιουργίας και χαράς.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');

     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/papavarsami');




     /*=============== 7 Σίγμα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Κέντρα Ξένων Γλωσσών Σίγμα', 'email' => 'info@cybersigma.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'sigmaschool'])->id,
         'address' => 'Αλατσάτων 29, Βύρωνας',
         'region' => 'Βύρωνας',
         'city' => 'Αθήνα',
         'phone' => 2107626587,
         'type_id' => 4,
         'website' => 'cybersigma.gr',
         'approved' => 1,
         'ranking' => 50,
         'about' => '
            Σας καλωσορίζουμε στα Κέντρα Ξένων Γλωσσών ΣΙΓΜΑ
            Επί 30 χρόνια προσφέρουμε την καλύτερη διδακτική εμπειρία σε παιδιά και εφήβους. Η εκπαιδευτική μας προσέγγιση, οι έμπειροι και εξειδικευμένοι καθηγητές μας, ο σύγχρονος εξοπλισμός μας, τα κατάλληλα διαμορφωμένα σχολεία μας και η σύγχρονη παιδαγωγική μεθοδολογία που εφαρμόζουμε θα βοηθήσουν το παιδί σας να έχει γρήγορη πρόοδο με τον πιο αποδοτικό και ευχάριστο τρόπο.
            Μαζί μας τα παιδιά σας θα έχουν την ευκαιρία να εκμεταλλευτούν το ταλέντο τους και να αναπτύξουν τις ικανότητές τους.
            Τα υψηλά ποσοστά επιτυχίας των μαθητών μας σε όλα τα ξενόγλωσσα διπλώματα, με
            ΕΝΑ ΧΡΟΝΟ ΣΠΟΥΔΩΝ ΛΙΓΟΤΕΡΟ, αποτελούν απόδειξη της ποιότητας του διδακτικού μας έργου. Η σταθερή προτίμησή των οικογενειών του Βύρωνα στο σχολείο μας αποτελεί δικαίωση της δέσμευσής μας να προσφέρουμε πάντα το καλύτερο.
            Τα Κέντρα Ξένων Γλωσσών ΣΙΓΜΑ προσφέρουν σε παιδιά και εφήβους:
            Πλήρη προγράμματα, στις κυριότερες ευρωπαϊκές γλώσσες, που είναι σχεδιασμένα:
            Να αναπτύσσουν αρμονικά τις βασικές γλωσσικές δεξιότητες (ομιλία, ανάγνωση, κατανόηση και παραγωγή γραπτού και προφορικού λόγου)
            Να δίνουν ευκαιρίες επικοινωνιακής χρήσης της γλώσσας
            Να εισάγουν στον πολιτισμό και το κοινωνικό πλαίσιο της διδασκόμενης γλώσσας
            Να κοινωνικοποιούν τους μαθητές
            Να ενισχύουν την αυτοπεποίθηση και να βοηθούν στην ανάπτυξη στρατηγικών μάθησης
            Να οδηγούν σε έγκυρες, διεθνείς Πιστοποιήσεις.
            Καλώς ήλθατε λοιπόν στο φιλικό, ασφαλές και παιδαγωγικά δομημένο περιβάλλον των Κέντρων Ξένων Γλωσσών ΣΙΓΜΑ.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Sigmaschool');





     /*=============== 8 ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
         'address' => '',
         'region' => '',
         'city' => 'Αθήνα',
         'phone' => 210,
         'type_id' => 4,
         'website' => '',
         'approved' => 1,
         'ranking' => 50,
         'about' => '

            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Τούρκικα');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');

     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');


     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'LEGO Education');

     Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





    }



}
