<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria11 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;




     /*=============== 1 SPEAK ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες SPEAK', 'email' => 'info@speak.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'speak'])->id,
         'address' => 'Τσιμισκή 80',
         'city' => 'Θεσσσαλονίκη',
         'phone' => 2310225717,
         'type_id' => 4,
         'website' => 'speak.edu.gr',
         'approved' => 1,
         'about' => '
            Για περισσότερο από 30 χρόνια το Ινστιτούτο SPEAK Ξένες Γλώσσες συμβάλλει με επιτυχία στην άριστη εκμάθηση κάθε ξένης γλώσσας σε ταχύρρυθμα τμήματα ενηλίκων. Διδάσκονται Ιαπωνικά, Κινεζικά, Αραβικά, Σουηδικά, καθώς και Ρωσικά, Ρουμανικά, Βουλγαρικά, Σερβικά, Τουρκικά, Ισπανικά, Ιταλικά, Γαλλικά, Γερμανικά και φυσικά Αγγλικά.
            Οι ανάγκες και οι απαιτήσεις κάθε ατόμου σήμερα έχουν αυξηθεί και κυρίως στο θέμα της Ξενόγλωσσης Παιδείας. Είναι ένα θέμα που δεν περιορίζεται μόνο στα όρια της Ελλάδας, αλλά έχει εξαπλωθεί σε όλο τον κόσμο. Πρέπει λοιπόν να έχουν όλοι εφοδιαστεί με την γνώση όσο το δυνατόν περισσοτέρων γλωσσών.
            Γι\' αυτό και από τον Οκτώβριο του 2008 διδάσκονται πλέον και Πορτογαλικά, Πολωνικά, Νορβηγικά, Τσεχικά και Ολλανδικά. Επιπλέον παρέχονται προγράμματα εκμάθησης της Ελληνικής Γλώσσας για αλλοδαπούς. Τα SPEAK Ξένες Γλώσσες στη Θεσσαλονίκη, αποτελούν πλέον το μεγαλύτερο πολυπολιτισμικό Ινστιτούτο Ξένων γλωσσών στην Βόρειο Ελλάδα, όπου διδάσκονται 20 διαφορετικές γλώσσες.
            Οι μεγάλες συνεργασίες που έχουν εξασφαλίσει τα SPEAK, τα καθιστούν κάτι παραπάνω από ένα απλό φροντιστήριο ξένων γλωσσών. Από το Νοέμβριο του 2007 είμαστε το επίσημο εξεταστικό κέντρο στη Θεσσαλονίκη για τις εξετάσεις στη Σουηδική γλώσσα, για το πτυχίο SWEDEX. Το Νοέμβριο του 2008 ξεκίνησε η συνεργασία με το Μορφωτικό Τμήμα της Αιγυπτιακής Πρεσβείας για τη διεξαγωγή των εξετάσεων στην Αραβική γλώσσα. Η πιο πρόσφατη συνεργασία είναι αυτή με το Ινστιτούτο Dilmer στην Κωνσταντινούπολη για τη διεξαγωγή εξετάσεων στη Θεσσαλονίκη, για την Τουρκική γλώσσα.
            Στο Ινστιτούτο SPEAK Ξένες Γλώσσες δεν υπάρχουν τάξεις. Υπάρχουν ταχύτατα επίπεδα σπουδών. Τα σύγχρονα μέσα και οι μοντέρνοι χώροι διδασκαλίας αποτελούν το φυσικό πόλο έλξης και τη συνισταμένη για μια άνετη και λειτουργική παρουσία στο χώρο εκπαίδευσης. Το αυστηρά επιλεγμένο διδακτικό προσωπικό αποτελείται από καταξιωμένους - συχνά αλλοδαπούς - καθηγητές, με μεγάλη εμπειρία και με υψηλή ικανότητα μεταδοτικότητας. Η απόδοση των σπουδαστών ελέγχεται συχνά με αποτέλεσμα οι ελλείψεις και οι αδυναμίες να βελτιώνονται συνεχώς. Ο σπουδαστής έχει τη συνεχή παρακολούθηση των καθηγητών του αλλά και των εκπαιδευτικών συμβούλων σε θέματα που έχουν σχέση με τις επιδόσεις του.
            Η συνεχής Πιστοποίηση των καθηγητών εισάγει τη μελέτη του ανθρώπινου παράγοντα στη διδασκαλία κάτι που τα SPEAK Ξένες Γλώσσες θεωρούν βασική προϋπόθεση της παιδείας. Το ποσοστό επιτυχίας των σπουδαστών στις εξετάσεις είναι πάντα υψηλό και με μεγάλα scores. Οι σειρές των βιβλίων σε όλες τις γλώσσες έχουν επιλεγεί με μεγάλη προσοχή ώστε να συμφωνούν απόλυτα με το εκπαιδευτικό πρόγραμμα και έχουν τέτοια δόμηση ώστε να επιτυγχάνεται σύντομα και χωρίς ταλαιπωρία το επιθυμητό αποτέλεσμα.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 12, 'frontistirio');



        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αλβανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αραβικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Βουλγαρικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιαπωνικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Κινέζικα');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Κορεάτικα');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Νορβηγικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ολανδικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Πολωνικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Πορτογαλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρουμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Σέρβικα');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Σουηδικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Μαθήματα OnLine', 'Ξένες Γλώσσες');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/speak.school');
       Scholio::portalSocial($fake, 'twitter',  'https://twitter.com/speak_languages');
       Scholio::portalSocial($fake, 'youtube',  'https://www.youtube.com/user/SpeakLanguageSchool');






        /*=============== 2 High Pass ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες High Pass', 'email' => 'info@highpass.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'highpass'])->id,
            'address' => 'Δημ. Γούναρη 41',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310263030,
            'type_id' => 4,
            'website' => 'highpass.edu.gr',
            'approved' => 1,
            'about' => '
                    Τα Κέντρα Ξένων Γλωσσών High Pass ξεχωρίζουν με το εκπαιδευτικό πρόγραμμα που προτείνουν  για την εκμάθηση της κάθε γλώσσας, βασιζόμενο στους έμπειρους καθηγητές και τη χρήση πολυμέσων και διαδραστικών πινάκων (Interactive White Boards).
                    Προσφέρουμε εξειδικευμένα προγράμματα, προσανατολισμένα στις ανάγκες φοιτητών και ενηλίκων.
                    Τα προγράμματα σπουδών μας περιλαμβάνουν ενισχυτικά μαθήματα σε κάθε γλώσσα, επαναληπτικά τεστ, δωρεάν υλικό high pass, γραπτές και προφορικές εξετάσεις προσομοίωσης, σεμινάρια speaking, μαθήματα μέσω skype, οδηγώντας τους σπουδαστές μας στην απόκτηση πιστοποίησης στον ταχύτερο δυνατό χρόνο.
                    Η μεθοδολογία μας αποτελεί εγγύηση για την επιτυχία των σπουδαστών μας στις εξετάσεις για την απόκτηση ενός ή περισσότερων πιστοποιήσεων σε Αγγλικά, Γαλλικά, Ιταλικά, Ισπανικά, Γερμανικά, Ρώσικα και Τούρκικα.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');



        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/edu.highpass');





        /*=============== 3 thePro ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες the Pro', 'email' => 'thessaloniki@thepro.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'thePro'])->id,
            'address' => 'Παύλου Μελά 18',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2316009404,
            'type_id' => 4,
            'website' => 'thepro.gr',
            'approved' => 1,
            'about' => '
                Τα Κέντρα Ξένων γλωσσών thePro δημιουργήθηκαν το 2006 από τον Εκπαιδευτικό Όμιλο NETWORK και την Επίλεκτη Ομάδα του Ομίλου από τους πλέον έμπειρους και εξειδικευμένους καθηγητές Αγγλικής Γλώσσας και Φιλολογίας, με στόχο την παροχή εντατικών μαθημάτων εκμάθησης Αγγλικών σε ενηλίκους, καθώς και την εδραίωση ενός νέου, πιο αποτελεσματικού μοντέλου απόκτησης των πτυχίων Lower και Proficiency.
                Είναι γεγονός ότι τα Πτυχία/Πιστοποιήσεις Αγγλικών έχουν πια ενσωματωθεί στα βασικά και προαπαιτούμενα προσόντα από τους περισσότερους ακαδημαϊκούς, εκπαιδευτικούς, αλλά και επαγγελματικούς φορείς και σε συνδυασμό με την ολοένα αυξανόμενη χρήση της Αγγλικής Γλώσσας στην καθημερινότητά μας, δημιουργούνται νέες ανάγκες σε όσους φοιτητές, αποφοίτους, νέους και εργαζόμενους προσπαθήσουν να εκπληρώσουν έναν εκπαιδευτικό στόχο ή να αναζητήσουν εργασία.
                Στηριζόμενοι στα πλεονεκτήματα που παρουσιάζουν οι ενήλικες κατά τη διαδικασία τόσο της διδασκαλίας όσο και της μάθησης, το thePro κατάφερε να διαμορφώσει σύγχρονα προγράμματα σπουδών, τα οποία ανταποκρίνονται πλήρως στις ανάγκες και τις απαιτήσεις των ενήλικων εκείνων, οι οποίοι:
                α) επιθυμούν να μάθουν Αγγλικά, παράλληλα με τις σπουδές ή/και την εργασία τους
                β) να εξασφαλίσουν ένα Πτυχίο/Πιστοποίηση* Αγγλικών, με αναγνώριση από όλους τους επίσημους δημόσιους και ιδιωτικούς φορείς, τα οποία χορηγούνται από το Cambridge University, από το University of Michigan και διάφορους άλλους πιστοποιημένους φορείς εξετάσεων (*Lower – Advanced – Proficiency).
                Το 2016 μετά την καινοτόμο και επιτυχή του πορεία στην Αγγλική γλώσσα αλλά και την καθημερινή απαίτηση των μαθητών του, το thePro αποφάσισε να προχωρήσει στην δημιουργία προγραμμάτων σπουδών και για άλλες ξένες γλώσσες. Το γεγονός ότι ένα σημαντικό ποσοστό των νέων επιλέγουν σήμερα να μεταναστεύσουν σε μία ευρωπαϊκή χώρα είτε για σπουδές είτε για εύρεση εργασίας δημιούργησε την ανάγκη για νέα προγράμματα εκμάθησης ευρωπαϊκών γλωσσών βασισμένα στο επιτυχημένο πρότυπο εκμάθησης αγγλικών.
                Έτσι, σήμερα το thePro, έχοντας ενσωματώσει στο δυναμικό του νέους καθηγητές με πολυετή πείρα στην εκπαίδευση ενηλίκων παρέχει προγράμματα σπουδών για όλες τις ευρωπαϊκές γλώσσες, απευθυνόμενο αποκλειστικά σε φοιτητές, αποφοίτους, νέους και εργαζόμενους.
                Το thePro είναι εδώ για να σας προσφέρει μία ολοκληρωμένη εκπαιδευτική εμπειρία με τον πιο σύντομο και αποτελεσματικό τρόπο.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Δανέζικα');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Πορτογαλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');


        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/thePro.ProficiencyExperts');




        /*=============== 4 ASSOS ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρα Ξένων Γλωσσών ASSOS', 'email' => 'kamara@assos.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'assos'])->id,
            'address' => 'Εγνατίας 144',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310235777,
            'type_id' => 4,
            'website' => 'assos.edu.gr',
            'approved' => 1,
            'about' => '
                Όραμα
                Ο καλύτερος τρόπος για να προβλέψουμε το μέλλον… είναι να το πλάσουμε όπως εμείς επιθυμούμε…
                Το όραμα των ASSOS είναι να συνεχίσει να αναγνωρίζεται ως ένας διακεκριμένος Εκπαιδευτικός Οργανισμός γνωστός για την ακεραιότητα, την ακαδημαϊκή αριστεία και τις καινοτόμες μεθόδους διδασκαλίας του. Στόχος μας είναι να παρέχουμε ποιοτικές υπηρεσίες εκπαίδευσης, σε ανθρώπους από όλο τον κόσμο, και να τους διευκολύνουμε ώστε να μάθουν Ξένες Γλώσσες, Πληροφορική και να τους παρέχουμε εκπαίδευση σε θέματα στελέχωσης επιχειρήσεων. Επιπλέον, στόχος μας είναι να εδραιώσουμε στο χώρο της εκπαίδευσης τη μεθοδολογία του blended learning με τη βοήθεια έμπειρων και ικανών on-line καθηγητών (σύγχρονη και ασύγχρονη τηλεκπαίδευση).
                Κεντρικοί άξονες στην υλοποίηση του οράματός μας αποτελούν:
                η δημιουργία σύγχρονων προγραμμάτων διδασκαλίας τα οποία βοηθούν τους σπουδαστές μας στην ευκολότερη αφομοίωση των γνώσεων και τους οδηγούν με ασφάλεια στην επιτυχία και την απόκτηση πιστοποίησης
                η διάθεση όλων εκείνων των προγραμμάτων και υπηρεσιών στους σπουδαστές μας που μας κάνουν ξεχωριστούς και πρωτοπόρους στις εξελίξεις
                η συνεχής ανάπτυξη και επιμόρφωση του ανθρώπινου δυναμικού μας
                Η αποστολή μας
                Η αποστολή του εκπαιδευτικού οργανισμού ASSOS είναι να παρέχει γνώση και να δημιουργεί ισχυρά ακαδημαϊκά θεμέλια στους σπουδαστές του, με τη συνεχή προσαρμογή τους στις σύγχρονες εκπαιδευτικές ανάγκες τους και την ουσιαστική προσφορά μιας σειράς εκπαιδευτικών προγραμμάτων τα οποία συμπεριλαμβάνουν τις ξένες γλώσσες, την πληροφορική καθώς και την εκπαίδευση στελεχών επιχειρήσεων.
                Πρωταρχικός και αδιαπραγμάτευτος στόχος του οργανισμού μας είναι η υιοθέτηση των πιο αυστηρών, αλλά και εφικτών κριτηρίων σπουδών για την κάλυψη των εκπαιδευτικών αναγκών των εφήβων, των φοιτητών, των εργαζομένων και των επιχειρηματιών. Η δραστηριοποίησή μας εστιάζεται ιδιαίτερα στους σπουδαστές που ενδιαφέρονται για συνεχή εκπαίδευση, δια βίου μάθηση και εξειδίκευση στον τομέα τους, προκειμένου να έχουν διαρκή οφέλη στην καριέρα τους, να πετύχουν τους ατομικούς τους στόχους και να επιτελέσουν ενεργό ρόλο σε ένα πολυ-πολιτισμικό και πολύπλευρο κόσμο.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 7, 'frontistirio');



        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Κινέζικα');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Νορβηγικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ολανδικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Σουηδικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');



        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Adobe Photoshop');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Adobe Illustrator');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Adobe Premiere');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Web Design');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Web Development');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Βασικός Χειρισμός Η/Υ');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/assos.edu.gr');
       Scholio::portalSocial($fake, 'youtube',  'https://www.youtube.com/user/ASSOSLanguages');
       Scholio::portalSocial($fake, 'twitter',  'https://twitter.com/ASSOSEDU');



        /*=============== 5 so easy ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρα Ξένων Γλωσσών so easy', 'email' => 'info@soeasy.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'soeasy'])->id,
            'address' => 'Κουντουριώτου 108, Πειραιάς',
            'city' => 'Αθήνα',
            'phone' => 2104137919,
            'type_id' => 4,
            'website' => 'soeasy.gr',
            'approved' => 1,
            'about' => '
                Τα So easy® παρέχουν το ιδανικό μάθημα σε ολιγομελή τμήματα (4-8 ατόμων). Ασχολούμαστε με κάθε μαθητή ξεχωριστά, παρακινώντας τον να εξελίσσεται συνεχώς μέσω της ευγενούς άμιλλας.
                Τα χρονοδιαγράμματα είναι ρεαλιστικά αλλά και ευέλικτα και ορίζονται με βάση την ηλικία των σπουδαστών και το επίπεδο δυσκολίας της ύλης ή του πτυχίου.
                Το ενδεχόμενο κόστος μετακίνησης ή βιβλίων δεν μπορεί να αποτελεί κριτήριο για την εκπαίδευση. Εξάλλου τα κενά που δημιουργούνται από μία ανεξέλεγκτη εκπαίδευση συνήθως κοστίζουν περισσότερο και σε χρόνο και σε χρήμα για να καλυφθούν.
                Στα ατομικά μαθήματα, σύμφωνα με στατιστικές, το ποσοστό επιτυχίας είναι ανησυχητικά χαμηλό καθώς η επιλογή βιβλίου, χρονοδιαγράμματος αλλά και του χρόνου εξάσκησης κάθε δεξιότητας της γλώσσας γίνεται από έναν καθηγητή ο οποίος τις περισσότερες φορές είναι άγνωστος σε εμάς. Στα So easy® τα ποσοστά επιτυχίας στις εξετάσεις αποδεικνύουν την ποιότητα της εκπαίδευσης που παρέχουμε.
                Στα So easy® ακολουθείται αυστηρά συγκεκριμένο χρονοδιάγραμμα, προκειμένου να καλύπτεται η διδακτική ύλη ανά επίπεδο και σε πραγματικές ώρες
                Oι μαθητές με μαθησιακές δυσκολίες δεν ευνοούνται σε πολυπληθείς τάξεις. Το ιδανικό είναι ο συνδυασμός ατομικού μαθήματος και τάξης όπου ο μαθητής μπορεί να εξασκήσει με τους συμμαθητές του δεξιότητες της γλώσσας και να ενταχθεί σε μία κοινωνική ομάδα με συνομηλίκου
                Επιπλέον, στα κέντρα ξένων γλωσσών So easy® εστιάζουμε σε κάθε σπουδαστή ξεχωριστά, αφού καθένας έχει τις δικές του ανάγκες και ιδιαιτερότητες και με βάση αυτά τα στοιχεία σκιαγραφούμε το ακαδημαϊκό του προφίλ. Mελετώντας τους στόχους και τις φιλοδοξίες του, επιλέγουμε γι’ αυτόν το κατάλληλο πρόγραμμα για την επίτευξη των στόχων αυτών. Δεν είναι τυχαίο άλλωστε ότι η So easy® έχει αναγνωριστεί ως ένα από τα εγκυρότερα εκπαιδευτήρια ξένων γλωσσών διεθνώς, αφού τα προγράμματά της είναι αυτό ακριβώς που ζητάει κάθε σπουδαστής: Προσαρμοσμένα στις δικές του ανάγκες!
            ',
            'background' => $background,
        ]);

        new Portal($fake, 12, 'frontistirio');


        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αραβικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Κινέζικα');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Τούρκικα');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αραβικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Κινέζικα');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'SAT');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'PTE');

       Scholio::portalSocial($fake, 'facebook',  'https://www.facebook.com/SoEasySchools');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/soeasy_gr');
       Scholio::portalSocial($fake, 'youtube',  'https://www.youtube.com/channel/UCdv-7W6H-DTNHCc5TAPNzOA');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/company/so-easy/');



        /*=============== 6 lelaki ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες lelaki', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'lelaki'])->id,
            'address' => 'Σπύρου Λούη 2',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310242529,
            'type_id' => 4,
            'website' => 'lelaki.gr',
            'approved' => 1,
            'about' => '
                Προφίλ Εκπαίδευσης
                Το Αγγλικό τμήμα του Κέντρου ιδρύθηκε το 1990. Μέσα σε λίγα χρόνια, με τη δουλειά και τη συνέπειά του, κέρδισε την εμπιστοσύνη μαθητών από όλη τη Θεσσαλονίκη.
                Οι μαθητές μας μαθαίνουν σωστά την Αγγλική γλώσσα και πετυχαίνουν με την πρώτη!
                Η επιτυχία μας οφείλεται:
                Στην ομάδα των καθηγητών.
                Οι περισσότεροι καθηγητές της σχολής έχουν μόνιμη σχέση με τη σχολή και νοιάζονται πραγματικά για την επιτυχία των μαθητών. Συνδυάζουν εμπειρία, εκπαιδευτική αριστεία, προσωπική επαφή και μεταδοτικότητα. Όλοι οι καθηγητές έχουν πανεπιστημιακό τίτλο (Ελληνικού ή ξένου πανεπιστημίου). Υπάρχουν επίσης αγγλόφωνοι (native speakers).
                Στα ευέλικτα προγράμματα διδασκαλίας.
                Επειδή βασίζουμε τα προγράμματα μας στο δικό σας πρόγραμμα μπορούμε να εγγυηθούμε ότι θα βρούμε πρόγραμμα που να σας βολεύει.
                Στο διαχωρισμό τμημάτων.
                Τα τμήματα είναι αμιγώς ενηλίκων ή αμιγώς παιδικά, με ξεχωριστή εκπαιδευτική προσέγγιση για κάθε ηλικιακή ομάδα. Επίσης, τα τμήματα Proficiency χωρίζονται σε αμιγώς τμήματα Michigan ECCE και αμιγώς τμήματα Cambridge CPE και δεν ακολουθούν κοινή ύλη.
                Στη σωστή επιλογή του τμήματος και του πτυχίου.
                Σήμερα υπάρχουν τόσο πολλά πτυχία (πιστοποιητικά) αγγλικών που υπόσχονται αναγνώριση και ευκολία στην εξέταση που οι υποψήφιοι συχνά παραπλανιούνται και καταλήγουν να κάνουν ελλιπή προετοιμασία παρασυρμένοι από την «ευκολία» τους. Στο LELAKI δεν το αφήνουμε αυτό να συμβεί! Προτείνουμε την σωστότερη προετοιμασία και συμβουλεύουμε ποια εξέταση θα πρέπει να επιλεγεί.
                Στα συχνά tests.
                Η φύση των πιστοποιητικών Αγγλικών απαιτεί μεγάλη εξάσκηση στο format των εξετάσεων. Φροντίζουμε γι’ αυτό δίνοντας στους μαθητές κατάλληλα tests ή tests προηγούμενων ετών (past papers) εκτός των ωρών διδασκαλίας και τα διορθώνουμε μέσα στην τάξη. Επιπλέον διοργανώνουμε δύο γενικές εξετάσεις (mock tests) πριν τα Χριστούγεννα και πριν το Πάσχα σε κανονικές χρονομετρημένες συνθήκες εξετάσεων.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/lelaki.gr');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/lelaki_ifl');




        /*=============== 7 Avanti ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Avanti', 'email' => 'alimperti.vasiliki@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'avanti'])->id,
            'address' => 'Λαμπράκη Γρηγορίου 120, Τούμπα',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310921704,
            'type_id' => 4,
            'website' => 'avanti-los.gr',
            'approved' => 1,
            'about' => '
                Η μελέτη μιας ξένης γλώσσας είναι ένα αποτελεσματικό μέσο για να γνωρίσει κανείς καλύτερα έναν λαό και τον πολιτισμό του, αλλά και τον εαυτό του τον ίδιο. Ένα μέσο για να ανταποκριθεί στις ανάγκες της σύγχρονης κοινωνίας και της αγοράς εργασίας. Οι ξένες γλώσσες είναι το φως του μυαλού, είναι όπλο στα χέρια μας, είναι ένα παράθυρο στον κόσμο, είναι αυτοπεποίθηση να παλέψεις τα όνειρά σου και να διεκδικήσεις με καλύτερους όρους θέσεις εργασίας.
                Η εκμάθηση μιας γλώσσας είναι μια ξεχωριστή εμπειρία. Εμείς το γνωρίζουμε πολύ καλά στο AVANTI και διδάσκουμε με ζωντάνια, πάθος, πάντα με γνώμονα τις σύγχρονες ανάγκες των μαθητών μας.
                Στο Κέντρο Ξένων Γλωσσών AVANTI διδάσκονται αγγλικά, γαλλικά, γερμανικά, ιταλικά, ισπανικά, ρωσικά και τουρκικά, με τμήματα που καλύπτουν όλες τις βαθμίδες των πτυχίων. Τμήματα για παιδιά και εφήβους λειτουργούν σε όλες τις γλώσσες με σύγχρονη-πρωτοποριακή βιβλιογραφία, έμπειρους καθηγητές και σύγχρονες μεθόδους διδασκαλίας.
                Είμαστε μέλη του Palso και τα τελευταία χρόνια επίσημο εξεταστικό κέντρο στην τουρκική γλώσσα στο πιστοποιητικό DİLMER, του ινστιτούτου DİLMER της Κωνσταντινούπολης. Καθώς και κέντρο πρακτικής άσκησης σε συνεργασία με το Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης (Α.Π.Θ) στο τμήμα της ιταλικής γλώσσας και φιλολογίας.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');


        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Τούρκικα');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/avantilos');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UC5L_yOZHUaFY29RmSVqCPjg');





        /*=============== 8 Χίτογλου-Φυτώκα ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Χίτογλου-Φυτώκα', 'email' => 'v.hitogloufytoka@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'hitoglouFytoka'])->id,
            'address' => 'Θερμοπυλών 29',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310841974,
            'type_id' => 4,
            'website' => 'chitoglou-fytoka.gr',
            'approved' => 1,
            'about' => '
                   Οι εκπαιδευτικοί μας θέτουν ξεκάθαρους στόχους για κάθε μάθημά τους και βασιζόμενοι σε αυτούς οργανώνουν πιο αποτελεσματικά την εκπαιδευτική διαδικασία. Οι στόχοι για την εκμάθηση της Αγγλικής γλώσσσας μπορεί να είναι
                   γλωσσικοί, συναισθηματικοί, γνωστικοί, στάσεις/αξίες, διαπολιτισμικοί.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 9, 'frontistirio');


        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');




        /*=============== 9 Status ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Status', 'email' => 'info@status.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'status'])->id,
            'address' => 'Τσιμισκή 130 ',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310244955,
            'type_id' => 4,
            'website' => 'status.edu.gr',
            'approved' => 1,
            'about' => '
                To STATUS είναι το Κέντρο Ξένων Γλωσσών της Θεσσαλονίκης που σας εγγυάται την σωστή και γρήγορη εκμάθηση της γλώσσας που θα διαλέξετε αφού στηρίζεται στην 25ετή εμπειρία του στον χώρο αυτό.
                Απευθύνεται σε εσάς φοιτητές, σπουδαστές και επαγγελματίες που θέλετε να αναπτύξετε τις γνώσεις σας.
                Μαζί μας εκτός από την γλώσσα που επιθυμείτε,θα γνωρίσετε την κουλτούρα της αντίστοιχης χώρας, τέχνες και γράμματα,κινηματογράφο και τραγούδια, αξιοθέατα, φαγητά και ότι άλλο αφορά στη ζωή των κατοίκων της.
                Έχουμε άριστους και πολύ έμπειρους καθηγητές,σύγχρονες μεθόδους διδασκαλίας, εξειδικευμένη ύλη, ολιγομελή τμήματα, ευχάριστες αίθουσες.
                Για επιπλέον εξάσκηση των γλωσσών γίνεται χρήση ειδικών προγραμμάτων μέσω του διαδικτύου.
                Η διάθεσή μας είναι φιλική και υποστηρικτική απέναντι στους μαθητές μας. Προσαρμόζουμε το πρόγραμμά μας ανάλογα με τις υποχρεώσεις των σπουδαστών μας.
                Η εκμάθηση της γλώσσας μαζί μας είναι ευχάριστη και αποτελεσματική γι αυτό και η απόκτηση ενός πτυχίου είναι μ΄ εμάς εξασφαλισμένη.
                Γιατί οι ξένες γλώσσες είναι προσόν και είναι STATUS.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 10 AXON Τούμπας ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες AXON Τούμπας', 'email' => 'info@axon-toumpa.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'axonToumpa'])->id,
            'address' => 'Γρ.Λαμπράκη 61, Τούμπα',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310949414,
            'type_id' => 4,
            'website' => 'axon-toumpa.gr',
            'approved' => 1,
            'about' => '
                Εγώ, η Ντάκμαρ Θεοδωροπούλου, γενική διευθύντρια και ιδιοκτήτρια των φροντιστηρίων AXON TOUMPA & PYLEA γεννήθηκα το 1951 στο δυτικό Βερολίνο, είμαι η μεγαλύτερη από 4 αδέρφια. Σπούδασα γερμανική φιλολογία, πολιτικές επιστήμες και οικονομικά στο πανεπιστήμιο του Κίελου (βρίσκεται βόρεια, κοντά στα σύνορα με τη Δανία). Εκεί γνωρίστηκα με τον τότε φοιτητή της οικονομικής σχολής Βασίλειο Θεοδωρόπουλο, ο οποίος δεν με άφησε ούτε στιγμή από εκεί και έπειτα. Επί 12 χρόνια, από το 1972-1984 δίδασκα στη Γερμανία σε δημόσια σχολεία Γερμανικά, με ειδίκευση στη διδασκαλία σε άτομα με διαταραχή λόγου, καθώς επίσης και με μαθησιακές δυσκολίες Επίσης δίδασκα Πολιτικές Επιστήμες, Ιστορία και Αγγλικά αλλά και Γερμανικά ως ξένη γλώσσα.
                Το 1978 μια υπερβολικά ζεστή μέρα τελέσαμε τον ορθόδοξο γάμο μας στην Αθήνα και έτσι απέκτησα και την Ελληνική υπηκοότητα.
                Το 1981 γεννήθηκε ο γιος μας Ανδρέας και το 1982 η κόρη μας Αλεξάνδρα. Και τα δύο μας παιδιά πήγαν σε δημόσια σχολεία στην Τούμπα, ανέμελα χρόνια τότε, ήταν παιδιά της γειτονιάς. Σε ποιο φροντιστήριο έμαθαν ξένες γλώσσες και απέκτησαν τα πτυχία τους στα σχολικά τους χρόνια σε group έως 9 ατόμων; Στα AXON TOUMPA & PYLEA.
                Το 1984 μας έφερε ο σύζυγος μου στην Ελλάδα. Θέλαμε να ζήσουμε και στη χώρα από την οποία κατάγεται το άλλο μισό της οικογένειας, κι έτσι εγκατασταθήκαμε στην Άνω Τούμπα, στη Θεσσαλονίκη. Παραιτήθηκα από την μόνιμη θέση εργασίας που είχα στην Γερμανία και τα 2 πρώτα χρόνια ασχολήθηκα με τα ιδιαίτερα μαθήματα (το συνηθισμένο!!!). Στη συνέχεια εργάστηκα ως κοινωνική λειτουργός και παιδαγωγός μέχρι το 1996, στη γερμανική κοινότητα. Υπάρχουν περίπου 200.000 γερμανόφωνοι σε όλη τη βόρεια Ελλάδα, από τους οποίους οι περισσότεροι βρέθηκαν στην Ελλάδα για τους ίδιους λόγους όπως και εγώ. Ακολουθήσαμε την καρδιά μας, με όλα τα καλά, αλλά και πολλές φορές τα δύσκολα που προκύπτουν μέσα από μια τέτοια απόφαση.
                Το 1997 αποφασίσαμε να αναλάβουμε με το σύστημα Franchise, τα AXON TOUMPA & PYLEA στην ΤΟΥΜΠΑ με αρχικά 4 αίθουσες. Γιατί; Επειδή ήταν το μόνο εκπαιδευτικό σύστημα που ήταν επικοινωνιακό, χρησιμοποιούσε οπτικοαουστικά μέσα, multimedia στον υπολογιστή για την εκμάθηση μιας ξένης γλώσσας και για μένα το αποτελεσματικότερο απ’ όλα, είναι ότι βασίζονταν στον τρόπο διδασκαλίας που είχα διδαχθεί και εφαρμόσει μετά από τις σπουδές μου. Όπως είπε και ο Αριστοτέλης: «Παίζοντας μαθαίνεις», δηλαδή μαθαίνω με όρεξη, κέφι, αγαπάω αυτό που μαθαίνω και εξασκώ τη γλωσσά. Μαθαίνω για τη ζωή, εφοδιάζομαι για το μέλλον ή για να πάω ένα βήμα μπροστά, για την καριέρα μου.
                Μεγάλη μου λατρεία μου όμως έγιναν τώρα τα δύο μικρά εγγόνια μου.
                Μέσα από τα σχολεία AXON TOUMPA & PYLEA οργάνωσα πολλές φορές με επιτυχία, εκπαιδευτικά ταξίδια στο εξωτερικό και ιδιαίτερα στη Γερμανία για τους σπουδαστές των Γερμανικών. Οι ευχάριστες αναμνήσεις και τα χαμόγελα των σπουδαστών μας μετά από κάθε επιστροφή αποτελούν την καλύτερη ανταμοιβή στο έργο μας για εμένα και τον σύζυγο μου.
                Με τα σχολεία ΑΧΟΝ εκπλήρωσα κάποια από τα όνειρα και τα οράματά μου, γιατί διευθύνω σχολεία που δεν παρέχουν μόνο στοιχειώδη εκπαίδευση. Η εκμάθηση της ξένης γλώσσας στα ΑΧΟΝ είναι αποτελεσματική και παρέχει τα καλύτερα εφόδια με ευχάριστο τρόπο για ένα καλύτερο αύριο. Στα σχολεία AXON TOUMPA & PYLEA δεν μεταδίδουμε μόνο γνώσεις, διότι είμαστε μια μικρή κοινωνία, διδάσκουμε στάση ζωής, πλάθουμε χαρακτήρες και ιδιαιτέρως την πνευματική προσωπικότητα.
                Φαίνεται πως τα λίγα λόγια τελικά έγιναν πολλά. Σ’ αυτό το σημείο θα ήθελα να ευχαριστήσω όλους τους σπουδαστές και τις οικογένειές τους θερμότατα για την εμπιστοσύνη που μας δείχνουν τόσα χρόνια!!!
                Δυναμικά και ακούραστα κοντά σας για σπουδές με αξιώσεις και στην εκμάθηση εξ αποστάσεως.

                    Με εκτίμηση,
                    Ντάκμαρ Θεοδωροπούλου
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Σέρβικα');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Βουλγάρικα');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Πληροφορική', 'Προγραμματισμός ηλεκτρονικών παιχνιδιών');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Προγραμματισμός');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/AXON.TOUMPA.PYLEA');
       Scholio::portalSocial($fake, 'twitter',  'https://twitter.com/axontoumpa');
       Scholio::portalSocial($fake, 'youtube',  'https://www.youtube.com/channel/UCd8yPYrGhxYddoscjqIPv5w');
       Scholio::portalSocial($fake, 'google-plus',  'https://plus.google.com/101155328302723317127');



        /*=============== 11 Αλμπάνη ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Αλμπάνη', 'email' => 'albaniel@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'albani'])->id,
            'address' => 'Ν. Πλαστήρα 10, Σταυρούπολη',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310659156,
            'type_id' => 4,
            'website' => 'albani.edu.gr',
            'approved' => 1,
            'about' => '
                Προσφέρουμε εδώ και πολλά χρόνια:
                Πολυετή διδακτική πείρα απο έμπειρους καθηγητές.
                Σύγχρονα προγράμματα σπουδών.
                Άνετο φιλικό και ήσυχο περιβάλλον.
                Ολιγομελή τμήματα.
                Σύγχρονα εποπτικά μέσα(Computers, Interactive boards).
                Επικοινωνία με τους γονείς και συστηματική παρακολούθηση της προόδου του μαθητή.
                Δωρεάν δανεισμός βιβλίων και περιοδικών.
                Θερινά ολιγομελή εντατικά τμήματα σε κλιματιζόμενες αίθουσες.
                Δίδακτρα ιδιαίτερα προσιτά.
                Μάθημα με Tablets για τον κάθε μαθητή, μιά πρωτοποριακή μέθοδος, ιδιαίτερα χρηστική για τον μαθητή.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Τούρκικα');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');




        /*=============== 12 AXON Καλαμαριάς ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες AXON Καλαμαριάς', 'email' => 'axon-kal@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'axonKalamarias'])->id,
            'address' => 'Ιμέρας 5, Καλαμαριά',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310452345,
            'type_id' => 4,
            'website' => 'axonkalamaria.edu.gr',
            'approved' => 1,
            'about' => '
                Συμβουλευτική Σταδιοδρομίας
                Ολοκληρωμένο Πρόγραμμα Επαγγελματικού Προσανατολισμού
                Η AXON προσφέρει το Ολοκληρωμένο Πρόγραμμα Επαγγελματικού Προσανατολισμού, το οποίο αποτελεί μια ολοκληρωμένη συμβουλευτική διαδικασία η οποία απευθύνεται στους μαθητές της Γ’ γυμνασίου και όλων των τάξεων του Λυκείου.
                Οι Σύμβουλοι, μέσα από προσωπικές συνεντεύξεις και με τη χρήση ψυχομετρικών τεστ (επαγγελματικών ενδιαφερόντων & προσωπικότητας), βοηθούν τους μαθητές στη διερεύνηση και κατανόηση των επαγγελματικών τους ενδιαφερόντων και των χαρακτηριστικών της προσωπικότητάς τους.
                Στο Ολοκληρωμένο Πρόγραμμα Επαγγελματικού Προσανατολισμού, δίνεται έμφαση στο  να αποκτήσουν οι μαθητές και οι γονείς ολοκληρωμένη πληροφόρηση για τις σχολές που ανταποκρίνονται στις προτιμήσεις τους και να εφοδιαστούν με όλα τα απαραίτητα προσόντα ώστε να πετύχουν τον ακαδημαϊκό τους στόχο.
                Ειδικός σύμβουλος θα σας καθοδηγήσει μετά την εξέταση για να αναλύσει μαζί σας όλες τις πιθανότητες για μία σωστή επαγγελματική κατεύθυνση.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');


        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αράβικα');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιαπωνικά');



        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αράβικα');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιαπωνικά');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση ΑΣΕΠ');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Web Design');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Mobile Εφαρμογές ');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'AutoCAD');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GRE');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'SAT/ACT');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'PTE');


        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/axon.kalamarias');





        /*=============== 13 Καλογραία ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών Καλογραία', 'email' => 'aspasiakalograia@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'kalograia'])->id,
            'address' => 'Αρτέμιδος 34',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310864040,
            'type_id' => 4,
            'website' => 'aspasia-kalograia.gr',
            'approved' => 1,
            'about' => '
                    Το Κέντρο Ξένων Γλωσσών ΑΣΠΑΣΙΑ ΚΑΛΟΓΡΑΙΑ, λειτουργεί απο το 1980, προετοιμάζοντας με μεγάλη επιτυχία πτυχία Αγγλικής γλώσσας σε επίπεδο Lower και Proficiency όπως ECCE, ECPE, FCE, CPE, IELTS,TOEIC, TOEFL.
                    Λειτουργούν τμήματα φοιτητών, εργαζομένων, business english και μαθητών Γυμνασίου και Λυκείου. Για τους μικρούς μας φίλους του Δημοτικού, ξεκινούν τμήματα από Pre-junior.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');



        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'ECPE');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'ECCE');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'FCE');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'CPE');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/AspasiaKalograiaFrontistirio');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/in/aspasia-kalograia-9b781745/');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCXayzGZthi_YsAEwaw6RdmQ');


        /*=============== 14 toptsi ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών toptsi', 'email' => 'info@toptsi.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'toptsi'])->id,
            'address' => 'Αλ. Παπαναστασίου 126',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310989907,
            'type_id' => 4,
            'website' => 'toptsi.gr',
            'approved' => 1,
            'about' => '
                Το Κέντρο Ξένων Γλωσσών «ΤΟΠΤΣΗ» διανύει μία 25ετή επιτυχημένη πορεία στο χώρο της ξενόγλωσσης εκπαίδευσης.
                Σκοπός του κέντρου είναι προσφέρει ένα πρόγραμμα σπουδών το οποίο στόχο έχει όχι μόνο την απόκτηση ενός πιστοποιητικού γλωσσομάθειας αλλά και τη γενικότερη διαπαιδαγώγηση του παιδιού. Το παιδί σας δεν θα αποφοιτήσει κρατώντας απλώς ένα πτυχίο, αλλά θα λάβει κυρίως μια σφαιρική και παιδαγωγική επιμόρφωση στη γλώσσα και τον πολιτισμό της ξένης γλώσσας.
                Η οργάνωση του σχολείου μας, η υπευθυνότητα, ο σωστός προγραμματισμός καθώς και ο σεβασμός στην διαφορετικότητα του κάθε μαθητή αποτελούν τα κύρια χαρακτηριστικά της πολύχρονης επιτυχίας του.
                Δημιουργήσαμε ένα σχολείο που να ανταποκρίνεται στους σκοπούς και ρόλους τους οποίους ο θεσμός της ξενόγλωσσης εκπαίδευσης οφείλει να υπηρετεί στη σύγχρονη εποχή όπως:
                Δημιουργήσαμε ένα περιβάλλον ασφάλειας, ελέγχου και επικοινωνίας για τα παιδιά,
                Επιλέγουμε με αυστηρά κριτήρια τους δασκάλους που στελεχώνουν τη σχολή μας και αποτελεσματικές μεθόδους διδασκαλίας,
                Διατηρούμε περιορισμένο αριθμό παιδιών ανά τμήμα για αποτελεσματικότερο παιδαγωγικό έργο,
                Παρακολουθούμε από πολύ κοντά την πορεία και εξέλιξη του κάθε μαθητή μας,
                Διατηρούμε συνεχή και ουσιαστική επικοινωνία με τους γονείς,
                Καλλιεργούμε το ομαδικό πνεύμα και ενισχύουμε την αίσθηση σεβασμού, ευθύνης και προσφοράς στο σύνολο.
                Η φιλοσοφία μας οδηγεί στη γνώση και όσα μαθαίνουμε από τις εμπειρίες προηγουμένων ετών, φροντίζουμε να τα μετατρέπουμε σε περαιτέρω βελτιώσεις και καινοτομίες για τις επόμενες χρονιές, τις οποίες οι μαθητές μας παρατηρούν καθημερινά.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');

       Scholio::portalSocial($fake, 'facebook',  'https://www.facebook.com/Κέντρο-Ξένων-Γλωσσών-Toptsi-126228937474247/');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/toptsi_language_school/');




        /*=============== 15 ΕΥΡΩΓΝΩΣΗ – EuroL@b Καλαμαριά ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτικός Όμιλος ΕΥΡΩΓΝΩΣΗ – EuroL@b Καλαμαριά', 'email' => 'kalamaria@eurognosi.info', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'eurognosiKalamaria'])->id,
            'address' => 'Ι. Πασαλίδη 77, Καλαμαριά',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310488084,
            'type_id' => 4,
            'website' => 'eurognosi.com',
            'approved' => 1,
            'about' => '
                    Στην ΕΥΡΩΓΝΩΣΗ τα παιδιά μαθαίνουν Αγγλικά από πολύ μικρή ηλικία μέσα σε real-life setting περιβάλλον έχοντας μια ολιστική προσέγγιση στην εκμάθηση της γλώσσας.
                    Οι μικροί μας φίλοι απολαμβάνουν μία μαγική διαδρομή μέσα από τις περιπέτειες του Alf, την πρώτη σειρά παιδικών βιβλίων της ΕΥΡΩΓΝΩΣΗ όπου διασκέδαση και μάθηση συνδυάζονται αρμονικά υπό το πρίσμα της πιο σύγχρονης μεθοδολογίας.
                    Οι μαθητές ανακαλύπτουν σταδιακά τις γλωσσικές τους ικανότητες μέσα από μία επιλογή ασκήσεων και δραστηριοτήτων που δίνουν έμφαση στην κριτική σκέψη.

                    Όλα τα παραπάνω επιτυγχάνονται στην ΕΥΡΩΓΝΩΣΗ με την Μέθοδο Learn®.
                    Η Μέθοδος Learn® με την χρήση ειδικών εκπαιδευτικών μέσων όπως διαδραστικοί πίνακες, αποσπάσματα βίντεο/DVD, παιχνίδια, tablets και άλλες δραστηριότητες παρακινεί το σπουδαστή να συμμετέχει στην μάθηση. Η Μέθοδος Learn® προσφέρει:
                    Μεταφορά της ζωντανής πραγματικότητας στην τάξη
                    Εμπλουτισμό του μαθήματος με πολιτιστικά στοιχεία
                    Ζωντανή επαφή με την γλώσσα και την κουλτούρα

                    CLIL
                    Συνοδέψτε τους ήρωες της ΕΥΡΩΓΝΩΣΗ  στο συναρπαστικό ταξίδι της μάθησης μέσω της προσέγγισης CLIL-Content and Language Integrated Learning που δίνει τη δυνατότητα στους μαθητές να ανακαλύπτουν και να επεξεργάζονται θεματικές ενότητες διαπολιτισμικού περιεχομένου χρησιμοποιώντας την Αγγλική γλώσσα ως εργαλείο.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 9, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'BEC');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'MSU');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GRE');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'PTE');

     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'AutoCAD');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Android');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Adobe Photoshop');


        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/EUROGNOSIKalamarias');



     /*=============== 16 ΕΥΡΩΓΝΩΣΗ Θέρμης ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτικός Όμιλος ΕΥΡΩΓΝΩΣΗ Θέρμης', 'email' => 'thermi@eurognosi.info', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'eurognosiThermi'])->id,
         'address' => 'Θεοδώρου Λίτσα 9, Θέρμη',
         'city' => 'Θεσσσαλονίκη',
         'phone' => 2310478181,
         'type_id' => 4,
         'website' => 'eurognosi.com',
         'approved' => 1,
         'about' => '
                    Στην ΕΥΡΩΓΝΩΣΗ τα παιδιά μαθαίνουν Αγγλικά από πολύ μικρή ηλικία μέσα σε real-life setting περιβάλλον έχοντας μια ολιστική προσέγγιση στην εκμάθηση της γλώσσας.
                    Οι μικροί μας φίλοι απολαμβάνουν μία μαγική διαδρομή μέσα από τις περιπέτειες του Alf, την πρώτη σειρά παιδικών βιβλίων της ΕΥΡΩΓΝΩΣΗ όπου διασκέδαση και μάθηση συνδυάζονται αρμονικά υπό το πρίσμα της πιο σύγχρονης μεθοδολογίας.
                    Οι μαθητές ανακαλύπτουν σταδιακά τις γλωσσικές τους ικανότητες μέσα από μία επιλογή ασκήσεων και δραστηριοτήτων που δίνουν έμφαση στην κριτική σκέψη.

                    Όλα τα παραπάνω επιτυγχάνονται στην ΕΥΡΩΓΝΩΣΗ με την Μέθοδο Learn®.
                    Η Μέθοδος Learn® με την χρήση ειδικών εκπαιδευτικών μέσων όπως διαδραστικοί πίνακες, αποσπάσματα βίντεο/DVD, παιχνίδια, tablets και άλλες δραστηριότητες παρακινεί το σπουδαστή να συμμετέχει στην μάθηση. Η Μέθοδος Learn® προσφέρει:
                    Μεταφορά της ζωντανής πραγματικότητας στην τάξη
                    Εμπλουτισμό του μαθήματος με πολιτιστικά στοιχεία
                    Ζωντανή επαφή με την γλώσσα και την κουλτούρα

                    CLIL
                    Συνοδέψτε τους ήρωες της ΕΥΡΩΓΝΩΣΗ  στο συναρπαστικό ταξίδι της μάθησης μέσω της προσέγγισης CLIL-Content and Language Integrated Learning που δίνει τη δυνατότητα στους μαθητές να ανακαλύπτουν και να επεξεργάζονται θεματικές ενότητες διαπολιτισμικού περιεχομένου χρησιμοποιώντας την Αγγλική γλώσσα ως εργαλείο.
            ',
         'background' => $background,
     ]);

     new Portal($fake,11, 'frontistirio');

     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');


     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'BEC');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'MSU');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GRE');
     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'PTE');

     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');

//     Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
//
//
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'AutoCAD');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Android');
//     Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Adobe Photoshop');


     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Eurognosi-Thermis-Ευρωγνώση-Θέρμης-694510337351994/');





        /*=============== 17 ΕΥΡΩΓΝΩΣΗ – EuroL@b Ευζώνων ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτικός Όμιλος ΕΥΡΩΓΝΩΣΗ – EuroL@b Ευζώνων', 'email' => 'evzonon@eurognosi.info', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'eurognosiEvzonon'])->id,
            'address' => 'Λεωφόρος Στρατού 1',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310888441,
            'type_id' => 4,
            'website' => 'eurognosi.com',
            'approved' => 1,
            'about' => '
                    Στην ΕΥΡΩΓΝΩΣΗ τα παιδιά μαθαίνουν Αγγλικά από πολύ μικρή ηλικία μέσα σε real-life setting περιβάλλον έχοντας μια ολιστική προσέγγιση στην εκμάθηση της γλώσσας.
                    Οι μικροί μας φίλοι απολαμβάνουν μία μαγική διαδρομή μέσα από τις περιπέτειες του Alf, την πρώτη σειρά παιδικών βιβλίων της ΕΥΡΩΓΝΩΣΗ όπου διασκέδαση και μάθηση συνδυάζονται αρμονικά υπό το πρίσμα της πιο σύγχρονης μεθοδολογίας.
                    Οι μαθητές ανακαλύπτουν σταδιακά τις γλωσσικές τους ικανότητες μέσα από μία επιλογή ασκήσεων και δραστηριοτήτων που δίνουν έμφαση στην κριτική σκέψη.

                    Όλα τα παραπάνω επιτυγχάνονται στην ΕΥΡΩΓΝΩΣΗ με την Μέθοδο Learn®.
                    Η Μέθοδος Learn® με την χρήση ειδικών εκπαιδευτικών μέσων όπως διαδραστικοί πίνακες, αποσπάσματα βίντεο/DVD, παιχνίδια, tablets και άλλες δραστηριότητες παρακινεί το σπουδαστή να συμμετέχει στην μάθηση. Η Μέθοδος Learn® προσφέρει:
                    Μεταφορά της ζωντανής πραγματικότητας στην τάξη
                    Εμπλουτισμό του μαθήματος με πολιτιστικά στοιχεία
                    Ζωντανή επαφή με την γλώσσα και την κουλτούρα

                    CLIL
                    Συνοδέψτε τους ήρωες της ΕΥΡΩΓΝΩΣΗ  στο συναρπαστικό ταξίδι της μάθησης μέσω της προσέγγισης CLIL-Content and Language Integrated Learning που δίνει τη δυνατότητα στους μαθητές να ανακαλύπτουν και να επεξεργάζονται θεματικές ενότητες διαπολιτισμικού περιεχομένου χρησιμοποιώντας την Αγγλική γλώσσα ως εργαλείο.
            ',
            'background' => $background,
        ]);

        new Portal($fake,11, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');

        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'BEC');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'MSU');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GRE');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'PTE');

        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'AutoCAD');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Android');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Πληροφορική', 'Adobe Photoshop');


        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Ευρωγνώση-Ευζώνων-1493177000999637/');





        /*=============== 18 XPerience ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Κέντρο Ξένων Γλωσσών XPerience', 'email' => 'info@xperience.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'xperience'])->id,
            'address' => 'Οσίας Ξένης 7, Χαριλάου',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310328044,
            'type_id' => 4,
            'website' => 'xperience.edu.gr',
            'approved' => 1,
            'about' => '
                Το εκπαιδευτικό κέντρο XPerience δημιουργήθηκε απο τον Αντώνη Παρδαλιό, την Σουζάνα Κονταράκη και την Κατερίνα Παρδαλιού υλοποιώντας την επιθυμία τους για ουσιαστική προσφορά στο χώρο της εκμάθησης ξένων γλωσσών, φέρνοντας νέες ιδέες και αξίες. Η ακαδημαϊκή τους μόρφωση αλλά και η πολυετής επαγγελματική τους εμπειρία στο χώρο της εκπαίδευσης προσφέρουν ένα ολοκληρωμένο σύνολο εκπαιδευτικών υπηρεσιών υψηλού επιπέδου.
                Στο XPerience εφαρμόζονται προηγμένα προγράμματα με πλούσιο οπτικοακουστικό υλικό για όλες τις τάξεις και πρωτοποριακές μεθόδους διδασκαλίας. Όλοι μας εστιάζουμε στις ανάγκες του κάθε μαθητή σεβόμενοι την προσωπικότητα του και υποστηρίζοντας τις δυνατότητες του, εφαρμόζοντας μια εξατομικευμένη προσέγγιση.
                Βοηθούς στην προσπάθεια μας έχουμε τους έμπειρους και αφοσιωμένους εκπαιδευτικούς μας, οι οποίοι έχουν ως μητρική τη γλώσσα την οποία διδάσκουν, με αποτέλεσμα οι σπουδαστές μας να έρχονται σε επαφή με τον πολιτισμό και την κουλτούρα την οποία σπουδάζουν.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');


        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Προγραμματισμός με ρομπότ');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'LEGO Education');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Εκπαιδευτική Ρομποτική', 'Arduino');


        Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση Vellum');


        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/XPerienceEducation');





        /*=============== 19 Σπύρογλου ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ξένες Γλώσσες Σπύρογλου', 'email' => 'info@spyroglou.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'spyroglou'])->id,
            'address' => 'Λεωφ. Βασιλίσσης Όλγας 164',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310422330,
            'type_id' => 4,
            'website' => 'spyroglou.gr',
            'approved' => 1,
            'about' => '
                Το σχολείο μας ιδρύθηκε το 1985 και συνεχίζει την επιτυχημένη πορεία του στην ξενόγλωσση εκπαίδευση έχοντας ως στόχο την απόκτηση γνώσης σε ένα σύγχρονο, μοντέρνο και ευχάριστο περιβάλλον. Το φροντιστήριο αποτελείται από έμπειρους παιδαγωγούς που έχουν μεράκι την διδασκαλία και συμμερίζονται την προσωπική αγωνία του κάθε μαθητή για επιτυχία στις εξετάσεις.
                Η οργάνωση, η υπευθυνότητα, ο σωστός προγραμματισμός καθώς και ο σεβασμός στην διαφορετικότητα του κάθε μαθητή αποτελούν τα κύρια χαρακτηριστικά της πολύχρονης επιτυχίας του σχολείου μας.
                Το σχολείο μας ανταποκρίνεται στις ανάγκες του σήμερα για υψηλού επιπέδου προετοιμασία με λογικά δίδακτρα σπουδών.
                Θα μας βρείτε στον 1ο όροφο της λεωφόρου Βασιλίσσης Όλγας 164, περιοχή Μαρτίου, στην ανατολική πλευρά του δήμου Θεσσαλονίκης. Θα χαρούμε να σας γνωρίσουμε από κοντά και να απαντήσουμε σε όποια απορία τυχόν έχετε σχετικά με τις υπηρεσίες που προσφέρουμε.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 7, 'frontistirio');

        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Ρωσικά');
        Scholio::portalStudy($fake, 'Παιδικά Τμήματα', 'Ξένες Γλώσσες', 'Τούρκικα');



        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γαλλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Γερμανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ισπανικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ιταλικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Ρωσικά');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Ξένες Γλώσσες', 'Τούρκικα');



        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'SAT');
        Scholio::portalStudy($fake, 'Τμήματα Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'BULATS');

        Scholio::portalStudy($fake, 'Τμήματα Εφήβων - Ενηλίκων', 'Πληροφορική', 'Πιστοποίηση ECDL');


        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/spyroglou');



        /*=============== 20 root ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'English School root', 'email' => 'rootmodernenglish@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'rootmodernenglish'])->id,
            'address' => 'Αγγελάκη 25',
            'city' => 'Θεσσσαλονίκη',
            'phone' => 2310262690,
            'type_id' => 4,
            'website' => 'rootenglish.gr',
            'approved' => 1,
            'about' => '
                Why root?
                διδάσκεται αποκλειστικά η αγγλική γλώσσα
                απευθύνεται αποκλειστικά σε φοιτητές-τριες, ενήλικες, άρα υπάρχει ομοιομορφία τμημάτων
                παραδίδονται ατομικά μαθήματα (one-on-one lessons) ή σε groups των 5 ατόμων (maximum) από έμπειρους καθηγητές-τριες
                υποστήριξη για εύρεση πανεπιστημίων στην Ευρώπη και Αμερική
                ευέλικτο ωράριο, ανάλογα με τις ανάγκες των σπουδαστών-στριων
                άπειρα υλικό για practice στο χώρο του Root με συνεχή υποστήριξη και μετά της ολοκλήρωση των μαθημάτων
                μηνιαία τεστ και συχνή επανάληψη της ύλης
                υψηλή ποιότητα με προσαρμοσμένες τιμές (value for money)
                εγγραφές καθ” όλη τη διάρκεια της χρονιάς
                σίγουρη επιτυχία με συνεπή συνεργασία

                Απόκτησε ρίζες
                    root σημαίνει ρίζα. Ρίζα που θεμελιώνει το φυτό στη γη και το αναπτύσει. Η δική σου ανάπτυξη πρέπει να ριζώσει στο καρποφόρο έδαφος της εκπαίδευσης. Βασικό συστατικό του είναι η γνώση της αγγλικής γλώσσας.
                    Το μοντέρνο σχολείο της αγγλικής γλώσσας root σου την παρέχει απόλυτα. Για να ριζώσεις και να αποδώσεις παραγωγικά σε οποιοδήποτε επαγγελματικό τομέα.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');


        Scholio::portalStudy($fake, 'Τμήματα Φοιτητών - Ενηλίκων', 'Ξένες Γλώσσες', 'Αγγλικά');

        Scholio::portalStudy($fake, 'Τμήματα Φοιτητών - Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'IELTS');
        Scholio::portalStudy($fake, 'Τμήματα Φοιτητών - Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEFL');
        Scholio::portalStudy($fake, 'Τμήματα Φοιτητών - Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'TOEIC');
        Scholio::portalStudy($fake, 'Τμήματα Φοιτητών - Ενηλίκων', 'Προετοιμασία Πιστοποίησης', 'GMAT');





    }



}
