<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria8 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;




        /*=============== 1 Εν Γνώσει ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => ' Φροντιστήριο Εν Γνώσει', 'email' => 'info@en-gnosei.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'enGnosei'])->id,
            'address' => 'Μιλτιάδου Μαντά 6, Καπανδρίτι',
            'city' => 'Αθήνα, Αττική',
            'phone' => 2295053629,
            'type_id' => 3,
            'website' => 'en-gnosei.gr',
            'approved' => 1,
            'about' => '
                    Έχοντας μακρόχρονη φροντιστηριακή πείρα σε ό,τι αφορά τόσο τη διδασκαλία όσο και στη συγγραφή βιβλίων φροντιστηριακής προετοιμασίας ιδρύσαμε τα φροντιστήρια «εν γνώσει” στο Καπανδρίτι. Απευθυνόμαστε σε μαθητές γυμνασίου και λυκείου όλων των κατευθύνσεων καθώς ο καθένας από τους διευθυντές έχει αναλάβει το πρόγραμμα σπουδών ανά κατεύθυνση τόσο στο σχεδιασμό του όσο και στην αξιολόγησή του στην πράξη.
                    Αυτή είναι η καινοτομία μας. Ελέγχουμε δηλαδή τα αποτελέσματα από το παραγόμενο έργο στο φροντιστήριό μας, συνεχώς τα βελτιώνουμε με αποτέλεσμα να φαίνεται άμεσα αυτό στις επιδόσεις των μαθητών μας.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/profile.php?id=100005417525085&fref=ts');





        /*=============== 2 Ορίζοντες ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Ορίζοντες', 'email' => 'info@orizontes.fro.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'orizontesFro'])->id,
            'address' => 'Δωδεκανήσου 18, Άνω Καλαμάκι',
            'city' => 'Αθήνα',
            'phone' => 2109969614,
            'type_id' => 3,
            'website' => 'orizontes.fro.gr',
            'approved' => 1,
            'about' => '
                    Η πολύχρονη ενασχόλησή μας με την φροντιστηριακή εκπαίδευση μας δίδαξε ότι η έγκαιρη και συστηματική προετοιμασία των μαθητών είναι αναγκαία προϋπόθεση προκειμένου ν\' ανταποκριθούν στις απαιτήσεις της εποχής μας. Μιας εποχής όπου η γνώση αποτελεί το κυρίαρχο στοιχείο ανάπτυξης και προόδου του ατόμου το οποίο με τη σειρά του καθίσταται ικανό να συμμετέχει ενεργά και αποτελεσματικά στην αναβάθμισή της.

                    Γι\' αυτό εμείς στους "ΟΡΙΖΟΝΤΕΣ" με βαθύ το αίσθημα της ευθύνης απέναντι στους μαθητές μας και τους γονείς τους δεσμευόμαστε και υποσχόμαστε τα εξής:

                    Παροχή γνώσεων από έμπειρους καθηγητές όλων των ειδικοτήτων με υψηλό επίπεδο κατάρτισης.
                    Οργάνωση τμημάτων ανάλογα με το επίπεδο των μαθητών, όσο αυτό είναι δυνατό.
                    Συστηματική και έγκαιρη εκμάθηση της διδακτέας ύλης ώστε ο μαθητής να είναι άρτια προετοιμασμένος για τις εξετάσεις του.
                    Κάλυψη των μαθησιακών ελλείψεων με έκτακτα μαθήματα, ειδικές σημειώσεις.
                    Προγραμματισμένα διαγωνίσματα ανά δεύτερο Σαββατοκύριακο για την πλήρη εμπέδωση της ύλης.
                    Φιλικές διαπροσωπικές σχέσεις με τους μαθητές μας στηριγμένες στον αλληλοσεβασμό και την αλληλοεκτίμηση.
                    Ενημέρωση των γονιών σε τακτικές συναντήσεις, για την πορεία των παιδιών τους.
                    Για να συντελέσουμε όμως ουσιαστικά στην υλοποίηση των στόχων των μαθητών μας χρειάζεται και εκείνοι να συνειδητοποιήσουν τις ευθύνες τους απέναντι στον εαυτό τους, τους γονείς και την κοινωνία γενικότερα.

                    Ζητάμε λοιπόν απ\' αυτούς:

                    Ανελλιπή παρακολούθηση των μαθημάτων και συμμετοχή σε όλα τα διαγωνίσματα.
                    Συστηματική μελέτη χωρίς άγχος και περιττές ανασφάλειες.
                    Επιμονή στην κατανόηση των δύσκολων σημείων της διδακτέας ύλης και στην επίλυση των όποιων αποριών τους.
                    Αρμονική συνεργασία με συμμαθητές τους αλλά κυρίως με τους διδάσκοντες καθηγητές οι οποίοι θα βρίσκονται πάντα δίπλα τους αρωγοί στην επίπονη προσπάθειά τους και με κύρια "όπλα" την πολύχρονη διδακτική εμπειρία τους αλλά και την αγάπη για την νεανική ψυχή και το σεβασμό στις ιδιαιτερότητες της προσωπικότητας του καθενός.
                    Τέλος απευθυνόμαστε σ\' εσάς, τους γονείς, γνωρίζοντας πως είστε η κινητήρια δύναμη αφού εσείς θα εμπνεύσετε τα παιδιά σας, σεις θα τονώσετε το φρόνημά τους, σεις θα δώσετε πνοή στο δύσκολο αγώνα τους εξασφαλίζοντας τις πλέον κατάλληλες οικογενειακές συνθήκες μέσα στις οποίες αυτά θα λειτουργήσουν με τον καλύτερο τρόπο. Ζητάμε λοιπόν κι από σας, αν μας εμπιστευτείτε την πρόοδο των παιδιών σας, να συνεργαστείτε στενά μαζί μας σε θέματα σχετικά με την επίδοση, τη συμπεριφορά και τις τυχόν ιδιαιτερότητές τους ώστε να δημιουργήσουμε μια ειλικρινή σχέση που θα συμβάλει θετικά στην επίτευξη των κοινών μας επιδιώξεων.

                    Κλείνοντας την επιστολή μας τονίζουμε ότι οι "ΟΡΙΖΟΝΤΕΣ" μπορούν να ταυτιστούν με το ΟΝΕΙΡΟ των μαθητών για μάθηση και επιτυχία και μέσα σ\' ένα ζεστό και αληθινά φιλικό περιβάλλον να βοηθήσουν να γίνει το ΟΝΕΙΡΟ πραγματικότητα.

            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/OrizontesFro');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/user/orizontesfro');




        /*=============== 3 εἰδέναι ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο εἰδέναι', 'email' => 'info@eidenai.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'eidenai'])->id,
            'address' => 'Βασιλίσσης Σοφίας 52, Μαρούσι',
            'city' => 'Αθήνα',
            'phone' => 2130699555,
            'type_id' => 3,
            'website' => 'eidenai.gr',
            'approved' => 1,
            'about' => '
                  Το φροντιστήριο «ειδέναι» στεγάστηκε στο Μαρούσι και στελεχώθηκε με επιφανείς καθηγητές της ιδιωτικής εκπαίδευσης με σκοπό να αποτελέσει μια εξαιρετική διδακτική πρόταση προς τους μαθητές των Βορείων Προαστίων.
                  Σήμερα είμαστε υπερήφανοι επειδή το φροντιστήριό μας έχει ήδη καταξιωθεί ως μία από τις ποιοτικότερες επιλογές των κορυφαίων υποψηφίων φοιτητών από όλη την Αττική.
                  Εμείς αθροίσαμε την εμπειρία, την τεχνογνωσία, το μεράκι και το ανθρώπινο ενδιαφέρον για κάθε μαθητή που μας εμπιστεύτηκε…
                  Διαπιστώνουμε με χαρά ότι την πρότασή μας θεώρησε αξιόπιστη η ελίτ των υποψηφίων από τα καλύτερα σχολεία της Αττικής, όπως εύκολα μπορεί να διαπιστώσει κανείς, αν ανατρέξει στις λίστες των επιτυχόντων μας.
                  Συνεχίζουμε, λοιπόν, με τα ίδια αυτά συστατικά επιτυχίας να περιμένουμε δίπλα μας τους φοιτητές της επόμενης ακαδημαϊκής χρονιάς για να τους παράσχουμε τις καλύτερες υπηρεσίες μας, εδραιωμένες σε μια βαθιά προσωπική σχέση ώστε να ευοδωθούν οι κοινοί μας στόχοι.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Eidenai-277574718924006');





        /*=============== 4 Βάση ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Βάση', 'email' => 'info@basi.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'basi'])->id,
            'address' => 'Δημοσθένους 90, Καλλιθέα',
            'city' => 'Αθήνα',
            'phone' => 2109561944,
            'type_id' => 3,
            'website' => 'basi.gr',
            'approved' => 1,
            'about' => '
            Η Γνώση είναι Δύναμη !
            Φροντιστήριο ΒΑΣΗ Σεπόλια
            Δυρραχίου 52 & Αθανάτων · Αθήνα

            Φροντιστήρια ΒΑΣΗ Καλλιθέα
            Δημοσθένους 90
            ',
            'background' => $background,
        ]);

        new Portal($fake, 9, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistiria.basi');




        /*=============== 5 Πρόταση ================*/

//        $fake = factory(App\Models\School::class)->create([
//            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Πρόταση, Γαλάτσι', 'email' => 'protasif@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'protasiGalatsi'])->id,
//            'address' => 'Λ. Βεΐκου 12, Γαλάτσι',
//            'city' => 'Αθήνα',
//            'phone' => 2102914627,
//            'type_id' => 3,
//            'website' => 'protasi-f.gr',
//            'approved' => 1,
//            'about' => '
//                    Συνεργάτες των φροντιστηρίων μας είναι εκπαιδευτικοί ολων των ειδικοτήτων.
//
//                    Μπορούμε να διδάξουμε ΟΛΑ τα μαθήματα που διδάσκονται στο σχολείο, «κύρια» και «δευτερεύοντα», όπως και τα επιλογής. Αυτό όμως θα ήταν εξαιρετικά κουραστικό για τα παιδιά και θα στερούσε πολύτιμο χρόνο από το διάβασμα τους. Για να είναι αποδοτική η μελέτη, επιλέξαμε σε κάθε τάξη και σε κάθε κατεύθυνση ένα μικρο, ευέλικτο πρόγραμμα μαθημάτων το οποίο και προτείνουμε.Αυτό το πρόγραμμα - πρόταση εξειδικεύεται για κάθε μαθητή ξεχωριστά, ανάλογα με τις ιδιαίτερες ανάγκες του.
//
//                    Το προγραμμα μαθηματων που παρουσιαζεται σε πινακες ειναι το απαραιτητο και γι\' αυτο υποχρεωτικο!
//                    Κάθε μαθητής/τρια ομως μπορεί να παρακολουθήσει ΟΣΑ και ΟΠΟΙΑ επιπλεον μαθήματα επιθυμεί!
//
//                    Στους πίνακες που ακολουθούν παρουσιάζονται τα μαθήματα που προτείνουμε και δίπλα τους ο αριθμός των ωρών διδασκαλίας  του κάθε μαθήματος  εβδομαδιαία.
//
//                    EKTAKTEΣ ΩΡΕΣ μαθημάτων γίνονται όποτε χρειαστεί, λαμβάνοντας υπόψιν το πρόγραμμα των παιδιών και ενημερώνοντας άμεσα τους γονείς τους. ΧΩΡΙΣ ΚΑΜΙΑ ΟΙΚΟΝΟΜΙΚΗ ΕΠΙΒΑΡΥΝΣΗ ΓΙΑ ΤΟΥΣ ΓΟΝΕΙΣ.
//                    ΕΚΑΙΡΗ ΚΑΛΥΨΗ ΤΗΣ ΥΛΗΣ σε όλα τα μαθήματα ώστε να δοθεί ο απαραίτητος χρόνος για επαναλήψεις, κάλυψη κενών και εμπέδωση όλης της ύλης που έχει διδαχθεί.
//                    ΣΥΝΕΧΕΙΣ ΕΠΑΝΑΛΗΨΕΙΣ κατά τη διάρκεια της χρονιάς ώστε η γνώση που αποκτιέται να γίνει στερεή και να μπορεί να αποδώσει στα διαγωνίσματα.
//                    ΤΑΚΤΙΚΗ ΑΞΙΟΛΟΓΗΣΗ των γνώσεων που αποκτήθηκαν, με tests και άλλες δοκιμασίες, περνάν των προγραμματισμένων διαγωνισμάτων.
//                    Ο ΡΟΛΟΣ ΤΩΝ ΔΙΑΓΩΝΙΣΜΑΤΩΝ είναι κομβικός για τη σχολική πορεία αρχικά και την επιτυχία στις πανελλαδικές εξετάσεις μετέπειτα. Γι’ αυτό  Η  ΣΥΜΜΕΤΟΧΗ  ΣΤΑ ΔΙΑΓΩΝΙΣΜΑΤΑ ΕΙΝΑΙ ΥΠΟΧΡΕΩΤΙΚΗ ενώ για τις απουσίες και τις επιδόσεις ΕΝΗΜΕΡΩΝΟΝΤΑΙ ΕΠΙΣΗΜΑ ΟΙ ΓΟΝΕΙΣ.
//            ',
//            'background' => $background,
//        ]);
//
//        new Portal($fake, 5, 'frontistirio');
//
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
//        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
//        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');
//
//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/protasi.frontistiria');






        /*=============== 5  Πέζου ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εφηβικά Φροντιστήρια Πέζου', 'email' => 'angelapezou@yahoo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'pezou'])->id,
            'address' => 'Θεσπρωτικού 55, Ίλιον',
            'city' => 'Αθήνα',
            'phone' => 2102387904,
            'type_id' => 3,
            'website' => 'frontpezou.gr',
            'approved' => 1,
            'about' => '
                    Το μυστικό της επιτυχίας μας έγκειται στο γεγονός ότι οι κομβικές θέσεις του φροντιστηρίου μας καλύπτονται από την οικογένειά μας! Έτσι, με αγάπη και πολλή φροντίδα για κάθε παιδί ξεχωριστά παλεύουμε όλοι , για να βγάλουμε τον καλύτερό του εαυτό!
            ',
            'background' => $background,
        ]);

        new Portal($fake, 16, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/PEZOUFRONTISTIRIAILION');




        /*=============== 6  Ροπή ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Πρότυπα Φροντιστήρια Ροπή', 'email' => 'patsakis2@yahoo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ropi'])->id,
            'address' => 'Κώστα Βάρναλη 2-4, Χαλάνδρι',
            'city' => 'Αθήνα',
            'phone' => 2106854228,
            'type_id' => 3,
            'website' => 'ropi-patsakis.gr',
            'approved' => 1,
            'about' => '
                Φίλοι μαθητές καθώς η νέα σχολική χρονιά ξεκινά, το φροντιστήριο ¨ΡΟΠΗ¨ σας εύχεται καλή αρχή και κάθε επιτυχία στις προσπάθειες σας.
                Με χαρά σας ανακοινώνουμε πως το Φροντιστήριο ¨ΡΟΠΗ¨ είχε και φέτος 100% επιτυχία στα Α.Ε.Ι και μάλιστα πολλοί είναι στους πρώτους στη σειρά κατάταξης επιτυχόντων. Ο αριθμός των επιτυχόντων μας στις καλύτερες σχολές, έχει ξεπεράσει και τις δικές μας προσδοκίες.
                Μια λέξη μπορεί να αποδώσει την έκταση της επιτυχίας "ΘΡΙΑΜΒΟΣ". Μπράβο μεγάλο αξίζει στους μαθητές μας. Δεν πρόκειται βέβαια για τυχαίο γεγονός. Είναι αποτέλεσμα της ευσυνείδητης δουλειάς μας.
                Τα Φροντιστήρια \'ΡΟΠΗ\' από το 2012 στεγάζονται σε νέα υπερσύγχρονα κτήρια. Πάλι μόνο στο κέντρο του Χαλανδρίου
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');


        /*=============== 7  Απόλυτο ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Απόλυτο', 'email' => 'apolyto@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'apolyto'])->id,
            'address' => 'Ψαρών 3, Βάρκιζα',
            'city' => 'Αθήνα',
            'phone' => 2109654700,
            'type_id' => 3,
            'website' => 'apolyto.fro.gr',
            'approved' => 1,
            'about' => '
                Φροντιστήριο μέσης εκπαίδευσης, θετικής τεχνολογικής κατεύθυνσης
                Η επιτυχία μεθοδεύεται.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/profile.php?id=100011695966611');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 8  ================*/

//        $fake = factory(App\Models\School::class)->create([
//            'user_id' => factory(App\User::class)->create(['name' => '', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
//            'address' => '',
//            'city' => 'Αθήνα',
//            'phone' => 210,
//            'type_id' => 3,
//            'website' => '',
//            'approved' => 1,
//            'about' => '
//
//            ',
//            'background' => $background,
//        ]);
//
//        new Portal($fake, 5, 'frontistirio');
//
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
//        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
//        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
//        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
//        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');

    }



}
