<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria7 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;




     /*=============== 1 Κεφαλάς ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Κεφαλάς', 'email' => 'fkefala@hotmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'kefalas'])->id,
         'address' => 'Λεωφόρος Κύπρου 87, Αργυρούπολη',
         'city' => 'Αθήνα',
         'phone' => 2109901897,
         'type_id' => 3,
         'website' => 'kefalas.gr',
         'approved' => 1,
         'about' => '
Λειτουργούμε εδώ και 47 χρόνια με πολύ υψηλά ποσοστά επιτυχίας στις σχολές πρώτης προτίμησης των μαθητών.
Στα χρόνια που πέρασαν επεκταθήκαμε, δημιουργήσαμε 5 εκπαιδευτικούς χώρους οι οποίοι στεγάζονται σε 6 σύγχρονα κτίρια, ειδικά διαμορφωμένα για φροντιστήριο.
Όσοι μας γνώρισαν, εκτίμησαν την προσφορά μας και μας καταξίωσαν σε έναν από τους μεγαλύτερους και παλαιότερους εκπαιδευτικούς οργανισμούς.
Πιστοποίηση της ποιότητας των παρεχομένων υπηρεσιών είναι για εμάς τα αποτελέσματά μας.
Είμαστε πάνω από όλα δάσκαλοι, με μεγάλη εμπειρία, εμβάθυνση στο γνωστικό αντικείμενο που ο καθένας μας διδάσκει και παιδαγωγική ευαισθησία.
Συγκριτικό μας πλεονέκτημα είναι το οτι μετά από 47 χρόνια λειτουργίας, έχουμε τη μεγάλη ικανοποίηση να υποδεχόμαστε πλέον τα παιδιά των παλαιών μας μαθητών, αναγνωρίζοντάς μας έτσι σαν τη μόνη εγγύηση για το μέλλον τους.
Ο στόχος μας, ο οποίος κάθε χρόνο επιτυγχάνεται δεν είναι μόνο τα πολλαπλά άριστα τα οποία καταφέρνουν να γράψουν οι μαθητές μας, αλλά και η άνοδος των μαθητών με περισσότερα κενά από προηγούμενα έτη, που προσπαθώντας μαζί μας αποκτούν προοπτική πραγματοποιώντας το όνειρό τους.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 11, 'frontistirio');

     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
     Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/kefalas.gr');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/')





     /*=============== 2 Σάλαρη ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Σπουδαστήριο Σάλαρη', 'email' => 'contact@salari.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'salari'])->id,
         'address' => 'Μάρκου Μπότσαρη 10, Γαλάτσι',
         'city' => 'Αθήνα',
         'phone' => 2155452183,
         'type_id' => 3,
         'website' => 'salari.gr',
         'approved' => 1,
         'about' => '
             Στο Σπουδαστήριο Σάλαρη εστιάζουμε στις υψηλές απαιτήσεις των Θετικών Μαθημάτων στα οποία διαγωνίζονται οι υποψήφιοι των Θετικών Επιστημών και Επιστημών Υγείας, καλύπτοντας πλήρως τις ανάγκες των πεδίων αυτών. Επιπλέον, λειτουργούν τμήματα Μαθηματικών για τους υποψήφιους του πεδίου οικονομίας και πληροφορικής.

             Τα  αυστηρά τετραμελή και ομοιογενή γκρούπ μαθητών μας σε συνδυασμό με το άριστα κατερτισμένο και έμπειρο επιτελείο καθηγητών εξασφαλίζουν την προετοιμασία των μαθητών μας σε  υψηλό επίπεδο.

             Παράλληλα στο Σπουδαστήριο Σάλαρη πραγματοποιούνται ιδιαίτερα μαθήματα σε όλα τα θετικά μαθήματα σε απόφοιτους και σε  μαθητές Γυμνασίου–Λυκείου.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/salarigr');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');





     /*=============== 3 Φ Φροντιστήριο ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φ Φροντιστήριο Μέσης και Ανώτατης Εκπαίδευσης', 'email' => 'phimath.group@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'phifrontistirio'])->id,
         'address' => 'Βασιλίσσης Όλγας 24, Μαρούσι',
         'city' => 'Αθήνα',
         'phone' => 2108023313,
         'type_id' => 3,
         'website' => 'phimath.gr',
         'approved' => 1,
         'about' => '
            Το Φροντιστήριο Μέσης Εκπαίδευσης φ δημιουργήθηκε από Μαθηματικούς με πολυετή εμπειρία στο χώρο της Εκπαίδευσης και συνδυάζει τα προτερήματα τόσο του ιδιαίτερου όσο και του συλλογικού μαθήματος οργανώνοντας ολιγομελείς ομάδες του ίδιου γνωστικού επιπέδου σε όλες τις
            τάξεις του Λυκείου.

            Στις μέρες μας, η ανάγκη για την υποστήριξη του μαθητή στα πλαίσια ενός ολιγομελούς τμήματος είναι επιτακτική και αναγκαία, λόγω των ιδιαιτεροτήτων που παρουσιάζουν τα Θέματα των Πανελλαδικών Εξετάσεων τα τελευταία χρόνια, καθώς αυτά απευθύνονται σε κατάλληλα προετοιμασμένους και θεωρητικά καταρτισμένους υποψηφίους.

            Η έμπειρη ομάδα του φ, με γνώση και υπευθυνότητα, προετοιμάζει και υποστηρίζει τους μελλοντικούς νέους μας επιστήμονες, ώστε να αντιμετωπίσουν τις ‘δυσκολίες’ των Πανελληνίων Εξετάσεων και πάνω απ’όλα να επιτύχουν στις Σχολές που επιθυμούν.

            Στο φροντιστήριό μας έχουμε δημιουργήσει ένα ευέλικτο Πρόγραμμα Σπουδών για όλες τις τάξεις του Λυκείου, επικεντρωμένο τόσο στη σχολική
            διαδικασία όσο και στην πορεία που πρέπει να
            διανυθεί ως τις Εξετάσεις, σύμφωνα με το νεώτερο σύστημα πρόσβασης στα Α.Ε.Ι.

            Παράλληλα, λειτουργούν και τμήματα Γυμνασίου στοχεύοντας στη καλύτερη προετοιμασία των μικρών μας μαθητών, για να αντιμετωπίσουν τις δυσκολίες, ιδιαίτερα στα πιο απαιτητικά μαθήματα (Μαθηματικά, Αρχαία και Νέα Ελληνικά), αλλά και τις προκλήσεις του Λυκείου.

            Στις μέρες μας, δε θα μπορούσαμε να μην αναφερθούμε στο οικονομικό σκέλος των υπηρεσιών μας. Παρέχουμε υπηρεσίες άριστης ποιότητας και υψηλού επιπέδου σε τιμές προσαρμοσμένες στη σημερινή δύσκολη οικονομική πραγματικότητα.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 8, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

     Scholio::portalStudy($fake, 'Πανεπιστημιακό Φροντιστήριο', 'Προπτυχιακά', 'Φοιτητικά Μαθήματα');


       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/phifrontistirio');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/')




     /*=============== 4 Αξία ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Όμιλος Φροντιστηρίων Αξία', 'email' => 'xalandrikatw@axia.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'axiaxalandrikatw'])->id,
         'address' => 'Σοφ. Βενιζέλου 79, Κάτω Χαλάνδρι',
         'city' => 'Αθήνα',
         'phone' => 2106857667,
         'type_id' => 3,
         'website' => 'axia.edu.gr',
         'approved' => 1,
         'about' => '

         Βασικές Αρχές του Προγράμματός μας
Σχολή Γονέων
E-learning
Επαγγελματικός Προσανατολισμός και Συμβουλευτική από συνεργαζόμενους συμβούλους σταδιοδρομίας.
Απόλυτη ειδίκευση κατά τομέα μαθήματος.
Πρότυπη Διδασκαλία – Τεχνική – Μεθοδολογία.
Έμπειροι καθηγητές, μόνιμοι συνεργάτες με πολυετή φροντιστηριακή πείρα.
Πρότυπες διαδικασίες συγκρότησης ομοιογενών τμημάτων.
Διδασκαλία της ύλης από μηδενική βάση.
Εδώ ο μαθητής προετοιμάζεται για τις εξετάσεις καλύπτοντας όλα τα κενά και τις απορίες των προηγούμενων ετών.
Βιβλία των συγγραφικών ομάδων των καθηγητών μας.
Προσωπικό ενδιαφέρον, συχνή ηλεκτρονική ενημέρωση
& αξιολόγηση κάθε μαθητή ξεχωριστά, με τρεις επίσημες ενημερώσεις γονέων και επιστολές στους γονείς με σχόλια των καθηγητών για την πρόοδο των μαθητών, ανά δύο μήνες.
 Ευέλικτα προγράμματα σπουδών προσαρμοσμένα στις λοιπές υποχρεώσεις κάθε μαθητή.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 11, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

     Scholio::portalStudy($fake, 'Λύκειο', 'Προγράμμα IB', 'International Baccalaureate Diploma (I.B.)');

     Scholio::portalStudy($fake, 'Πανεπιστημιακό Φροντιστήριο', 'Προπτυχιακά', 'Φοιτητικά Μαθήματα');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/axia.edu.gr');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/')





     /*=============== 5 Πρίσμα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Πρίσμα', 'email' => 'info@prismafme.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'prismafme'])->id,
         'address' => 'Πειραιώς 209Β, Ταύρος',
         'city' => 'Αθήνα',
         'phone' => 2103479163,
         'type_id' => 3,
         'website' => 'prismafme.gr',
         'approved' => 1,
         'about' => '
            Βασικός μας στόχος είναι τα παιδιά μας να έχουν καλή διάθεση και ταυτόχρονα να διατηρείται η προσοχή τους. Γι αυτό το λόγο δημιουργήσαμε ένα σύγχρονο και λειτουργικό περιβάλλον για τους σπουδαστές και τους καθηγητές μας στον οποίο κυριαρχεί η θετική ενέργεια ώστε η δουλειά μας να έχει τη μεγαλύτερη δυνατή αποτελεσματικότητα.

            Η Φιλοσοφία μας
            Οπυρήνας της φιλοσοφίας μας δεν θα μπορούσε να είναι άλλος από τον μαθητή. Έτσι στηρίζουμε το προσωπικό του όραμα, μοιραζόμαστε την αγωνία του και ενισχύουμε την πίστη στον εαυτό του, μετουσιώνοντας τους στόχους του σε πραγματικό όραμα επιτυχίας.
            Επιδίωξή μας είναι να εκμηδενίσουμε τη στείρα εκμάθησης της διδακτέας ύλης, κάνοντας τους μαθητές μας πρωταγωνιστές. Δε θέλουμε τη μετατροπή των παιδιών μας σε μηχανές αδιάκοπης μελέτης, θέλουμε οντότητες ολοκληρωμένες με κριτική σκέψη.
            Πιστεύουμε ότι η εκπαίδευση είναι μια αμφίδρομη διαδικασία. Είναι μέσο ανταλλαγής εμπειριών, πεποιθήσεων, βιωμάτων και τρόπου σκέψης.
            Στο Πρίσμα καταφέρνουμε να έχουμε τα πλεονεκτήματα του ιδιαίτερου μαθήματος και της οργάνωσης του φροντιστηρίου. Εκμεταλλευόμαστε τα δυνατά σημεία του μαθητή και θεραπεύουμε τις αδυναμίες του. Καλλιεργούμε τις ικανότητές του, θέτουμε στόχους σε καθημερινή βάση και τους πετυχαίνουμε!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 11, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/prismafrontistiriatavros');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');




     /*=============== 6 Περί Παιδείας ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Περί Παιδείας', 'email' => 'peripaideias@yahoo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'peripaideias'])->id,
         'address' => 'Παπαρρηγοπούλου 2α, Νεάπολη',
         'city' => 'Αθήνα',
         'phone' => 2110111617,
         'type_id' => 3,
         'website' => 'peripaideias.gr',
         'approved' => 1,
         'about' => '
          Περισσότερο από οτιδήποτε άλλο, η προετοιμασία είναι το κλειδί της επιτυχίας.
          Ο δρόμος για την επιτυχία είναι μακρύς. Περπάτησε τον με τους καλύτερους !
            ',
         'background' => $background,
     ]);

     new Portal($fake, 15, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/peripaideias.gr');





     /*=============== 7 Έναυσμα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Έναυσμα', 'email' => 'info@enavsma.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'enavsma'])->id,
         'address' => 'Λεωφόρος Ηρακλείου 445, Νέο Ηράκλειο',
         'city' => 'Αθήνα',
         'phone' => 2130415334,
         'type_id' => 3,
         'website' => 'enavsma.edu.gr',
         'approved' => 1,
         'about' => '
      Το φροντιστήριο «Έναυσμα» και οι συνεργάτες του στοχεύουν σε μια μεθοδική, αξιόπιστη και αποτελεσματική συνεργασία με τους μαθητές και τους γονείς τους.
      Είμαστε άνθρωποι με όραμα, που τολμάμε να αναμετρηθούμε με τις δυσχερείς κοινωνικοπολιτικές και οικονομικές συνθήκες της εποχής φέρνοντας ένα νέο «αέρα» στα φροντιστηριακά δεδομένα. Το στοιχείο που μας δίνει το προβάδισμα είναι - πέρα από τους προσεγμένους χώρους που έχουμε διαμορφώσει για την προετοιμασία των παιδιών – η διάθεση να προσφέρουμε ουσιαστική γνώση συνδυάζοντας τον παραδοσιακό τρόπο διδασκαλίας με τις καινοτομίες των νέων τεχνολογιών.
      Το φροντιστήριο «Έναυσμα» και η διεύθυνση σπουδών βρίσκονται δίπλα σε κάθε μαθητή, προκειμένου να τον βοηθήσουν με ενθουσιασμό και έντονο το αίσθημα της ευθύνης να πραγματοποιήσει τα όνειρά του.
      Πρωταρχικός στόχος μας είναι ο μαθητής να κατανοήσει τον τρόπο και την μέθοδο του «πώς να μαθαίνω να διαβάζω σωστά» και όχι «πώς να διαβάζω παθητικά». Δεν ζητάμε από το παιδί να έχει τις γνώσεις. Εμείς έχουμε τον τρόπο να τις προσφέρουμε και να του υποδείξουμε σωστές μεθόδους αφομοίωσής της.
      Επιθυμία μας είναι να καθιερωθούμε στο χώρο της φροντιστηριακής εκπαίδευσης και τα αποτελέσματα των παιδιών μας να επιβεβαιώνουν κάθε φορά την αρχή μας ότι με ζήλο, αγάπη και συνεργασία η ανταμοιβή για τους κόπους μας είναι δεδομένη!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 17, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Έναυσμα-Φροντιστήριο-1996754317216741/');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/enavsma');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/Enavsma');






     /*=============== 8 Ανοδικό ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Ανοδικό', 'email' => 'anodiko@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'anodiko'])->id,
         'address' => 'Μεσολογγίου 15, Καισαριανή',
         'city' => 'Αθήνα',
         'phone' => 2107215375,
         'type_id' => 3,
         'website' => 'anodiko.fro.gr',
         'approved' => 1,
         'about' => '
Τα Φροντιστήρια  Ανοδικό ιδρύθηκαν το 1988 στην Καισαριανή και επεκτάθηκαν στο Βύρωνα. Από τον πρώτο χρόνο λειτουργίας, αναγνωρίσθηκαν ως ένα από τα μεγαλύτερα και αρτιότερα φροντιστήρια της περιοχής.

Στόχος των ιδρυτών είναι η παροχή υψηλής ποιότητας εκπαίδευση, γι’ αυτό και δεν είναι τυχαίο που οι μαθητές μας εισάγονται στις σχολές προτίμησής τους επιτυγχάνοντας τις υψηλότερες βαθμολογίες.

Οι επιτυχίες των μαθητών μας είναι η δική μας ηθική επιβράβευση. η προσπάθειά μας συνεχίζεται με τους καλύτερους οιωνούς,

με μεθοδικότητα, συνέπεια, αμέριστη προσοχή στον μαθητή!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Φροντιστήρια-Ανοδικό-291573694350542');



     /*=============== 9 Μεθοδικό Κορωπί ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Μεθοδικό Κορωπί', 'email' => 'info@methodikofro.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'methodikofro'])->id,
         'address' => 'Νικολάου Κώνστα 5, Κορωπί',
         'city' => 'Αθήνα',
         'phone' => 2106626690,
         'type_id' => 3,
         'website' => 'methodikofro.gr',
         'approved' => 1,
         'about' => '
            Η σωστή προετοιμασία είναι το κλειδί της επιτυχίας!
            Ο δρόμος προς την επιτυχία έχει διαβαθμίσεις και αποτελεί σήμερα ένα από τα κρισιμότερα θέματα στη θεωρία της διδασκαλίας. Το ΜΕΘΟΔΙΚΟ με επιτυχία εδώ και χρόνια (από το 1998) επιτελεί το εκπαιδευτικό του έργο κάνοντας προσπάθεια να αμβλυνθούν αυτές οι δυσκολίες που δημιουργούνται από την προσαρμογή του μαθητή στο εκπαιδευτικό πλαίσιο.
            Με σαφή και άμεση διδασκαλία τόσο σε ατομικό όσο και σε ομαδικό επίπεδο προσπαθούμε να διασφαλίσουμε σε κάθε μαθητή μας ένα αποδεκτό επίπεδο γνώσεων παρέχοντας, όμως, εναλλακτικές οδούς προς τη γνώση. Απομακρυσμένοι από το στείρο εγκυκλοπαιδισμό, δεν εγκλωβιζόμαστε σε προκαθορισμένες τεχνικές και μεθόδους. Κάθε εκπαιδευτικός αναλαμβάνει πρωτοβουλία, ώστε να ανταποκριθεί στις διαφορετικές ανάγκες των μαθητών του. Προσαρμοσμένοι στο σύγχρονο τρόπο εξέτασης καλλιεργούμε πολλαπλές εναλλακτικές προσέγγισης και στρατηγικές αντιμετώπισης που επιτρέπουν σε κάθε μανθάνοντα να επεξεργάζεται τη γνώση σφαιρικά, ενώ τον τρόπο αυτό τον διδάσκεται σε ένα ελκυστικό περιβάλλον μάθησης.
            Στόχος της διδακτικής μας προσέγγισης είναι η προαγωγή και η οικοδόμηση της γνώσης, καθώς και η ανάπτυξη αυτών των δεξιοτήτων, απαραίτητες για την εισαγωγή σας στα Ανώτατα Τεχνολογικά και Εκπαιδευτικά Ιδρύματα.
            Το έμπειρο εκπαιδευτικό προσωπικό του ΜΕΘΟΔΙΚΟΥ, που διακρίνεται για την άριστη κατάρτισή του, την επαγγελματική ευσυνειδησία του, την μεθοδική και υπεύθυνη δουλειά του, προσφέρει τις κατάλληλες προϋποθέσεις για την αποτελεσματική καθοδήγηση των μαθητών μας. Η επιτυχία στη συνεργασία διδασκόντων και μαθητών οφείλεται στη δική τους ορθή διαχείριση του χρόνου και εκτίμηση των προσδοκώμενων αποτελεσμάτων. Παράλληλα, η αμοιβαία και αγαστή συνεργασία εκπαιδευτικών - μαθητών και γονέων συμβάλλει στην ισόρροπη και αρμονική ανάπτυξη των ψυχικών και πνευματικών δυνατοτήτων των μαθητών στον ανώτατο δυνατό βαθμό.
            Τέλος, η διαχείριση από την πλευρά μας των συναισθημάτων των μαθητών μας, με τη συνεχή ενθάρρυνση και υποστήριξη σε μια τόσο κρίσιμη περίοδο, δημιουργεί μια επιπρόσθετη προϋπόθεση επιτυχίας. Μειώνουμε τα επίπεδα του σχολικού άγχους και φόβου της αποτυχίας με τη διαρκή παρακολούθηση της προόδου των μαθητών μας και τη διαπροσωπική επικοινωνία, ανατροφοδοτούμε τα νεαρά μας μέλη ως προς το αντικείμενο και τις ευθύνες που τους έχουν ανατεθεί με αμοιβαία απαίτηση και προσπάθεια για την επίτευξη του κοινού στόχου!
            Το μέλλον σου ανήκει. Προετοίμασέ το σωστά και μεθοδικά!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 13, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/methodikofro');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/methodikofro');




     /*=============== 10 Άνοδος ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Άνοδος Γκύζη', 'email' => 'info@anodos.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'anodosEdu'])->id,
         'address' => 'N. Γκύζη 14, Γκύζη',
         'city' => 'Αθήνα',
         'phone' => 2106452777,
         'type_id' => 3,
         'website' => 'anodos.edu.gr',
         'approved' => 1,
         'about' => '
Η εισαγωγή στην Τριτοβάθμια Εκπαίδευση είναι επίπονη διαδικασία και προϋποθέτει ολοκληρωμένη και υπεύθυνη προετοιμασία από την πλευρά των μαθητών. Πρωταγωνιστικό ρόλο στην προσπάθεια αυτή έχουν τα φροντιστήρια ΑΝΟΔΟΣ, που σκοπός τους είναι όχι μόνο η διδακτική κάλυψη της εξεταστέας ύλης αλλά και ο απόλυτος συντονισμός και η οργάνωση ολόκληρης της προσπάθειας του υποψηφίου.
Με αίσθημα υψηλής ευθύνης ανταποκρινόμαστε στο δύσκολο εκπαιδευτικό έργο προσφέροντας:

Άριστα εξειδικευμένο διδακτικό προσωπικό
Η πολύχρονη εμπειρία των καθηγητών μας, η μεταδοτικότητα, η παιδαγωγική επάρκεια, η μεθοδικότητα και ο προγραμματισμός είναι τα στοιχεία εκείνα που εμπνέουν και κινητοποιούν κάθε μαθητή ξεχωριστά. Το διδακτικό προσωπικό μας είναι καθηγητές – συγγραφείς καταξιωμένοι για την ποιότητα της διδακτικής και συγγραφικής τους δουλειάς.

Μεθοδικότητα και αυστηρό διδακτικό προγραμματισμό
Τα προγράμματα σπουδών μας είναι ευέλικτα και οργανωμένα ώστε να εξασφαλίζεται η μέγιστη αφομοίωση της διδακτέας ύλης. Διδάσκουμε βάσει συγκεκριμένου χρονοδιαγράμματος, ώστε οι μαθητές να κατανοήσουν και να εμπεδώσουν την ύλη της τάξης τους, να μην δημιουργούν κενά αλλά και να έχουν μεγάλο χρονικό διάστημα για επαναλήψεις.

Ολιγομελή και ομοιογενή τμήματα
Με στόχο την αποτελεσματικότητα, λειτουργούμε με ολιγομελή και ομοιογενή τμήματα, στα οποία καθηγητής και μαθητές βαδίζουν με τον σωστό ρυθμό για την κατάκτηση της γνώσης, ενθαρρύνοντας ταυτόχρονα τον υγιή συναγωνισμό και τη φιλοδοξία των μαθητών.

Δωρεάν βιβλία
Η διδασκαλία μας υποστηρίζεται από τα καταξιωμένα στον φροντιστηριακό χώρο βιβλία μας. Τα πληρέστατα βιβλία των εκδόσεων «ΑΝΟΔΟΣ», επιμέλεια των ίδιων των καθηγητών μας, οργανώνουν με τον καλύτερο τρόπο ολόκληρο το φάσμα της ύλης σε αυτόνομες διδακτικές ενότητες και περιέχουν θεωρία, αναλυτική μεθοδολογία και πλήθος λυμένων και μη ασκήσεων.

Τακτικά τεστ και διαγωνίσματα
Γίνεται διαρκής έλεγχος των γνώσεων του μαθητή με συχνά ολιγόλεπτα τεστ, αλλά και με προγραμματισμένα διαγωνίσματα προσομοίωσης πανελληνίων. Έτσι ο μαθητής εξοικειώνεται με την εξεταστική διαδικασία και τη σωστή διαχείριση του χρόνου, μειώνοντας το άγχος στις εξετάσεις.

Online ενημέρωση και Τακτικές ενημερώσεις γονέων
Μέσω του πρωτοποριακού συστήματος 24ωρης Οnline ενημέρωσης κάθε γονιός έχει πρόσβαση στον προσωπικό φάκελο του παιδιού του, ώστε να ενημερώνεται καθημερινά για την προφορική και γραπτή του απόδοση. Φυσικά υπάρχουν και οι προγραμματισμένες προσωπικές ενημερώσεις γονέων από τους καθηγητές, αλλά και έκτακτες όποτε παραστεί ανάγκη.

Παιδαγωγική προσέγγιση
Είμαστε κοντά στο μαθητή μέσω ατομικών συναντήσεων με τη διεύθυνση του φροντιστηρίου για προσωπική ενθάρρυνση, διαχείριση άγχους, έγκυρη ενημέρωση για καθορισμό των στόχων του, τη σωστή συμπλήρωση του μηχανογραφικού και τη συνολικότερη στήριξή του.


            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/anodos.edu.gr');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/anodos_fr');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/anodos_fr');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/company-beta/18143890');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCI3mJ6pVQ6TOoi76ketvKiA');
       Scholio::portalSocial($fake, 'google-plus', 'https://plus.google.com/115788229005223950621');




     /*=============== 11 Μπαχούρου ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Μπαχούρου', 'email' => 'E.front.bachourou@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'bachourou'])->id,
         'address' => 'Αγίου Ιεροθέου 97, Περιστέρι',
         'city' => 'Αθήνα',
         'phone' => 2105054312,
         'type_id' => 3,
         'website' => 'bachouros.gr',
         'approved' => 1,
         'about' => '
            Βρισκόμαστε στο πλευρό των μαθητών από το 1992 προσφέροντας τους πλήρη υποστήριξη. Στόχος μας οι σωστές βάσεις στο γυμνάσιο και η ολοκληρωμένη και αποτελεσματική προετοιμασία στο λύκειο, έτσι ώστε να εξασφαλίσουμε την επιτυχία τους στα ΑΕΙ και ΤΕΙ και μάλιστα στη σχολή της πρώτης τους προτίμησης.
            Στη προσπάθεια αυτή στηριχτήκαμε:
            Στη σταθερή ομάδα εξαιρετικών καθηγητών που παρέχουν υψηλού επιπέδου εκπαίδευση.
            Στη συνεχώς βελτιούμενη αυστηρή οργάνωση που μας επιτρέπει να διαμορφώνουμε ένα ετήσιο πρόγραμμα μαθημάτων και διαγωνισμάτων έτσι ώστε η ύλη να καλύπτεται νωρίς, η εμπέδωση της να ελέγχεται διαρκώς και η περίοδος των επαναλήψεων να ξεκινά εγκαίρως.
            Στη πλήρη σειρά 55 βιβλίων των καθηγητών μας, για όλες τις τάξεις και για όλα τα μαθήματα, τα οποία ενισχύουν τη δουλειά που γίνεται στην τάξη.
            Στην αξιολόγηση του έργου μας κάθε χρόνο από τους μαθητές μας και δέσμευση από την πλευρά μας για υλοποίηση των προτάσεων τους.
            Στο σεβασμό της οικονομικής επένδυσης των γονέων διατηρώντας σε υψηλό επίπεδο τη διδασκαλία μας και όχι τα δίδακτρα, και κυρίως
            Στην εξατομικευμένη αντιμετώπιση του κάθε μαθητή με φροντίδα και συνεχή παρακολούθηση, σεβόμενοι τη μοναδικότητά του
            Σήμερα 25 χρόνια μετά, το φροντιστήριο μας, είναι όπως πάντα έτοιμο να ανταποκριθεί στις ολοένα αυξανόμενες απαιτήσεις και να καλύψει τις οποιεσδήποτε νέες ανάγκες. Αρνείται να υιοθετήσει την τάση της μικρότερης προσπάθειας που καλλιεργείται στις μέρες μας και επιλέγοντας το δρόμο της συνέπειας και της ουσιαστικής προσφοράς στέκεται στο πλευρό των μαθητών του.
            Είμαστε σίγουροι για τη δουλειά μας, πιστεύουμε στους μαθητές μας και μαζί επενδύουμε στο μέλλον.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/bachouros1992');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');





     /*=============== 12 Πυξοἶδα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Πυξοἶδα', 'email' => 'info@pixoida.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'pixoida'])->id,
         'address' => 'Ευθυμίου Δεδούση 2, Ηλιούπολη',
         'city' => 'Αθήνα',
         'phone' => 2109716170,
         'type_id' => 3,
         'website' => 'pixoida.gr',
         'approved' => 1,
         'about' => '
             Στην ταυτότητα μας αναγράφεται η επωνυμία μας: Πυξοίδα.
             Δε δηλώνουμε γλωσσοπλάστες, δηλώνουμε όμως λάτρεις της αναζήτησης του νέου μέσα από τις στέρεες βάσεις του παραδοσιακού. Έτσι, δημιουργήσαμε την Πυξοίδα. Δεν είναι αποτέλεσμα πειραματισμών αλλά καταστάλαγμα εμπειρίας και συνεχούς επικοινωνίας με τους μαθητές μας και τις οικογένειες τους.
             Στην εποχή, λοιπόν, που έρχεται να προστεθεί μια ακόμα μορφή άγχους, «του πληροφοριακού» σύμφωνα με ειδικούς, εμείς βάλαμε ως στόχο να φανούμε όσο το δυνατόν πιο χρήσιμοι. Να βοηθήσουμε τους μαθητές μας να μην χάσουν τον προσανατολισμό τους μέσα στον ωκεανό των πληροφοριών και των γνώσεων της σύγχρονης εποχής. Να καλλιεργήσουμε τις αναγκαίες δεξιότητες τους μέσα από την συναισθηματική και πνευματική ανάπτυξη τους.

             Με μεθοδολογία, οργάνωση και προγραμματισμό δίνουμε την κατεύθυνση. Με ενθάρρυνση και κίνητρο την κατάκτηση και αξιοποίηση της γνώσης βάζουμε τον στόχο της προσωπικής και κοινωνικής ευδοκίμησης.
             Με συνεχή επιμόρφωση δημιουργούμε ένα ελκυστικό εκπαιδευτικό περιβάλλον και ένα πρόγραμμα σπουδών που να ανταποκρίνεται στις ιδιαίτερες ανάγκες του κάθε μαθητή. Με διαρκή αναζήτηση του καινοτόμου και με την πεποίθηση ότι έχουμε όλοι το δικαίωμα της κοινής αφετηρίας διαθέτουμε πρωτοποριακό τεχνολογικό εξοπλισμό με τον οποίο εκμηδενίζουμε τις αποστάσεις και δίνουμε τη δυνατότητα να συναντηθούν και να μοιραστούν την εμπειρία της γνώσης μαθητές από όλη την Ελλάδα, μαθητές από τα αστικά κέντρα μέχρι τις πιο απομακρυσμένες περιοχές.
             Με οδηγό την Πυξοίδα οι μαθητές μας φτάνουν στην επιτυχία.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/pixoida');





     /*=============== 13 Μεθοδικό Γλυφάδα ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Μεθοδικό Γλυφάδα', 'email' => 'info@methodiko.net ', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'methodikoΝet'])->id,
         'address' => 'Γούναρη 199, Γλυφάδα',
         'city' => 'Αθήνα',
         'phone' => 2109636300,
         'type_id' => 3,
         'website' => 'methodiko-frontistirio.gr',
         'approved' => 1,
         'about' => '
             Το ΜΕΘΟΔΙΚΟ προετοιμάζει μαθητές της Δευτεροβάθμιας Εκπαίδευσης για να διακριθούν στο σχολείο και κυρίως για να εισαχθούν στα Τμήματα των Πανεπιστημίων και των Τ.Ε.Ι. που επιθυμούν.
             Με έμπειρους και καταξιωμένους καθηγητές που ακολουθούν ένα σωστά οργανωμένο πρόγραμμα σπουδών παρέχει στους μαθητές του τα απαραίτητα εφόδια για την επιτυχία στις Πανελλήνιες Εξετάσεις.
             Μετά από 40 και πλέον χρόνια λειτουργίας και με 38.000 περίπου μαθητές να έχουν περάσει από τις τάξεις του, το ΜΕΘΟΔΙΚΟ είναι σταθερά το πρώτο Φροντιστήριο στην Ελλάδα. Ξεκινώντας από το κέντρο της Αθήνας και παραμένοντας περισσότερο από τέσσερις δεκαετίες στην καρδιά της ελληνικής εκπαίδευσης, έχει να επιδείξει άψογη οργάνωση και υψηλή ποιότητα σπουδών που εγγυώνται την επιτυχία των μαθητών του.

             Το ΜΕΘΟΔΙΚΟ ιδρύθηκε το 1975 στο κέντρο της Αθήνας (Πλατεία Κάνιγγος) από το Νικηφόρο Μαρκάκη και τους συνεργάτες του. Από το 1983 (που ξεκίνησε το Εξεταστικό σύστημα με τις τέσσερις “ΔΕΣΜΕΣ”) οργανώθηκε ισοδύναμα σε όλα τα γνωστικά πεδία αναπτύσσοντας και εφαρμόζοντες νέες διδακτικές πρακτικές, πρότυπο εκπαιδευτικό υλικό και καινοτόμες δράσεις.
             Περιληπτικά αναφέρονται μερικές από τις εκπαιδευτικές καινοτομίες του ΜΕΘΟΔΙΚΟΥ που υιοθετήθηκαν και ενσωματώθηκαν αργότερα στη φροντιστηριακή εκπαίδευση.
             Το ΜΕΘΟΔΙΚΟ είναι το πρώτο φροντιστήριο που διαμόρφωσε από το 1984 πλήρες εκπαιδευτικό πρόγραμμα με στόχους και αξιολόγηση για όλους τους κύκλους σπουδών.
             Το πρώτο που καθιέρωσε από το 1986 το πρόγραμμα προετοιμασίας για τις Πανελλήνιες από τη Β’ Λυκείου και θέσπισε τα τρίωρα υποχρεωτικά διαγωνίσματα, τα οποία αργότερα καθιερώθηκαν από όλα τα φροντιστήρια. Πράγματι, τα διετή προγράμματα προετοιμασίας προσαρμοσμένα στις απαιτήσεις του νέου εξεταστικού συστήματος εξακολουθούν έως σήμερα να αποτελούν αναπόσπαστο κομμάτι της προετοιμασίας των μαθητών μας για τις Πανελλήνιες Εξετάσεις και το κλειδί για την επιτυχία τους.
             Το 1988 ξεκίνησε να λειτουργεί στο ΜΕΘΟΔΙΚΟ ειδικό πρόγραμμα εκμάθησης υπολογιστών για καθηγητές και το 1990, σε συνεργασία με την εταιρία Apple δημιουργήθηκαν ψηφιακά εκπαιδευτικά προγράμματα. Από το 2009 χρησιμοποιούμε διαδραστικούς πίνακες στα πλαίσια της διδασκαλίας μας και εκμεταλλευτόμαστε τις δυνατότητες που μας δίνουν οι υπολογιστές και το διαδίκτυο για να εμπλουτίσουμε το μάθημά μας με εποπτικό υλικό και ειδικό εκπαιδευτικό λογισμικό.
             Στα μέσα ενημέρωσης το ΜΕΘΟΔΙΚΟ υπήρξε το πρώτο φροντιστήριο που δημοσίευσε επιλεγμένα θέματα σε καθημερινή εφημερίδα από το 1981 (ΕΘΝΟΣ), που έδωσε απαντήσεις στα θέματα των Πανελληνίων Εξετάσεων από τηλεοπτικό σταθμό (1990-MEGA) και που είχε τη δική του εκπαιδευτική εκπομπή στην τηλεόραση (ΕΤ1, 1992-1993).
             Από το 2010 οι απαντήσεις στα θέματα των Εξετάσεων δίνονται πλέον από την ιστοσελίδα μας που συμβουλεύονται χιλιάδες υποψήφιοι, γονείς και εκπαιδευτικοί.
             Επίσης, το ΜΕΘΟΔΙΚΟ με εκπρόσωπο το Νικηφόρο Μαρκάκη συμμετείχε στη συγγραφή σχολικών βιβλίων (1983, 1998 και 2006), δημιούργησε τμήμα εκδόσεων και προσέφερε σε αυτά τα χρόνια δωρεάν σε μαθητές περίπου 780.000 βιβλία με προτεινόμενα θέματα, δοκίμια κ.α. Χαρακτηριστικά, το 2015 εκδόθηκε το τελευταίο από τα βιβλία μας με τίτλο “Οι όμορφες ιδέες, όμορφα γράφονται” με κείμενα για την επιστήμη και τον πολιτισμό.
             Από τους χιλιάδες μαθητές του ΜΕΘΟΔΙΚΟΥ, οι περισσότεροι είναι σήμερα επιστήμονες και επιτυχημένοι επαγγελματίες. Για όλους εμάς, η μεγαλύτερη καταξίωση είναι ότι συνεχίζουμε να διδάσκουμε έχοντας μαθητές τα παιδιά τους.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');


     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/methodiko.frontistirio');
     Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/Methodiko');



     /*=============== 14 Εργαστήρι Μάθησης ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Εργαστήρι Μάθησης', 'email' => 'ergastirimathisis@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ergastirimathisis'])->id,
         'address' => 'Ελλήσποντου 52, Νέα Σμύρνη',
         'city' => 'Αθήνα',
         'phone' => 2109370780,
         'type_id' => 3,
         'website' => 'ergastirimathisis.com',
         'approved' => 1,
         'about' => '
            Με αφορμή τη μακρόχρονη και συχνά κοινή παρουσία μας στο χώρο των Φροντιστηρίων Μέσης Εκπαίδευσης, οδηγηθήκαμε στην απόφαση να ενώσουμε τις δυνάμεις μας σε ένα χώρο που θα εξέφραζε τις ιδέες και τις εμπειρίες τις οποίες είχαμε αποκομίσει από αυτή μας τη διαδρομή. Η ιδέα αυτή υλοποιήθηκε το 2007, ενώ ήδη το 2009 μεταφερθήκαμε σε νέο, μεγαλύτερο χώρο, με περισσότερη όρεξη για δουλειά και ακόμα περισσότερες εμπειρίες.
            Θεωρούμε ότι η εκπαίδευση δεν είναι μια απλή μετάδοση γνώσεων, αλλά μια αμφίδρομη διαδικασία μεταξύ μαθητή – καθηγητή, κατά την οποία ο ζήλος για μάθηση από την πλευρά του μαθητή, κάτω από την υπεύθυνη, εξατομικευμένη καθοδήγηση και το αμέριστο ενδιαφέρον από την πλευρά του καθηγητή, είναι το κλειδί που θα οδηγήσει στην επίτευξη του στόχου. Γι’ αυτό, το ΕΡΓΑΣΤΗΡΙ ΜΑΘΗΣΗΣ προσφέρει :

            Αυστηρά ολιγομελή – ομοιογενή τμήματα, με στόχο τη βέλτιστη απόδοση της διδακτικής διαδικασίας
            Εξειδικευμένους και έμπειρους καθηγητές, με βαθιά γνώση του αντικειμένου της επιστήμης τους
            Δυνατότητα επιπλέον δωρεάν ωρών ατομικής διδασκαλίας για την κάλυψη τυχόν κενών
            Δωρεάν σημειώσεις για τη συστηματική μελέτη της ύλης
            Συνεχή ενημέρωση γονέων
            Μάθημα σε τραπέζι ώστε να μειώνεται η απόσταση καθηγητή – μαθητή
            Συστηματικό έλεγχο και διαρκή αξιολόγηση των μαθητών
            Πρόγραμμα τρίωρων επαναληπτικών διαγωνισμάτων υψηλού επιπέδου σε ώρες και μέρες εκτός ωρών διδασκαλίας , το οποίο ανακοινώνεται από την αρχή της χρονιάς, ώστε οι μαθητές να είναι σε θέση να προγραμματίσουν το διάβασμά τους.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/ergastirimathisis@gmail.com');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/')





        /*=============== 15 Πεδίο Γνώσης ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Πεδίο Γνώσης', 'email' => 'info@pediognosis.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'pediognosis'])->id,
            'address' => 'Μαραθώνος 3, Περιστέρι',
            'city' => 'Αθήνα',
            'phone' => 2104112118,
            'type_id' => 3,
            'website' => 'pediognosis.gr',
            'approved' => 1,
            'about' => '
                Πολιτική μας είναι η πλήρης ικανοποίηση των εκπαιδευτικών αναγκών των μαθητών μας
                με επάρκεια και αξιοπιστία μέσα σε ένα σύγχρονο και ασφαλές περιβάλλον.
                Οι στόχοι στους οποίους δεσμευόμαστε είναι:
                Η παροχή εκπαιδευτικών υπηρεσιών υψηλής αξίας προς τους μαθητές μας, και τις οικογένειές τους.
                Η πλήρης εναρμόνιση του τρόπου εργασίας μας με το τρέχον κάθε φορά εκπαιδευτικό υλικό και σύστημα εξετάσεων.
                Η ενίσχυση των επιδόσεων και αποδόσεων τόσο του κάθε μαθητή μας ξεχωριστά όσο και του κάθε τμήματος.

                Οι βασικοί παράγοντες επιτυχίας στην προσπάθειά μας να επιτύχουμε τους στόχους μας, να εκπληρώσουμε την αποστολή μας και να υλοποιήσουμε το όραμα μας, είναι:
                Οι έμπειροι και ικανοί καθηγητές με πάθος για την εκπαίδευση ώστε να διασφαλιστεί τόσο η γνώση όσο και η σωστή μετάδοσή της στους μαθητές μας.
                Η σωστή και αποτελεσματική επικοινωνία μεταξύ όλων των καθηγητών του κάθε τμήματος και ο συντονισμός όλων τόσο σε εκπαιδευτικά όσο και σε καθημερινά θέματα.
                Η υιοθέτηση νέων και αξιόπιστων τεχνολογιών και τεχνικών εκπαίδευσης.
                Η συνεχής παρακολούθηση της αποδοτικότητας των μαθητών και η στοχευμένη βελτίωσή της.
                Η συνεχής εκπαίδευση και ενημέρωση όλου του εκπαιδευτικού προσωπικού και η ενεργή συμμετοχή του στην επίτευξη των στόχων και
                Η εμφύσηση του οράματος της διοίκησης σε όλο το εκπαιδευτικό προσωπικό και διοικητικό προσωπικό.

           Για μας η εκπαίδευση είναι τρόπος ζωής
            ',
            'background' => $background,
        ]);

        new Portal($fake, 16, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook',  'https://www.facebook.com/pediognosis');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/pedio_gnosis');
       Scholio::portalSocial($fake, 'youtube',  'https://www.youtube.com/channel/UC85HxS6hoCKYlHnsWB8Rf0g/feed');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/in/%CF%80%CE%B5%CE%B4%CE%B9%CE%BF-%CE%B3%CE%BD%CF%89%CF%83%CE%B7%CF%82-73029591');
       Scholio::portalSocial($fake, 'twitter',  'https://twitter.com/pediognosis');





    }



}
