<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria6 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;



        /*=============== 1 Μάθηση net ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Μάθηση net', 'email' => 'nfo@mathisinet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'mathisinet'])->id,
            'address' => 'Αγίου Βασιλείου 140, Περιστέρι',
            'city' => 'Αθήνα',
            'phone' => 2105759001,
            'type_id' => 3,
            'website' => 'mathisinet.gr',
            'approved' => 1,
            'about' => '
                Τα παιδιά μας βρίσκονται μπροστά σε τεράστιες προκλήσεις που αφορούν το μέλλον τους. Για να τις αντιμετωπίσουν με επιτυχία και να κάνουν τα όνειρά τους πραγματικότητα, χρειάζονται πολύ ευρύτερες γνώσεις και δεξιότητες από ό,τι χρειάστηκαν ποτέ στο παρελθόν.
                Γι΄ αυτό εμείς στη ΜΑΘΗΣΗ παρέχουμε στους μαθητές μας όλα τα εφόδια για να μπορέσουν να αξιοποιήσουν τις αυριανές ευκαιρίες για κοινωνική πρόοδο και επιτυχία. Σας προσφέρουμε λοιπόν μια ολοκληρωμένη πρόταση με σημείο αναφοράς την ποιότητα και επίκεντρο τον μαθητή ως ανεξάρτητη προσωπικότητα.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/mathisinet');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/user/mathisinet/videos');



        /*=============== 2 Προσανατολισμός  ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Προσανατολισμός', 'email' => 'info@prosanatolismos-peristeri.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'prosanatolismos'])->id,
            'address' => 'Καλαμών 1, Περιστέρι',
            'city' => 'Αθήνα',
            'phone' => 2105713019,
            'type_id' => 3,
            'website' => 'prosanatolismos-peristeri.gr',
            'approved' => 1,
            'about' => '
                Βασικός στόχος του φροντιστηρίου μας είναι η επιτυχία των μαθητών μας στις σχολές των επιλογών τους πάντα με τη σκέψη πως ο κάθε μαθητής αποτελεί διαφορετική προσωπικότητα που χρειάζεται διαφορετική προσέγγιση. Κυρίαρχο στοιχείο για εμάς αποτελεί η μέθοδος εκμάθησης των απαιτούμενων μαθημάτων με τη συνεχή και υπεύθυνη καθοδήγησή μας , η σοβαρή και υπεύθυνη διδασκαλία καθώς και η αλληλεπίδραση και επικοινωνία μεταξύ καθηγητών-μαθητών και γονέων.
                Οι τρόποι που χρησιμοποιούνται για την επίτευξη των ανωτέρω στόχων είναι οι εξής:
                1) Ολιγομελή τμήματα
                2) Άριστο επιτελείο καθηγητών με πολυετή εμπειρία στη διδασκαλία
                3) Εξατομικευμένη διδασκαλία για κάλυψη κενών σε όλα τα μαθήματα.
                4) Προσωπική καρτέλα εξέλιξης του του κάθε μαθητή.
                5) Η κάθε οικογένεια και ο κάθε μαθητής αντιμετώπιζονται ιδιαίτερα σύμφωνα με τις επιλογές σπουδών των παιδιών αλλά και με τις σύγχρονες παιδαγωγικές αντιλήψεις.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 7, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/prosanatolismosperisteri');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/prosanatolismos_peristeri');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 3 Προταση Μαρούσι ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια πρόταση Μαρούσι', 'email' => 'protasif@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'protasi'])->id,
            'address' => 'Βύρωνος 21-23, Μαρούσι',
            'city' => 'Αθήνα',
            'phone' => 2108029596,
            'type_id' => 3,
            'website' => 'protasi-f.gr',
            'approved' => 1,
            'about' => '
                Το 1999 συναντήθηκαν, τυχαία, στο ίδιο φροντιστήριο  4 νέοι άνθρωποι οι οποίοι είχαν ήδη αποκτήσει μια επαγγελματική εμπειρία εργαζόμενοι, ως τότε, σε διαφορετικούς χώρους.
                Διαπίστωσαν όλοι  τους ότι είχαν ένα κοινό αίσθημα: ασφυκτιούσαν στην φροντιστηριακή πραγματικότητα που ζούσαν.
                Χώροι εκπαίδευσης είχαν μετατραπεί σε «επιχειρήσεις»  και οι μαθητές αντιμετωπίζονταν ως πελάτες. Καθηγητές αναγκάζονταν να μετατραπούν σε κινητά «λυσάρια» με βασικό στόχο «να πάει το παιδί διαβασμένο την άλλη μέρα στο σχολείο», να έχει λυμένες τις ασκήσεις στο τετράδιο και «να πει καλά το μάθημα». Προετοιμασία για τις εξετάσεις σήμαινε να παπαγαλίσουν τα παιδιά έτοιμες απαντήσεις και να εκπαιδευτούν να λύνουν θέματα-κονσέρβα.
                Ο καθένας τους είχε όμως άλλα όνειρα και άλλες φιλοδοξίες για το πώς πρέπει να είναι ο εκπαιδευτικός και ο ρόλος του, για το πώς καλλιεργείται η γνώση και το πώς αναπτύσσεται η κριτική σκέψη, για το πώς η «παραπαιδεία» μπορεί να παρέχει και παιδεία αλλά και να οδηγεί στην επιτυχία !
                Αποφάσισαν να ενώσουν τις δυνάμεις τους και ξεκίνησαν ένα συναρπαστικό ταξίδι.
                Μια φιλόλογος, ένας μαθηματικός, ένας φυσικός και ένας χημικός ήταν ήδη μια πλήρης σύνθεση που κάλυπτε τις ανάγκες των μαθητών τους σε όλα τα βασικά μαθήματα. Στην πορεία βρήκαν αντάξιους συνεργάτες όλων των ειδικοτήτων με πτυχία, μεταπτυχιακά, διατριβές. Συγγραφείς βιβλίων και έμπειρους φροντιστές.
                Και έκαναν τη δικιά τους ΕΚΠΑΙΔΕΥΤΙΚΗ ΠΡΟΤΑΣΗ στο Γαλάτσι.
                Εγκαταστάθηκαν σε ένα από τα πιο μοντέρνα κτίρια στο κέντρο του Γαλατσίου, διαμόρφωσαν το χώρο με μεράκι και ότι πιο σύγχρονο υπήρχε στην εκπαίδευση. Τα μαθήματα ξεκίνησαν σε αίθουσες ηλιόλουστες, φωτεινές, με κλιματισμό, νεανικά χρώματα και μια διάθεση δημιουργίας να διαχέεται παντού.
                Η πρόταση τάραξε τα λιμνάζοντα φροντιστηριακά νερά της περιοχής. Κάποια φροντιστήρια έκλεισαν και κάποια άλλα αναγκάσθηκαν να ακολουθήσουν ασθμαίνοντας, μιμούμενα τις εκπαιδευτικές της καινοτομίες. Γονείς και μαθητές δεν ανέχονταν να στοιβάζονται πλέον σε 15μελη τμήματα, σε μικρές και μίζερες αίθουσες χωρίς παράθυρα, να παίρνουν κακοφωτοτυπημένες σημειώσεις προχειρότητας, να τους κοιμίζουν με τη φράση «το παιδί πάει καλά, λίγο περισσότερο διάβασμα θέλει ακόμα» …
                Με σημειώσεις και βιβλία γραμμένα από τους διδάσκοντες του κάθε μαθήματος, με ολιγομελή τμήματα, ομοιογενή και ανάλογα με το επίπεδο των μαθητών, η πρόταση δεν άργησε να γίνει πόλος έλξης για μαθητές και γονείς που αναζητούσαν την ποιότητα στην εκπαίδευση.
                Δεν άργησαν να έρθουν και οι επιτυχίες! Από την πρώτη χρονιά! Το φροντιστήριο ήταν καινούργιο αλλά όλοι οι διδάσκοντες ήταν έμπειροι! Η πρόταση δεν έλεγε πλέον ότι έχει επιτυχίες, άλλωστε όλα τα φροντιστήρια αυτό διατείνονταν! Η πρόταση δημοσίευε τις επιτυχίες της σε εφημερίδες και περιοδικά! Και για να μην υπάρχει καμία αμφισβήτηση εκ του πονηρού, τα επόμενα χρόνια δημοσίευε και τις φωτογραφίες των αριστούχων της!
                Τα υπόλοιπα φροντιστήρια αναγκάσθηκαν και πάλι να ακολουθήσουν. Όχι όλα όμως, γιατί κάποια απλά είχαν ελάχιστες επιτυχίες. Το φροντιστήριο με τις μεγαλύτερες επιτυχίες στο Γαλάτσι ήταν ένα πια! Οι μαθήτριες και οι μαθητές μας έδιναν συνεντεύξεις, ως αριστούχοι και πρωτεύσαντες σε σχολές, σε εφημερίδες πανελλαδικής κυκλοφορίας και τηλεοπτικά κανάλια!
                Μια ολόκληρη γενιά φοιτητών είναι πλέον απόφοιτοι της πρότασης. Πάρα πολλές και πολλοί έχουν ήδη καταξιωθεί επαγγελματικά αφού είναι απόφοιτοι των καλύτερων σχολών της χώρας. Μάλιστα κάποιες και κάποιοι από αυτούς έχουν διδάξει στα φροντιστήρια μας ως καθηγητές ! Γιατί παρά τις επιτυχίες και τη γιγάντωση της, η πρόταση παραμένει μια μεγάλη οικογένεια. Στηρίζει τα παιδιά της και όταν πάψουν να είναι μαθητές της.
                Η  πρόταση  είναι οικογένεια γιατί πρώτα απ’ όλα οι άνθρωποι που την δημιούργησαν ποτέ δεν αντιλήφθηκαν το ρόλο τους ως ιδιοκτήτες. Ένιωθαν πάντα εκπαιδευτικοί και δίδασκαν πάντα οι ίδιοι τα κρισιμότερα μαθήματα. Περνάνε ατελείωτες ώρες διδασκαλίας μέσα στις αίθουσες, με τα παιδιά και για τα παιδιά. Δεν γνωρίζουν Σαββατοκύριακα και αργίες και η προσωπική τους ζωή αρχίζει όταν και ο τελευταίος τους μαθητής εμπεδώσει και μπορεί πλέον μόνος του να συνεχίσει το διάβασμα.
                Αυτή είναι η συνταγή της επιτυχίας που τηρείται ευλαβικά όλα αυτά τα χρόνια. Στην πορεία επιχειρήθηκε να μεταφερθεί αυτή η συνταγή. Από καταξιωμένους συναδέλφους, στη Λαμπρινή και την Κυψέλη. Τα παραρτήματα που άνοιξαν όμως αν και λειτούργησαν με την αύρα του κεντρικού φροντιστηρίου δεν είχαν τα ποιοτικά χαρακτηριστικά και όλα τα συστατικά στοιχεία της συνταγής του κεντρικού. Η προταση αναγκάσθηκε να αποσύρει τη συμμετοχή της!
                Έχοντας αυτή τη γόνιμη εμπειρία, δεν χρειάζονταν πλέον πειράματα. Η πρόταση κλωνοποιήθηκε!
                Από το 2012 λειτουργεί στη Λαμπρινή η κλωνοποιημένη  πρόταση. Με την ίδια Διεύθυνση Σπουδών η οποία μοιράζει πλέον το χρόνο της και διδάσκει η ίδια. Με την ίδια συνταγή επιτυχίας, με τα ίδια προγράμματα, σε πλήρως ανακαινισμένους χώρους. Σε κεντρικό σημείο της Λαμπρινής η νεαρή πρόταση δεν έχει σε τίποτα να ζηλέψει από την έφηβη!
                Οι στόχοι και τα σχέδια δεν σταματούν όμως εδώ. Νέες εκπλήξεις ετοιμάζονται για το μέλλον. Το διαδίκτυο δίνει τη δυνατότητα της  χρονικά άμεσης επικοινωνίας και η πρόθεση είναι να αξιοποιηθεί αυτή η δυνατότητα στο έπακρο. Ξεπερνώντας τα ασφυκτικά καθημερινά ωράρια, η ιστοσελίδα αυτή ανοίγει νέους δρόμους για την ενημέρωση γονιών και μαθητών. Ως συνέχεια  της ανταπόκρισης  που βρήκε η σελίδα «πρόταση Φροντιστήρια» που λειτουργεί ήδη στο facebook.
                To ταξίδι συνεχίζεται αλλά το κάνουμε πλέον μαζί και στην πορεία γινόμαστε όλο και περισσότεροι...
            ',
            'background' => $background,
        ]);

        new Portal($fake, 9, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/protasi.frontistiria');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 4 Διακρότημα Παγκράτι ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Διακρότημα Παγκράτι', 'email' => 'branch027@edu.diakrotima.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'diakrotimaPagrati'])->id,
            'address' => 'Υμηττού 102, Παγκράτι',
            'city' => 'Αθήνα',
            'phone' => 2130283111,
            'type_id' => 3,
            'website' => 'diakrotima.gr',
            'approved' => 1,
            'about' => '
                Το ΔΙΑΚΡΟΤΗΜΑ® σήμερα!
                Επένδυση στην εκπαίδευση – Φροντιστήρια με παρόν και μέλλον!

                Η αγορά είναι πλέον η πιο ανταγωνιστική που υπήρξε μέχρι σήμερα. Οι μαθητές θέλουν ένα φροντιστήριο με ξεκάθαρη ταυτότητα και εξειδίκευση που να συνδυάζει την ολοκληρωμένη κάλυψη του συνόλου των σύγχρονων εκπαιδευτικών αναγκών τους. Αυτή είναι η ουσία των Φροντιστηρίων ΔΙΑΚΡΟΤΗΜΑ®.
                Το όνομα των Φροντιστηρίων ΔΙΑΚΡΟΤΗΜΑ® αναγνωρίζεται σε περισσότερες από 60 περιοχές σε Ελλάδα και Κύπρο με 2 πιστοποιήσεις 2 πιστοποιήσεις ολικής ποιότητας ISO 9001 και ΕΛΟΤ 1433 από τους LLOYD\'S Register του Λονδίνου.

                ΤΟ ΜΟΝΤΕΛΟ ΤΩΝ ΦΡΟΝΤΙΣΤΗΡΙΩΝ ΜΑΣ.
                Η ποιότητα είναι σημαντικότερη από την ποσότητα. Ο βασικός μας στόχος είναι να είμαστε ένας όμιλος φροντιστηρίων που συνδυάζει την ποιότητα και την αξιοπιστία σε κάθε τομέα δράσης του, στις υπηρεσίες του, στα εκπαιδευτικά του προϊόντα καθώς και στον τρόπο διοίκησης των φροντιστηρίων του δικτύου.



                Η ΔΥΝΑΜΗ ΤΗΣ ΟΜΑΔΙΚΗΣ ΕΡΓΑΣΙΑΣ.
                Όλοι οι διευθυντές των φροντιστηρίων ΔΙΑΚΡΟΤΗΜΑ® είναι συνεργάτες και συνάδελφοι στην ίδια επιχείρηση, οι οποίοι σέβονται ο ένας τον άλλο και εργάζονται μαζί σαν ομάδα για το κοινό καλό: για την επιτυχία των μαθητών τους και των φροντιστηρίων ΔΙΑΚΡΟΤΗΜΑ!

                Η ΕΚΠΑΙΔΕΥΤΙΚΗ ΜΕΘΟΔΟΣ ΔΙΑΚΡΟΤΗΜΑ®.
                Οι μέθοδοι διδασκαλίας μας, η διαρκής εκπαιδευτική υποστήριξη που παρέχουμε στους μαθητές μας, η αδιάκοπη προσπάθεια για την επιτυχία τους καθώς και η ποικιλία των τεχνολογικών μέσων εμπέδωσης των μαθημάτων, δεν ανταποκρίνονται μόνο στις απαιτήσεις της σημερινής αγοράς, αλλά είναι συντονισμένες με τις πιο σύγχρονες μεθόδους διδασκαλίας και των υπηρεσιών της εκπαίδευσης παγκόσμια.

                Δεν είναι τυχαίο άλλωστε ότι η φροντιστηριακή εκπαίδευση ΔΕΝ είναι ένα απλά ελληνικό φαινόμενο αλλά ένα παγκόσμιο γεγονός. Φροντιστήρια υποστήριξης των μαθημάτων του σχολείου υπάρχουν σήμερα στην Ιαπωνία, την Αυστραλία, την Ιρλανδία, στη γειτονική μας Ιταλία και σε τόσες άλλες Ευρωπαϊκές χώρες.
                ΔΙΑΚΡΟΤΗΜΑ® Τα καλύτερα Φροντιστήρια της πόλης!
            ',
            'background' => $background,
        ]);

        new Portal($fake, 11, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/pagrati.diakrotima');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





        /*=============== 5 Έχεις Προοπτική ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Έχεις Προοπτική', 'email' => 'info@exeisprooptiki.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'exeisprooptiki'])->id,
            'address' => 'Κολοκοτρώνη 53, Ν. Ηράκλειο',
            'city' => 'Αθήνα',
            'phone' => 2102835411,
            'type_id' => 3,
            'website' => 'exeisprooptiki.gr',
            'approved' => 1,
            'about' => '
                Η αξιόπιστη πρόταση στην φροντιστηριακή εκπαίδευση
                Στο φροντιστήριό μας η διδασκαλία υπερέχει και διαθέτει εκφραστικότητα, ποιότητα και εμπειρία. Πεπειραμένοι, ειδικευμένοι καθηγητές, με σύγχρονες μεθόδους διδασκαλίας, εκπαιδευτικοί που διαθέτουμε επιμονή και ευαισθησία απέναντι στον μαθητή και στην προσπάθειά του.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Exeis-Prooptiki-370983683243969');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 6 Νέα Παιδεία ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Νέα Παιδεία', 'email' => 'info@nea-paideia.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'neaPaideia'])->id,
            'address' => 'Γρ. Λαμπράκη 409, Αμφιάλη',
            'city' => 'Αθήνα',
            'phone' => 2104008671,
            'type_id' => 3,
            'website' => 'nea-paideia.gr',
            'approved' => 1,
            'about' => '
                Στην Αμφιάλη το φροντιστήριό μας ξεκίνησε τη λειτουργία του το 1996.Η ίδρυσή και λειτουργία στον ιδιόκτητο χώρο μας ήταν συνέχεια μιας επιτυχημένης πορείας που ξεκίνησε το 1987 με φροντιστηριακές συνεργασίες στις περιοχές Νίκαιας και Κορυδαλλού ,συνεχίστηκε το 1988 με την ίδρυση φροντιστηρίου στην Αμφιθέα (Παλαιό Φάληρο) και τη λειτουργία από το 1991 ως και το 1995 φροντιστηρίου στον Πειραιά (Δημοτικό Θέατρο).
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');


        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Συστηματική Μελέτη');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Δημιουργική Απασχόληση');
        Scholio::portalStudy($fake, 'Δημοτικό', 'Δραστηριότητες', 'Εκπαιδευτική Ρομποτική (STEAM)');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistirioneapaideia');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/nea_paideia');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCf941Sj2XTAkBouScPPLnRQ');
       Scholio::portalSocial($fake, 'google-plus', 'https://plus.google.com/115290071406119852990');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/in/nea-paideia-30116a96/');







        /*=============== 7 Εμπέδωση ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Εμπέδωση', 'email' => 'info@empedosi.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'empedosi'])->id,
            'address' => 'Αρματωλών και Κλεφτών 49, Αμπελόκηποι',
            'city' => 'Αθήνα',
            'phone' => 2106400794,
            'type_id' => 3,
            'website' => 'empedosi.gr',
            'approved' => 1,
            'about' => '
                Η φιλοσοφία της ...Εμπέδωσης
                Περιβάλλον διδασκαλίας που είναι χώρος έμπνευσης.
                Οι καθηγητές που διδάσκουν είναι εξειδικευμένοι, κάτοχοι μεταπτυχιακών τίτλων και έχουν όρεξη για σωστή δουλειά και όραμα για μεγάλες επιτυχίες.
                Η διάρκεια ωριαίας διδασκαλίας δεν περιορίζεται στα 45 λεπτά αλλά επεκτείνεται στα 55 λεπτά.
                Αναλυτικές σημειώσεις σε όλα τα μαθήματα.
                Τα τμήματα είναι αυστηρά ομοιογενή και αποτελούνται από 3 έως 5 άτομα.
                Για την εμπέδωση της ύλης διενεργούνται τακτικά διαγωνίσματα και έκτακτα μαθήματα χωρίς καμία έξτρα επιβάρυνση.
                Οι γονείς ενημερώνονται πλήρως για την πρόοδο των μαθητών μέσω της διαδικτυακής πλατφόρμας key-school και συνεργάζονται με το διδακτικό προσωπικό.
                Δωρεάν τεστ επαγγελματικού προσανατολισμού.
                Τα δίδακτρα παραμένουν σε λογικά χαμηλά επίπεδα.
                Ειδικές τιμές για πολύτεκνες οικογένειες.
                Υποτροφίες σε αριστούχους μαθητές.
                Οργανωμένες δραστηριότητες για μαθητές.
                Η επιλογή στο φροντιστήριο Εμπέδωση θα σας δώσει ολοκληρωμένες απαντήσεις στις απορίες που σίγουρα θα έχετε...
            ',
            'background' => $background,
        ]);

        new Portal($fake, 9, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Εμπέδωση-Φροντιστήριο-Μέσης-Εκπαίδευσης-142032979311846');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





        /*=============== 8 Αλιμπινίσης ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Αλιμπινίσης', 'email' => 'info@alimpinisis.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => '11'])->id,
            'address' => 'Ελ. Βενιζέλου 98, Νέα Σμύρνη',
            'city' => 'Αθήνα',
            'phone' => 2109327170,
            'type_id' => 3,
            'website' => 'alimpinisis.gr',
            'approved' => 1,
            'about' => '
            Η φιλοσοφία μας
            Το Φροντιστήριο Μέσης Εκπαίδευσης «Αλιμπινίσης» ιδρύθηκε το 1990 στη Νέα Σμύρνη. Από την πρώτη στιγμή ο σκοπός του φροντιστηρίου μας ήταν ξεκάθαρος: Να προσφέρουμε υψηλής ποιότητας εκπαίδευση στους μαθητές μας με στόχο τη σημαντική βελτίωση της μαθητικής τους επίδοσης και την επίτευξη των στόχων τους.Για να το πετύχουμε αυτό, έχουμε κάποιες βασικές αξίες που μας χαρακτηρίζουν:
            ΟΡΓΑΝΩΣΗ
            Για να επιτευχθεί το βέλτιστο εκπαιδευτικό αποτέλεσμα, χρειάζεται πρωτίστως εξατομικευμένη προσέγγιση του κάθε μαθητή με βάση τις ικανότητες του και τις αδυναμίες του. Παράλληλα χρειάζεται να δοθούν επιπλέον κίνητρα σε κάθε μαθητή μέσα από τον ευγενή συναγωνισμό στο πλαίσιο ενός αυστηρά ομοιογενούς τμήματος. Όσοι έχουν συνεργαστεί μαζί μας γνωρίζουν πολύ καλά ότι είμαστε κατάλληλα οργανωμένοι και λειτουργούμε με έμφαση στη λεπτομέρεια προκειμένου να έχουμε άριστα δομημένα τμήματα με μαθητές του ίδιου επιπέδου. Επιπλέον συντονίζουμε διαρκώς όλες τις εκπαιδευτικές μας διαδικασίες έτσι ώστε όλα τα ενδιαφερόμενα μέρη (μαθητές, καθηγητές και γονείς) να γνωρίζουν επακριβώς πώς να συνεισφέρουν τα βέλτιστα στο τελικό αποτέλεσμα.
            ΑΦΟΣΙΩΣΗ
            Η βασική μας επένδυση ήταν, είναι και θα είναι πάντα οι άριστα καταρτισμένοι καθηγητές μας, στους οποίους δίνουμε τη δυνατότητα να ασκήσουν το εκπαιδευτικό τους έργο ευχάριστα και αποτελεσματικά, μέσα σε ένα περιβάλλον στο οποίο επικρατεί το ομαδικό πνεύμα και η αξιοκρατία. Οι καθηγητές μας διαθέτουν βαθιά γνώση του αντικειμένου τους και το κυριότερο, αστείρευτη αγάπη για τους νέους που τους ωθεί να δίνουν καθημερινά τον καλύτερο εαυτό τους για να βοηθήσουν όσο το δυνατόν περισσότερο τους μαθητές μας.
            ΕΠΙΤΥΧΙΑ
            Ο αριθμός των επιτυχόντων του φροντιστηρίου μας μιλάει από μόνος του, ωστόσο κάθε χρονιά αποτελεί για εμάς μια νέα πρόκληση για να γίνουμε ακόμα καλύτεροι. Έτσι παραμένουμε συγκεντρωμένοι στο να εξελισσόμαστε στο εκπαιδευτικό κομμάτι πάντα όμως με την απαραίτητη σοβαρότητα, οργανωτικότητα και επαγγελματισμό.
            Φιλοδοξία μας είναι να είμαστε πάντα ένας καινοτόμος και αξιόπιστος εκπαιδευτικός όμιλος, που συνεχώς επιδιώκει να βρίσκεται στην κορυφή, να ολοκληρώνουμε άριστα ότι αναλάμβανουμε και να δίνουμε πρόσβαση σε όλο και περισσότερους μαθητές στις υψηλής ποιότητας υπηρεσίες μας.

            ',
            'background' => $background,
        ]);

        new Portal($fake, 11, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/alimpinisis');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/company/frontistiria-alimpinisis/');




        /*=============== 9 Μπακούλα ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Μπακούλα', 'email' => 'bakoulas@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'bakoulas'])->id,
            'address' => 'Αγίου Ιωάννου 7, Αγ. Παρασκευή',
            'city' => 'Αθήνα',
            'phone' => 2106011814,
            'type_id' => 3,
            'website' => 'bakoula.gr',
            'approved' => 1,
            'about' => '
                Από το 1974 το φροντιστήριό μας προσφέρει αδιάκοπα ποιοτικές υπηρεσίες στο χώρο της εκπαίδευσης. Οι μαθητές μας ακολουθούν απαιτητικό πρόγραμμα και βαθμιαία αυξάνουν την ενσυνείδητη προσπάθειά τους. Παράλληλα, γράφουν πολλά διαγωνίσματα αυτοελέγχου της γνώσης τους ,και πέραν των προγραμματισμένων, και με αυτόν τον τρόπο διαπιστώνουν το επίπεδό τους και τον πραγματικό βαθμό τους. Σ \'αυτήν την θαυμάσια πορεία ανόδου τους έχουν ακούραστους και αποτελεσματικούς βοηθούς τους καθηγητές τους. Από πολλά χρόνια έχουμε καθιερώσει τα ολιγομελή και ομοιογενή τμήματα στα οποία το μάθημα γίνεται με πλήρη συνεργασία και χωρίς άγχος. Τα βιβλία μας είναι ποιοτικά και ποσοτικά πλήρη, με θέματα κλιμακούμενης δυσκολίας και βοηθούν στην επιθυμητή άνοδο του επιπέδου των μαθητών. Η παρακολούθηση και η στήριξη των καθηγητών τους είναι συνεχής. Τα αποτελέσματά τους μας δίνουν ενθάρρυνση και παρώθηση στην προσπάθειά μας .Τέλος, η επιμονή μας στη συμμετοχή των μαθητών στον αθλητισμό είναι μία ακόμη θετικότατη ενθάρρυνσή τους που οδηγεί στη μεγάλη προσπάθεια με άμεσα αποτελέσματα.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 9, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Φροντιστήρια-Σ-Μπακούλα-1741083546169972');
       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/frontistiria.bakoula');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/nikos97bakoulas');



        /*=============== 10 Πήγασος ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Πήγασος', 'email' => 'epigasos@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'pigasos'])->id,
            'address' => 'Θέμιδος 1, Μαρούσι',
            'city' => 'Αθήνα',
            'phone' => 2108053315,
            'type_id' => 3,
            'website' => 'pigasos.edu.gr',
            'approved' => 1,
            'about' => '
                Τα φροντιστήρια Μέσης Εκπαίδευσης ΠΗΓΑΣΟΣ απευθύνονται στους μαθητές της Μέσης Εκπαίδευσης του Γενικού Λυκείου και των ΕΠΑΛ που θέλουν να συμμετάσχουν στις Πανελλαδικές Εισαγωγικές Εξετάσεις για την εισαγωγή τους στα ΑΕΙ και ΤΕΙ. Το φροντιστήριο ΠΗΓΑΣΟΣ, στην ιστοσελίδα του περιέχει πληροφορίες χρήσιμες για κάθε μαθητή από το Γενικό Λύκειο ή τα ΕΠΑΛ που θέλει να ενημερωθεί για τις Πανελλήνιες Εισαγωγικές Εξετάσεις όπως:

                Θέματα Πανελληνίων Εξετάσεων.
                Βάσεις προηγούμενων ετών.
                Εγκυκλίους του Υπουργείου Παιδείας.
                Εκδόσεις του Φροντιστηρίου.
                Συνοπτική παρουσίαση των τύπων στα Μαθηματικά, στη Φυσική, Χημεία, Αρχαία, Λατινικά κ.α.
                Πληροφορίες για όλες τις σχολές ΑΕΙ, ΤΕΙ.
                Πληροφορίες για τον τρόπο λειτουργίας του Φροντιστηρίου.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 10, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/epigasos');
       Scholio::portalSocial($fake, 'google-plus', 'https://plus.google.com/u/0/106963335089929294273');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');


        /*=============== 11 Επαγωγή ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Επαγωγή', 'email' => 'info@epagogi.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'epagogi'])->id,
            'address' => 'Ρήγα Φεραίου 42, Αμφιάλη',
            'city' => 'Αθήνα',
            'phone' => 2104000043,
            'type_id' => 3,
            'website' => 'epagogi.gr',
            'approved' => 1,
            'about' => '
                Μετά από 20 χρόνια εμπειρίας σε φροντιστήρια μέσης εκπαίδευσης του Κερατσινίου, γνωρίζοντας πολύ καλά τις ανάγκες των μαθητών και τις απαιτήσεις του εκπαιδευτικού συστήματος, προχωρήσαμε στη δημιουργία ενός νέου εκπαιδευτικού χώρου στην περιοχή της Αμφιάλης.
                Κίνητρο σ΄αυτό το εγχείρημά μας είναι η αγάπη για τους μαθητές και η πεποίθηση ότι έχουμε τον τρόπο να τους οδηγήσουμε στην επίτευξη του επιδιωκόμενου αποτελέσματος.
                Έχοντας προετοιμάσει εκατοντάδες μαθητές με επιτυχία, ξέρουμε πια πως η προσπάθεια δεν είναι πάντα ικανή για να πετύχει ένα παιδί το στόχο του. Τις περισσότερες φορές είναι αναγκαία η σωστή καθοδήγηση και υποστήριξη, σε γνωστικό και ψυχολογικό επίπεδο, από τις τάξεις του Γυμνασίου μέχρι τις Πανελλαδικές εξετάσεις.

                Για μας ο κάθε μαθητής είναι ξεχωριστός.
                Στόχος μας είναι να αντιμετωπίζουμε τις ανάγκες του και να ενισχύουμε τις δεξιότητες και ικανότητές του· να βοηθήσουμε να ανακαλύψει αυτό που του ταιριάζει και να μπορέσει να το πραγματοποιήσει.

                Με ένα επιτελείο έμπειρων και άριστα καταρτισμένων καθηγητών, οι οποίοι διδάσκουν πολλά χρόνια στην περιοχή μας , με σύγχρονο εκπαιδευτικό υλικό για όλες τις τάξεις, σε ένα άνετο και λειτουργικά διαμορφωμένο περιβάλλον θα είμαστε με συνέπεια, υπευθυνότητα και ειλικρίνεια δίπλα στους μαθητές και τις μαθήτριές μας, προκειμένου να εξασφαλίσουν την επιτυχία!
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/EpagogiFro');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




        /*=============== 12 Μέθοδος Agia Paraskeyi================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Μέθοδος', 'email' => 'tsalaportasg@yahoo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'methodosAgiaParaskeyi'])->id,
            'address' => 'Χίου 47Α, Αγία Παρασκευή',
            'city' => 'Αθήνα',
            'phone' => 2106001341,
            'type_id' => 3,
            'website' => 'methodos.edu.gr',
            'approved' => 1,
            'about' => '
                Το φροντιστήριο ΜΕΘΟΔΟΣ ιδρύθηκε το 1992
                Όλα αυτά τα χρόνια το φροντιστήριο μας έχει ανταποκριθεί επάξια στις απαιτήσεις και τις ανάγκες της σύγχρονης εκπαίδευσης παρέχοντας άρτια εκπαίδευση με την απαιτούμενη οργάνωση και σωστή προετοιμασία. Από την ίδρυση μας έχουμε πάντα ως βασική μας προτεραιότητα την καθοδήγηση και στήριξη τόσο των μαθητών μας όσο και των γονέων στην προσπάθεια που καταβάλλεται από κοινού για την επιτυχία στις εισαγωγικές πανελλήνιες εξετάσεις
                Οι επιτυχίες μας όλα αυτά τα χρόνια έχουν ως αποτέλεσμα το φροντιστήριο ΜΕΘΟΔΟΣ να αποτελεί μια από τις πρώτες επιλογές των μαθητών της περιοχής μας

                Η Φιλοσοφία μας

                Το φροντιστήριο διακρίνεται για το υψηλό επίπεδο διδασκαλίας από ικανούς και έμπειρους καθηγητές απόλυτα εξειδικευμένους στο γνωστικό τους αντικείμενο. Η διδασκαλία κάθε μαθήματος ξεκινάει από μηδενική βάση ώστε ο μαθητής να είναι σε θέση να παρακολουθεί την ύλη , αρκεί να το θέλει ο ίδιος , καταβάλλοντας προσπάθεια και συστηματική μελέτη
            ',
            'background' => $background,
        ]);

        new Portal($fake, 9, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Φροντιστήριο-Μέθοδος-Αγία-Παρασκευή-1433525680194174');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





        /*=============== 13 Προοπτική Κερατέα ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Προοπτική Κερατέα', 'email' => 'keratea@prooptiki-fro.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'prooptikiKeratea'])->id,
            'address' => 'Νοταρά 2, Κερατέα',
            'city' => 'Αθήνα, Αττική',
            'phone' => 2299066600,
            'type_id' => 3,
            'website' => 'prooptiki-fro.gr',
            'approved' => 1,
            'about' => '
               Στα πλαίσια της φιλοσοφίας των φροντιστηρίων Προοπτική που συνοψιζεται στα λόγια του αμερικανού συγγραφέα W.Arthur Ward “ο μέτριος δάσκαλος μιλάει, ο καλός εξηγεί, ο εξαιρετικός δείχνει και ο μεγάλος δάσκαλός εμπνέει” , δημιουργήθηκε ή ιστοσελίδα αυτή με σκοπό να εμπνεύσει τους μαθητές\επισκεπτες της να δραστηριοποιηθούν, να ερευνήσουν, να μελετήσουν και να ενημερωθούν για όλες τις πτυχές της εκπαιδευτικής διαδικασίας! Στη ιστοσελίδα μας θα βρείτε τα πάντα για το νέο λύκειο , τις πανελλήνιες εξετάσεις, τις σχολές σε όλα τα ΑΕΙ και ΤΕΙ καθώς και εναν εμπεριστατωμένο οδηγό σπουδών για κάθε επιστημονικό πεδίο. Ή σελίδα θα ανανεώνεται συνεχώς με εκπαιδευτικά νέα, ανακοινώσεις του υπουργείου παιδείας αλλά και με οποιαδήποτε πληροφορία θα μπορούσε να αποδειχθεί χρήσιμη για τους μαθητές!
            ',
            'background' => $background,
        ]);

        new Portal($fake, 8, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/prooptikara');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



        /*=============== 14 Ορόσημο Αθήνα ================*/

        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Ορόσημο Αθήνα', 'email' => 'info@frontistiria.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'orosimoAthens'])->id,
            'address' => 'Μαυροκορδάτου 6',
            'city' => 'Αθήνα',
            'phone' => 2103808357,
            'type_id' => 3,
            'website' => 'frontistiria.edu.gr',
            'approved' => 1,
            'about' => '
              ΙΣΤΟΡΙΚΟ
              40 χρόνια αδιάλειπτης παρουσίας στη Μέση Εκπαίδευση . Το 1974 ο χημικός Ανδρέας Ζύρμπας και μία ομάδα εκλεκτών καθηγητών-φροντιστών ιδρύουν το ΙΑΤΡΙΚΟ ΦΡΟΝΤΙΣΤΗΡΙΟ και τις ΕΚΔΟΣΕΙΣ ΟΡΟΣΗΜΟ στο ιστορικό κτίριο των οδών Εμμ. Μπενάκη και Μαυροκορδάτου 6. Από τον πρώτο χρόνο λειτουργίας του το “ΙΑΤΡΙΚΟ ΦΡΟΝΤΙΣΤΗΡΙΟ” καθιερώνεται ως το πρώτο σε επιτυχίες και σε σειρά επιτυχίας Φροντιστήριο της Ιατρικής που φέρνει την πρωτοπορία στο χώρο της Μέσης Εκπαίδευσης και αποδεικνύεται ορόσημο για την επιτυχία στα Ανώτατα Εκπαιδευτικά Ιδρύματα. Έτσι, το 1976 μετονομάζεται σε ΟΡΟΣΗΜΟ και οδηγεί στην επιτυχία υποψηφίους των Θετικών, Θεωρητικών και Οικονομικών Σχολών. Από τότε μέχρι σήμερα το ΟΡΟΣΗΜΟ, υπό τη διεύθυνση του Ανδρέα Ζύρμπα, συνεχίζει την παράδοση 40 χρόνων προσφοράς στην εκπαίδευση και παραμένει στην κορυφή της επιτυχίας.

              Η ΤΑΥΤΟΤΗΤΑ ΜΑΣ
              Είμαστε τα πρώτα φροντιστήρια αποκλειστικά για σχολές με μεγάλο συναγωνισμό.
              Λειτουργούμε 40 χρόνια με επιτυχίες στις πιο δύσκολες σχολές των Α.Ε.Ι., γιατί μας ενδιαφέρει η ποιότητα.
              Στο διάστημα αυτό εκπαιδεύσαμε περισσότερους από 35.000 μαθητές.
              Κάθε χρόνο πετυχαίνουμε ένα ποσοστό (ανάλογα με τη σχολή) 85-98% των μαθητών μας να γίνονται φοιτητές.
              Το ποσοστό αυτό είναι αποτέλεσμα μεθοδικής δουλειάς, που βασίζεται σε ένα μελετημένο πρόγραμμα διδασκαλίας.
              Φιλοδοξούμε στην οργάνωση του ορθού τρόπου σκέψης και στη μεθόδευση του τρόπου μελέτης των σπουδαστών μας, που θα τους βοηθήσει στη μελλοντική επιστημονική σταδιοδρομία τους.



              ΤΟ ΠΡΟΓΡΑΜΜΑ ΜΑΣ
              Αυστηρή μεθόδευση της διδασκαλίας κάθε κεφαλαίου, ώστε να αποφεύγονται τα κενά και να επιτυγχάνεται η λεγόμενη «μεταφορά μάθησης», δηλαδή γνώσεις ενός κεφαλαίου τις χρησιμοποιούμε και στα επόμενα κεφάλαια και στη λύση των ασκήσεων.

              Ορθή κατανομή της ύλης ανά εβδομάδα, ώστε να ολοκληρωθεί η ύλη και να έχουμε χρόνο για οργανωμένη επανάληψη. Γιατί 40 χρόνια στην εκπαίδευση μας έχουν αποδείξει ότι η σωστή επανάληψη που γίνεται στα τμήματα είναι η βάση της υψηλής βαθμολογίας που πετυχαίνουν οι μαθητές μας.

              ΤΑ ΤΜΗΜΑΤΑ ΜΑΣ
              Είναι ομοιογενή από μαθητές, που στοχεύουν υψηλούς στόχους και έχουν τις ίδιες φιλοδοξίες.
              Είναι ολιγομελή που σύμφωνα με τα διεθνή πρότυπα αποτελούν τις «ιδανικές τάξεις» καθώς αποφεύγεται η απομόνωση που δημιουργούν τα διάφορα «γκρουπάδικα» και τα ολέθρια για τόσο δύσκολες σχολές «ιδιαίτερα».
              Είναι τμήματα στα οποία ο κάθε μαθητής αποτελεί μια ιδιαιτερότητα, ενώ συγχρόνως δεν μαθαίνει μόνο από τον καθηγητή του αλλά και από τους συμμαθητές του με τους οποίους ζει τις ίδιες αγωνίες και συνεργάζεται μαζί τους για την τελική επιτυχία.



              ΟΙ ΚΑΘΗΓΗΤΕΣ ΜΑΣ
              Η διεύθυνση και το διδακτικό προσωπικό των φροντιστηρίων μας είναι συγγραφείς – καθηγητές καταξιωμένοι στη συνείδηση γονιών και μαθητών για την ποιότητα της διδακτικής και συγγραφικής τους δουλειάς.
              Μέλη του Επιστημονικού Συλλόγου Συγγραφέων Εκπαιδευτικών.

              Μετέχουν στη μεγαλύτερη συγγραφική ομάδα των φροντιστηρίων του ομίλου μας για τη συγγραφή των καλύτερων βιβλίων, καθώς και στην ειδική έκδοση για την Παιδεία «Εξετάσεις» της Ελευθεροτυπίας.
              Καθηγητές που ξέρουν τη δουλειά τους και είναι αφοσιωμένοι σ’ αυτήν. Γνωρίζουν τις ιδιαιτερότητες που απαιτεί η διδασκαλία μαθητών που θέτουν στόχο την επιτυχία σε σχολές με μεγάλο συναγωνισμό.
              «Μάχιμοι» εκπαιδευτικοί, πάντα δίπλα στους μαθητές τους, ελέγχουν το βαθμό μάθησης του καθενός μέσα από συνεχείς γραπτές εξετάσεις και τεστ, ώστε να τους οδηγούν στην τελική επιτυχία.



              Οι λόγοι για τους οποίους εμπιστεύεστε τα ΦΡΟΝΤΙΣΤΗΡΙΑ ΟΡΟΣΗΜΟ:

              - Πολυετής πείρα.

              - Ολιγομελή – Ομοιογενή τμήματα.

              - Συνεργατική διαδικασία μάθησης.

              - Online μαθήματα-διαγωνίσματα.

              - Διδασκαλία και καθοδήγηση με ηλεκτρονικά μέσα.

              - Ενημέρωση γονέων.

              - Εκδόσεις Ορόσημο: αναγνωρισμένα διδακτικά βιβλία
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
        Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
        Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/FrontistiriaOrosimo');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/user/orosimoathina/feed');





     /*=============== 15 Ρούλα Μακρή ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστηριακός Οργανισμός Ρούλα Μακρή', 'email' => 'vironas@roulamakri.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'roulamakri'])->id,
         'address' => 'Μεταμορφώσεως 16, Βύρωνας',
         'city' => 'Αθήνα',
         'phone' => 2107626623,
         'type_id' => 3,
         'website' => 'roulamakri.gr',
         'approved' => 1,
         'about' => '
             Το φροντιστήριό μας
             Ο Πρότυπος Φροντιστηριακός Οργανισμός «ρούλα μακρή» λειτουργεί στο Παγκράτι εδώ και 20 χρόνια. Αποτελεί το κύριο κέντρο μάθησης και προετοιμασίας για τις Πανελλαδικές Εξετάσεις της ευρύτερης περιοχής του Παγκρατίου και όχι μόνο πλέον καθώς λειτουργούν και δύο παραρτήματα στον Καρέα και το Βύρωνα. Η εμπιστοσύνη που μας δείξατε και η γόνιμη συνεργασία σας μας ανέδειξε σε έναν από τους μεγαλύτερους φροντιστηριακούς οργανισμούς πανελλαδικά. Το φροντιστήριό μας έχει βοηθήσει πολλούς μαθητές να εισαχθούν στα ανώτατα και ανώτερα εκπαιδευτικά ιδρύματα της χώρας και σε πολλές των περιπτώσεων στα πλέον περιζήτητα.

             Η γνώση, η εμπειρία και η σοβαρότητα σε συνδυασμό με την οργάνωση αποτελούν βασικές προϋποθέσεις, ώστε ο μαθητής να αισθανθεί την ασφάλεια που χρειάζεται με αποτέλεσμα να αφοσιωθεί στο έργο του. Οι χιλιάδες των επιτυχόντων μας στις πρώτες τους επιλογές καθώς και το ότι είμαστε η αποκλειστική επιλογή των πιο απαιτητικών μαθητών μας δημιουργούν την ευθύνη για τη συνεχή βελτίωση της ποιότητας και των πρωτοποριακών συνθηκών μάθησης που απολαμβάνουν οι μαθητές μας. Τώρα πια ο πήχης βρίσκεται αξεπέραστα ψηλά για τους άλλους.

             Δράσεις
             Συμμετέχω:

             ενσωματώνομαι στην ομάδα
             συναγωνίζομαι και εξελίσσομαι
             Μαθαίνω:

             με σωστά οργανωμένο πρόγραμμα
             με πλούσιο διδακτικό υλικό
             με πρωτοποριακή διδασκαλία
             Βασίζομαι:

             σε έμπειρους καθηγητές
             σε στρατηγικό σχεδιασμό
             στην αξιοπιστία του Φροντιστηρίου
             Αξιολογούμαι:

             με βάση ατομικούς στόχους
             με τακτικά διαγωνίσματα

            ',
         'background' => $background,
     ]);

     new Portal($fake, 11, 'frontistirio');

     Scholio::portalStudy($fake, 'Δημοτικό', 'Δημοτικό', 'Εργαστήρι Μάθησης');


     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/RoulaMakrigr');
       Scholio::portalSocial($fake, 'linkedin', 'https://www.linkedin.com/in/roulamakri/');
       Scholio::portalSocial($fake, 'youtube', 'https://https://www.youtube.com/user/RoulaMakrigr/');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/roulamakrigr');

     Scholio::portalStudy($fake, 'Πανεπιστημιακό Φροντιστήριο', 'Διαγωνισμοί', 'ΑΣΕΠ');
     Scholio::portalStudy($fake, 'Πανεπιστημιακό Φροντιστήριο', 'Προπτυχιακά', 'Κατατακτήριες');
     Scholio::portalStudy($fake, 'Πανεπιστημιακό Φροντιστήριο', 'Προπτυχιακά', 'Φοιτητικά Μαθήματα');





     /*=============== 16 εν τάξη ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια εν τάξη', 'email' => 'info@en-taksi.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'entaksi'])->id,
         'address' => 'Αϊδινίου 26, Χαϊδάρι',
         'city' => 'Αθήνα',
         'phone' => 2105821039,
         'type_id' => 3,
         'website' => 'en-taksi.gr',
         'approved' => 1,
         'about' => '
           Eίκοσι δύο χρόνια στο χώρο της εκπαίδευσης
           Η εκπαίδευση αποτελεί αναμφισβήτητα αναπόσπαστο κομμάτι της ζωής κάθε ανθρώπου. Η σύγχρονη κοινωνική διάρθρωση αλλά κι οι συνθήκες που επικρατούν στην αγορά εργασίας αναδεικνύουν με επιτακτικό τρόπο την αναγκαιότητα ύπαρξης ποιοτικών εκπαιδευτικών υπηρεσιών μέσα από τις οποίες θα καταστεί δυνατό να αναδειχθούν και να καλλιεργηθούν οι δεξιότητες και οι ικανότητες του κάθε μαθητή. Οι πολύχρονες προσεκτικά μελετημένες και σημαντικές επενδύσεις στον τομέα της εκπαίδευσης , εγγυώνται τη μεγαλύτερη δυνατή αποτελεσματικότητα της προσφερόμενης γνώσης και προσανατολίζουν απαρέγκλιτα το μαθητή προς την επιτυχία.

           Τα τελευταία 22 χρόνια δραστηριοποιούμαστε στο χώρο της δευτεροβάθμιας εκπαίδευσης. Στην μακρόχρονη πορεία μας είχαμε ένα και μοναδικό στόχο : την παροχή ποιοτικής εκπαίδευσης στους μαθητές μας. Φιλοδοξία μας είναι να μεταγγίσουμε την αγάπη για τη γνώση και παράλληλα να καθοδηγήσουμε σωστά τον υποψήφιο στην επίτευξη του βέλτιστου εκπαιδευτικού αποτελέσματος.

           Στα φροντιστήρια εν–τάξη ο κάθε μαθητής αποτελεί ξεχωριστή προσωπικότητα και τον υποστηρίζουμε σε όλα τα στάδια της προετοιμασίας του.

           Μελετώντας σε ένα περιβάλλον ευχάριστο και λειτουργικό με τη συνδρομή του καταρτισμένου επιτελείου καθηγητών μας αλλά και έγκυρων επιστημονικών συγγραμμάτων το παιδί όχι μόνο διαμορφώνει αλλά και υλοποιεί τους στόχους του.Η άρτια οργάνωση των φροντιστηρίων μας, η πείρα, η υπομονή των καθηγητών μας και η διάθεσή τους να σταθούν δίπλα στον κάθε μαθητή ξεχωριστά αποτελούν εγγυήσεις επιτυχίας.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 15, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/entaksi');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');






     /*=============== 17 Σπουδή Πειραιάς ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια Σπουδή Πειραιάς', 'email' => 'spoudipeiraias@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'spoudifrontistiria'])->id,
         'address' => 'Ηρώων Πολυτεχνείου 30, Πειραιάς',
         'city' => 'Αθήνα, Αττική',
         'phone' => 2104190171,
         'type_id' => 3,
         'website' => 'spoudi.gr',
         'approved' => 1,
         'about' => '
            Λίγα λόγια για το φροντιστήριό μας
            Τα Φροντιστήρια ΣΠΟΥΔΗ ξεκίνησαν τη λειτουργία τους το 1982 στο ΚΕΝΤΡΟ ΤΗΣ ΑΘΗΝΑΣ. Ιδρύθηκαν από τον μαθηματικό Θανάση Σκύφα, τον φυσικό Μανώλη Παπούλια και τη φιλόλογο Έφη Ριζά. H συναντίληψή τους για θέματα εκπαίδευσης και προετοιμασίας Yποψηφίων για τις Πανελλαδικές Εξετάσεις οδήγησε στη δημιουργία ενός πολυεπίπεδου Φροντιστηριακού Φορέα που ήταν σε θέση να ανταποκριθεί με την ίδια επιτυχία σε όλους τους επιστημονικούς προσανατολισμούς, και θετικούς και θεωρητικούς. Γι’ αυτό και Επιστήμονες όλων των Ειδικοτήτων, Γιατροί, Νομικοί, Μηχανικοί, Οικονομολόγοι, Εκπαιδευτικοί υπήρξαν μαθητές της ΣΠΟΥΔΗΣ. Από το 1982 και μετά ο Φροντιστηριακός Οργανισμός ΣΠΟΥΔΗ, με συμμετοχή νέων και πολλά υποσχόμενων συνεργατών, επεκτείνεται στο ΠΑΓΚΡΑΤΙ το 1983, στον ΒΥΡΩΝΑ το 1999, και στο ΚΕΝΤΡΟ ΤΟΥ ΠΕΙΡΑΙΑ το 2014, πάντοτε με σεβασμό στην ποιότητα των παρεχόμενων εκπαιδευτικών υπηρεσιών και με διαρκή προσπάθεια ανανέωσης και προσαρμογής στα καινούρια εκπαιδευτικά και εξεταστικά δεδομένα.


            Η Φιλοσοφία των Φροντιστηρίων μας:
            Τα Φροντιστήρια ΣΠΟΥΔΗ, πάντοτε πρωτοπόρα στον σχεδιασμό και στην υλοποίηση καινοτόμων εκπαιδευτικών μεθόδων, θεμελιώνουν τη λειτουργία τους στις παρακάτω βασικές αρχές:
            • Κάθε μαθητής είναι προσωπικότητα μοναδική και μπορεί να αξιοποιήσει τις δεξιότητές του στο κατάλληλο εκπαιδευτικό περιβάλλον με την ανάλογη μαθησιακή και παιδαγωγική προσέγγιση. Οι μαθητές του φροντιστηρίου μας ενισχύονται ώστε να θέτουν εκπαιδευτικά υψηλούς στόχους και να αγωνίζονται συστηματικά και πειθαρχημένα για να τους επιτύχουν.
            • Πέραν της ομαδικής προετοιμασίας, στο επίπεδο του τμήματος, κάθε μαθητής, όταν το χρειαστεί, έχει ιδιαίτερη εκπαιδευτική βοήθεια, χωρίς περαιτέρω οικονομική επιβάρυνση.
            • Η διδακτική ώρα αξιοποιείται ώστε οι μαθητές να εξασκηθούν στην εμπέδωση της ύλης ανά μάθημα, η οποία ενισχύεται από σειρά ανάλογων εργασιών που σε συνδυασμό με τον προγραμματισμό για έγκαιρη ολοκλήρωση της ύλης συμβάλλουν στην ουσιαστική αφομοίωσή της.
            • Το εκπαιδευτικό πρόγραμμα ενισχύεται από προγραμματισμένες γραπτές εξετάσεις, διαγωνίσματα προσομοίωσης σε όλη τη διάρκεια της προετοιμασίας, ώστε να εντοπίζονται αδυναμίες τόσο στο περιεχόμενο όσο και στη δομή των γραπτών, με σκοπό την άμεση και αποτελεσματική αντιμετώπισή τους.
            • Σε όλους τους μαθητές μας διανέμονται δωρεάν βιβλία των Καθηγητών μας που είναι Συγγραφείς Εκπαιδευτικών Βοηθημάτων, τα οποία κυκλοφορούν σε όλα τα βιβλιοπωλεία της χώρας από τις Εκδόσεις Έναστρον.
            • Οι Συνεργάτες-Καθηγητές είναι όλοι εξειδικευμένοι, επιμορφωμένοι και καταρτισμένοι ανάλογα, για να διδάσκουν αποκλειστικά και αυστηρά το μάθημα της ειδικότητάς τους, έτσι ώστε να μπορούν να ανταποκρίνονται με απόλυτη επιτυχία στις υψηλών απαιτήσεων εκπαιδευτικές ανάγκες.
            • Υλοποιούμε την άμεση επαφή και επικοινωνία με το οικογενειακό περιβάλλον των μαθητών ώστε η συνεργασία μας να συνεισφέρει στην ουσιαστική εκπαιδευτική προετοιμασία. Εκτός από την τηλεφωνική και ηλεκτρονική ενημέρωση, σε τακτά χρονικά διαστήματα οργανώνονται προγραμματισμένες Συγκεντρώσεις Γονέων/Κηδεμόνων και Εκπαιδευτικών, παρουσία των ενδιαφερομένων μαθητών.
            • Με σκοπό τις ουσιαστικές επιστημονικές και μετέπειτα επαγγελματικές επιλογές αξιοποιούμε Τεστ Επαγγελματικού Προσανατολισμού, που συνοδεύεται από αντίστοιχες Συναντήσεις Συμβουλευτικής και διοργανώνουμε Ενημερωτικές Ημερίδες παρουσίασης Επιστημονικών Πεδίων και Επαγγελματικών Κλάδων, σε συνεργασία με Επιστημονικούς Φορείς και Επιμελητήρια.
            • Καθοδηγούμε τους Μαθητές/Υποψηφίους στη Συμπλήρωση του Μηχανογραφικού Δελτίου για την επιλογή των κατάλληλων Σχολών και Τμημάτων της Τριτοβάθμιας Εκπαίδευσης, λαμβάνοντας υπόψιν μας τα συμπεράσματα του Τεστ Επαγγελματικού Προσανατολισμού αλλά και τις προσωπικές επιδιώξεις των Υποψηφίων.


            Η συνέπεια στην εκπλήρωση των αρχών μας και ο σεβασμός σε σας και τους στόχους σας αποτελούν εγγύηση για την επιτυχία του κοινού σκοπού μας.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/spoudifrontistiria');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');




     /*=============== 18 Λογισμός ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστηριακός Οργανισμός Λογισμός Ηλιούπολη', 'email' => 'info@logismos.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'logismos'])->id,
         'address' => 'Κουντουριώτου 12, Ηλιούπολη',
         'city' => 'Αθήνα',
         'phone' => 2109904384,
         'type_id' => 3,
         'website' => 'logismos.edu.gr',
         'approved' => 1,
         'about' => '
           Το Διοικητικό και Εκπαιδευτικό Προσωπικό του Φροντιστηριακού Οργανισμού Λογισμός® σας καλωσορίζει στην ηλεκτρονική σελίδα του φροντιστηρίου.
           Κατά την διάρκεια της περιήγησής σας στην ιστοσελίδα μας θα μπορέσετε να ενημερωθείτε για την λειτουργία του καλύτερου φροντιστηρίου μέσης εκπαίδευσης της Ηλιούπολης και των νοτίων προαστίων, το εκπαιδευτικό μας προσωπικό, τα προγράμματα σπουδών και να έχετε πρόσβαση σε πολλές χρήσιμες πληροφορίες για εσάς και το παιδί σας.
           Ο Φροντιστηριακός Οργανισμός Λογισμός εξοπλίζει τους μαθητές του με όλα τα απαραίτητα εφόδια που θα τους εξασφαλίσουν τόσο την επιτυχία στις Πανελλήνιες εξετάσεις και την εισαγωγή τους στο Πανεπιστήμιο όσο και την επιτυχή αποφοίτησή τους από αυτό. Η επίτευξη των στόχων σας αποτελεί στοίχημα για εμάς το οποίο κερδίζουμε και θα κερδίζουμε χάρη στη σωστή οργάνωση και το άρτια καταρτισμένο εκπαιδευτικό προσωπικό μας. Καθηγητές με πολύχρονη εμπειρία στο χώρο της εκπαίδευσης βρίσκονται δίπλα στους μαθητές μας στηρίζοντάς τους και επιλύοντας οποιοδήποτε πρόβλημα τους παρουσιαστεί.
           Τα Φροντιστήρια Λογισμός στην Ηλιούπολη θα σας ενισχύσουν σε όλες τις κατευθύνσεις. Το προσωπικό μας καλύπτει με σιγουριά και αυτοπεποίθηση τους τομείς Ανθρωπιστικών Σπουδών, Θετικών Σπουδών, Σπουδών Οικονομίας και Πληροφορικής στη Γ΄ Λυκείου, Ανθρωπιστικών και Θετικών στη Β΄ Λυκείου και όλα τα κεντρικά μαθήματα των υπολοίπων τάξεων του σχολείου.
           Η φιλοσοφία μας, μας επιτρέπει και μας επιβάλλει να είμαστε σε σχέση συνεχούς αλληλεπίδρασης με εσάς, οι οποίοι εμπιστεύεστε το μέλλον του παιδιού σας στο φροντιστήριό μας. Η αμεσότητα της επικοινωνίας μαζί σας είναι καθήκον για εμάς, καθώς δεν θα μπορούσαμε ποτέ να αποτελέσουμε μια ακόμα απρόσωπη εκπαιδευτική επιχείρηση.
           Είμαστε βέβαιοι ότι αποτελούμε την καλύτερη εκπαιδευτική υπηρεσία στο χώρο των φροντιστηρίων και το αποδεικνύουμε έμπρακτα με τα αποτελέσματα των μαθητών μας. Έχοντας μελετήσει διεξοδικά το σύστημα εκπαίδευσης και παρατηρώντας την ταχύτητα των εξελίξεων και των συνεχώς αυξανόμενων απαιτήσεων για εξειδίκευση, είμαστε ικανοί να προσφέρουμε τις καλύτερες υπηρεσίες στο χώρο της εκπαίδευσης,
           αφουγκραζόμενοι πάντα τις ανάγκες σας και αντιλαμβανόμενοι την βαρύτητα της εργασίας μας.Είμαστε χαρούμενοι να παρέχουμε άριστη ποιότητα εκπαίδευσης και να διασφαλίζουμε την επιτυχία σας στις Πανελλήνιες Εξετάσεις.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 7, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/logismos.edu.gr');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');



     /*=============== 19 Κουφοπούλου ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Γκρουπ Κουφοπούλου', 'email' => 'fotiskoufopoulos@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'koufopoulou'])->id,
         'address' => 'Κύπρου 12, Παλλήνη',
         'city' => 'Αθήνα',
         'phone' => 2106668800,
         'type_id' => 3,
         'website' => 'groupkoufopoulou.gr',
         'approved' => 1,
         'about' => '
            Οι επιτυχίες των Γκρουπ Κουφόπουλου οφείλονται στο σύστημα εκπαίδευσης που εφαρμόζουν:

            Υψηλός βαθμός οργάνωσης και προγραμματισμού
            Ειδικές σημειώσεις
            Κάλυψη όλων των κενών
            Πλήρη εμπέδωση της διδακτέας ύλης
            Συχνές επαναλήψεις, επισημάνσεις
            Εξάσκηση με θέματα εκτός σχολικού βιβλίου
            Εκμάθηση της σωστής διατύπωσης των εννοιών
            Προγραμματισμένα διαγωνίσματα
            Εκπαίδευση της μεθόδου και της τεχνικής του γραπτού
            Αντικειμενική αξιολόγηση με πανελλαδικά διαγωνίσματα
            Αξιοποίηση των δυνατοτήτων του μαθητή
            Μεθοδολογία στην οργάνωση της σκέψης
            Ανάπτυξη κριτικής ικανότητας
            Αξιοποίηση του χρόνου με συστηματοποίηση της μελέτης
            Μείωση του φόβου και αύξηση του θάρρους του μαθητή
            Διαρκής συνεργασία με τους γονείς
            Χαμηλά δίδακτρα


            Επιτυχία δεν σημαίνει μόνο «ξέρω την ύλη»
            Σημαίνει κυρίως «ξέρω να γράφω σωστά την ύλη»
            ',
         'background' => $background,
     ]);

     new Portal($fake, 5, 'frontistirio');


     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistiriokoufopoulou.gr');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
       Scholio::portalSocial($fake, 'youtube', 'http://www.youtube.com/user/koufopoulosfotis');




     /*=============== 20 ΠΡΟΣ ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήρια ΠΡΟΣ', 'email' => 'info@e-pros.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'pros'])->id,
         'address' => 'Αγίου Ιωάννου 18-20, Αγία Παρασκευή',
         'city' => 'Αθήνα',
         'phone' => 2106014277,
         'type_id' => 3,
         'website' => 'e-pros.gr',
         'approved' => 1,
         'about' => '
             Φίλε μαθητή, Φίλη μαθήτρια
             Το φροντιστήριο ΠΡΟΣ από το 1994 βρίσκεται δίπλα στους μαθητές βοηθώντας τους να ανταποκριθούν στις ολοένα αυξανόμενες απαιτήσεις του εκπαιδευτικού συστήματος και να πραγματοποιήσουν τους στόχους τους.
             Οι επιτυχίες των μαθητών μας όλα αυτά τα χρόνια, είναι το επιστέγασμα της οργανωμένης και συστηματικής δουλειάς που επιτελείται στο φροντιστήριο μας αλλά και της ατομικής τους προσπάθειας.

             Το αποτελεσματικό πρόγραμμα διδασκαλίας, η άρτια κατάρτιση και η μεγάλη διδακτική εμπειρία των καθηγητών μας, η αντιμετώπιση κάθε μαθητή ως ξεχωριστή προσωπικότητα και ο συχνός έλεγχος της δουλειάς του, τα ομοιογενή τμήματα και τα παρεχόμενα συγγράμματα είναι τα κλειδιά της επιτυχίας μας.

             Η επιλογή του φροντιστηρίου σου είναι σίγουρα δική σου απόφαση. Πριν αποφασίσεις όμως, φρόντισε να ενημερωθείς σωστά, ζήτησε πληροφορίες, συζήτησε το με τους γονείς και τους συμμαθητές σου, ώστε να κάνεις την καλύτερη επιλογή.

             Το φροντιστήριο μας σου εύχεται καλή πρόοδο.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 12, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/frontistiriopros');
       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCWwQ2AXyU4mwaFFDpDWiLcQ');
       Scholio::portalSocial($fake, 'twitter', 'https://twitter.com/Prosthesi');






     /*=============== 21 Σύγχρονο ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Σύγχρονο', 'email' => 'sygchrono-edu@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'sygchrono'])->id,
         'address' => 'Αλέκου Παναγούλη 52, Γλυφάδα',
         'city' => 'Αθήνα',
         'phone' => 2108941040,
         'type_id' => 3,
         'website' => 'sygchrono-edu.gr',
         'approved' => 1,
         'about' => '
           Από την έναρξη της λειτουργίας των Φροντιστηρίων Σύγχρονο, στην Αθήνα ήδη από το 1989, στη Γλυφάδα από το 1998, στόχος μας είναι η υπεύθυνη υποστήριξη της μαθητικής προσπάθειας, η απερίσπαστη ολοκλήρωση των σχολικών σπουδών των μαθητών μας και η επιτυχής μετάβασή τους από τη μαθητική στη φοιτητική ζωή

           Φροντιστήρια
           Η εκπαιδευτική φιλοσοφία που συστηματικά εφαρμόζουμε, μεθοδικά εξελίσσουμε και διαρκώς προσαρμόζουμε στα νέα κοινωνικά και εκπαιδευτικά δεδομένα, απόρροια της πείρας και της τεχνογνωσίας της διεύθυνσης κας Μαρίας Κυριακάκη, στηρίζεται σε τρεις βασικούς άξονες: την Οργάνωση, τη Μεθοδολογία και το Ανθρώπινο Δυναμικό.

           Στα Φροντιστήρια Σύγχρονο κατέχουμε το σύστημα και διαθέτουμε την ομάδα που παράγει το αποτέλεσμα.

           Οργάνωση
           Αξιοποιούμε τη μακρόχρονη εμπειρία μας
           Mε στέρεα οργανωτική δομή, διαμορφώνουμε ενιαίο άξονα προγραμματισμού, συντονίζουμε στοχευμένα την εκπαιδευτική ομάδα, χτίζουμε την ανθρώπινη επικοινωνία, επενδύουμε στη συνεργασία, διασφαλίζουμε τη συνοχή και την ομαλότητα στη λειτουργία των Φροντιστηρίων μας και εγγυόμαστε την αποτελεσματικότητα της εκπαιδευτικής διαδικασίας.

           Oμοιογενή τμήματα 6 - 8 ατόμων
           Η οργάνωση ομοιογενών τμημάτων 6 - 8 ατόμων αποτελεί τη βασική εκπαιδευτική πρότασή μας. Εφαρμόζοντας εξατομικευμένα μαθησιακά τεστ αποτυπώνουμε με ακρίβεια τη μαθητική ταυτότητα κάθε μαθητή μας, και συγκροτούμε αυτά τα τμήματα με κριτήρια παιδαγωγικά, γνωστικά και ατομικά, ώστε να υιοθετούμε τις κατάλληλες για κάθε παιδί εκπαιδευτικές πρακτικές.

           Tμήματα ΕΠΑ.Λ.
           Για τους μαθητές των ΕΠΑ.Λ που στοχεύουν στην Ανώτερη Εκπαίδευση οργανώνουμε ξεχωριστά ολιγομελή τμήματα με πρόγραμμα προσαρμοσμένο στη δική τους εξεταστέα ύλη.

           Τμήματα Ομογενών
           Ειδικά για τους Έλληνες του εξωτε-ρικού που διεκδικούν να σπουδάσουν στη χώρα τους λειτουργούμε ταχύρρυθμα τμήματα με ενισχυμένο πρόγραμμα και εντατική διδασκαλία, κατά τους μήνες Ιούλιο – Αύγουστο.

           Ενισχυτικό πρόγραμμα Γυμνασίου
           Διαμορφώνουμε πρόγραμμα ενίσχυσης και μελέτης των βασικών μαθημάτων με ευέλικτα ωράρια για μαθητές α’, β’, γ’ γυμνασίου. Προετοιμάζουμε, επίσης, τους μαθητές για την εισαγωγή στα Πρότυπα Γυμνάσια.

           Τμήματα αποφοίτων
           Ειδικά για τους απόφοιτους, που διεκδικούν μια δεύτερη ευκαιρία στην πρώτη τους επιλογή, δημιουργούμε τμήματα με ενισχυμένο πρόγραμμα.

           Ευέλικτα τμήματα 3 - 4 ατόμων
           Όταν οι παιδαγωγικές και ατομικές ανάγκες των μαθητών μας το καλούν, οργανώνουμε αυτά τα μικρότερα ευέλικτα τμήματα, με σκοπό την καλύτερη δυνατή εξέλιξή τους μέσα από ακόμα πιο προσωπική προσέγγιση.

           Εξατομικευμένα μαθήματα
           Επιπλέον παρέχουμε τη δυνατότητα εξατομικευμένης διδασκαλίας τόσο για μεμονωμένα μαθήματα όσο και για το πλήρες εκπαιδευτικό μας πρόγραμμα.

           Τμήματα Νεοελληνικής Γλώσσας
           Οργανώνουμε ειδικά τμήματα 3 – 4 ατόμων στο μάθημα της Νεοελληνικής Γλώσσας Γ’ Γ’Ε.Λ. αποκλειστικά
            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/Σύγχρονο-Γλυφάδας-1588803398037479');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');






     /*=============== 22 Ορμή Γκρουπ ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Ορμή Γκρουπ', 'email' => 'info@ormigroup.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ormigroup'])->id,
         'address' => 'Θεσσαλονίκης 1, Γέρακας',
         'city' => 'Αθήνα',
         'phone' => 2106615559,
         'type_id' => 3,
         'website' => 'ormigroup.gr',
         'approved' => 1,
         'about' => '
           Η ΟΡΜΗ, από το 1996, είναι από τα πλέον δημοφιλή φροντιστήρια προετοιμασίας υποψηφίων Ανωτάτων Σχολών.
           Περισσότεροι από δύο χιλιάδες μαθητές μας έγιναν φοιτητές και τώρα κοσμούν την επιστημονική κοινότητα.

           Η ΟΡΜΗ, γνωρίζοντας πλήρως τις απαιτήσεις του Λυκείου και των εισαγωγικών εξετάσεων για τα Α.Ε.Ι. και Τ.Ε.Ι., προσφέρει ποιότητα, υψηλού επιπέδου εκπαιδευτικές υπηρεσίες, άρτια οργάνωση, συνέπεια, υπευθυνότητα, αξιοπιστία και αυστηρό προγραμματισμό.

           Η εμπιστοσύνη, με την οποία μας περιέβαλαν γονείς και μαθητές, είναι για μας τιμή, αλλά και καθοριστικός παράγοντας για συνεχή βελτίωση της ποιότητας της εργασίας μας, έως ότου αγγίξουμε το τέλειο.
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/OrmiGroup');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





     /*=============== 23 Διαλεκτικό ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Διαλεκτικό', 'email' => 'dialektiko.edu@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'dialektiko'])->id,
         'address' => 'Λοκρίδος 22Β, Χαλάνδρι',
         'city' => 'Αθήνα',
         'phone' => 2106772895,
         'type_id' => 3,
         'website' => 'dialektiko.edu.gr',
         'approved' => 1,
         'about' => '
             Όταν η δίψα για γνώση συνάντησε την αγάπη για διδασκαλία, δημιουργήθηκε το ΔΙΑΛΕΚΤΙΚΟ, ένα φροντιστήριο μέσης εκπαίδευσης στο Χαλάνδρι.
             Έμπειροι καθηγητές, όλων των ειδικοτήτων, με όρεξη και μεράκι βρίσκονται δίπλα στο μαθητή για την επίτευξη κάθε στόχου του. Η πολυετής εμπειρία μας στο χώρο της εκπαίδευσης, η συνέπεια και η επιμονή, η εξατομικευμένη δουλειά, μέσα από τακτές γραπτές δοκιμασίες, τα ολιγομελή και ομοιογενή τμήματα μας καθιστούν ικανούς να βοηθήσουμε τους μαθητές μας προς κάθε κατεύθυνση.
             Βασικό πυλώνα της δουλειάς μας αποτελεί η επίλυση όλων των ασκήσεων και γραπτών δοκιμασιών μέσα στην τάξη για την καλύτερη κατανόηση και εμπέδωση της ύλης. Προς αυτήν την κατεύθυνση, παρέχουμε σε κάθε μαθητή μας πλούσιο υλικό για όλα τα μαθήματα, επιμελημένο από τους ίδιους μας τους καθηγητές που τον καθοδηγούν βήμα - βήμα στην πιο ουσιαστική αφομοίωση της ύλης.
             Για την ολόπλευρη στήριξη των μαθητών μας, συνεργαζόμαστε με ειδικούς συμβούλους επαγγελματικού προσανατολισμού, με έμπειρους πιστοποιημένους ψυχολόγους, καθώς και με κέντρο συμβουλευτικής και μαθησιακών δυσκολιών.
             Εξίσου σημαντική για εμάς είναι η επικοινωνία με τους γονείς. Είμαστε κοντά σας, για να απαντήσουμε σε κάθε σας ερώτηση. Μέσω διαδικτυακής πλατφόρμας, μπορείτε εύκολα να ενημερώνεστε ανά πάσα στιγμή για την επίδοση του παιδιού σας σε κάθε μάθημα. Επίσης, μέσω των συχνών καθορισμένων ενημερώσεων στο χώρο μας, έρχεστε σε επαφή με όλους τους καθηγητές και οργανώνουμε από κοινού την πορεία του παιδιού σας.
             Ο στόχος σου, το κίνητρό μας...
             Η επιτυχία σου, η ανταμοιβή μας!!!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 10, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/dialektiko');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');


     /*=============== 24 Ανέλιξη ===============*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Φροντιστήριο Ανέλιξη', 'email' => 'anelixi.fro@gmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'anelixi'])->id,
         'address' => 'Αφεντούλη 18Α, Πειραιάς',
         'city' => 'Αθήνα, Αττική',
         'phone' => 2104282037,
         'type_id' => 3,
         'website' => 'anelixipireas-edu.blogspot.com',
         'approved' => 1,
         'about' => '
            Η Ιστορία μας

               Η ανέλιξη δημιουργήθηκε το 1991  στον Πειραιά από μια ομάδα καθηγητών  με κοινό όραμα για την παιδεία και τη γνώση. Θεωρώντας τους εαυτούς μας πάνω απ΄όλα δασκάλους δημιουργήσαμε τις προϋποθέσεις έτσι ώστε να μπορούμε απρόσκοπτα και ελεύθερα να επικεντρωθούμε στην προσωπική ανέλιξη των μαθητών μας.
            Έχουμε στεγάσει τις δραστηριότητές μας σε ένα όμορφο νεοκλασικό κτήριο που διαμορφώθηκε με
            φροντίδα σε χώρο έμπνευσης για την εκπαιδευτική μας πράξη :

               Δημιουργική διδασκαλία σε μικρές ομάδες μαθητών

            Συνδυάζουμε ιδανικά τα πλεονεκτήματα του ιδιαίτερου μαθήματος με την άμιλλα που αναπτύσσεται στα μέλη της ομάδας, αξιοποιώντας την άρτια επιστημονική κατάρτιση, τη μεγάλη διδακτική εμπειρία και την αγάπη μας για τα παιδιά, με τον καλύτερο τρόπο.

            Παρακολουθούμε συνεχώς τις αλλαγές στην εκπαίδευση!  Η επιστημονική μας εξειδίκευση και εμπειρία, μας επιτρέπουν να αξιολογούμε σωστά και υπεύθυνα τα δεδομένα κάθε εκπαιδευτικού συστήματος.   Οργανώνουμε με λεπτομέρεια τη λειτουργία μας και την προγραμματίζουμε προσεκτικά βασισμένοι  στις απαιτήσεις της ύλης και στις δυνατότητες των μαθητών μας. Έτσι οι δυσκολίες εξομαλύνονται και η επιτυχία προκύπτει ώς άμεσο αποτέλεσμα της σωστής προετοιμασίας των μαθητών.
                Από την ίδρυσή της μέχρι και σήμερα η ανέλιξη, εφαρμόζοντας με απαράμιλλη συνέπεια  τη διδακτική της μέθοδο, έχει συμβάλλει  στην δημιουργία πλήθους αποφοίτων που κατάφεραν να ξεπεράσουν τους εαυτούς τους και να πραγματοποιήσουν τα όνειρα τους πετυχαίνοντας στις πρώτες σχολές της προτίμησης τους !
                Νιώθοντας την επιβράβευση της διδακτικής μας προσφοράς, περήφανοι για τους μαθητές μας και αξιοποιώντας την πολύχρονη εμπειρία μας, συνεχίζουμε με τον ίδιο ζήλο να στηρίζουμε τους μαθητές μας στο δύσκολο μα συνάμα γοητευτικό αγώνα της κατάκτησης της γνώσης και της επίτευξης των στόχων τους!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 6, 'frontistirio');

     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Α΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'B΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Γυμνάσιο', 'Γυμνάσιο', 'Γ΄ Γυμνασίου');
     Scholio::portalStudy($fake, 'Α΄ Λυκείου', 'Γενική Παιδεία', 'Α΄ Λυκείου');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'B΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Θετικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Ανθρωπιστικών Σπουδών');
     Scholio::portalStudy($fake, 'Γ΄ Λυκείου', 'Ομάδα Προσανατολισμού', 'Οικονομικών Σπουδών & Πληροφορικής');

//       Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/');
//       Scholio::portalSocial($fake, 'instagram', 'https://www.instagram.com/');
//       Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/');





    }



}
