<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Frontistiria19 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;




     /*=============== 1 Νηπιαγωγείο Ντεκρολί ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Νηπιαγωγείο Ντεκρολί, Ωραιόκαστρο', 'email' => 'ntekroli@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ntekroli'])->id,
         'address' => 'Ωραιόκαστρο, Θεσσαλονίκη',
         'region' => 'Ωραιόκαστρο',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310696712,
         'type_id' => 9,
         'website' => 'ntekroli.gr',
         'approved' => 1,
         'about' => '
 Ο παιδικός σταθμός – νηπιαγωγείο Ντεκρολί ιδρύθηκε το 1987 από τους εκπαιδευτικούς Νίκο Κυριακίδη και Ειρήνη Αργυριάδου. Το όνομά του το οφείλει στον σημαντικό Βέλγο παιδαγωγό Οβίδιο Ντεκρολί, του οποίου την εκπαιδευτική φιλοσοφία εφαρμόζει από την πρώτη μέρα της λειτουργίας του.
  Αρχικά ο σταθμός στεγάστηκε σε μία μονοκατοικία στον οικισμό Γαλήνη του Ωραιοκάστρου. Σύντομα η μεγάλη αύξηση του αριθμού των παιδιών δημιούργησε την ανάγκη για μεγαλύτερους χώρους. Έτσι, το 1993 το Ντεκρολί μεταφέρθηκε στο κτίριο όπου στεγάζεται και σήμερα, στην ίδια περιοχή.
  Στα 30 χρόνια λειτουργίας του το Ντεκρολί έγινε γνωστό για τα μοναδικά εκπαιδευτικά του προγράμματα και την ποιότητα των υπηρεσιών του, όπως τα προγράμματα ψυχικής υγείας, οι ομάδες γονέων κ.ά., που ανέβασαν ψηλά τον πήχη της προσχολικής εκπαίδευσης στη Θεσσαλονίκη.
  Από το 2014 συνεχίζει τη λειτουργία του υπό νέα διεύθυνση, πάντοτε στο ίδιο πνεύμα και με την ίδια υπευθυνότητα και φροντίδα για το παιδί. Στον καινούργιο αυτό κύκλο λειτουργίας του, νέες δραστηριότητες, με έμφαση στον αθλητισμό, έρχονται να συμπληρώσουν το εκπαιδευτικό πρόγραμμα του Ντεκρολί και να προσφέρουν στο παιδί ένα μεγαλύτερο φάσμα επιλογών
            ',
         'background' => $background,
     ]);

     new Portal($fake, 13, 'frontistirio', 50);
    Scholio::portalStudy($fake, 'Βρεφικό', 'Βρεφικό', 'Παιδιά ηλικίας 1-2 χρονών');
    Scholio::portalStudy($fake, 'Μεταβρεφικό', 'Μεταβρεφικό', 'Παιδιά ηλικίας 2-3 χρονών');
    Scholio::portalStudy($fake, 'Μικρό Προνηπιακό', 'Μικρό Προνηπιακό', 'Παιδιά ηλικίας 3-4 χρονών');
    Scholio::portalStudy($fake, 'Προνηπιακό', 'Προνηπιακό', 'Παιδιά ηλικίας 4-5 χρονών');
    Scholio::portalStudy($fake, 'Νηπιαγωγείο', 'Νηπιαγωγείο', 'Παιδιά ηλικίας 5-6 χρονών');

    Scholio::portalStudy($fake, 'Δημιουργική Εκπαίδευση', 'Μαθησιακές Περιοχές', 'Γλώσσα');
    Scholio::portalStudy($fake, 'Δημιουργική Εκπαίδευση', 'Μαθησιακές Περιοχές', 'Φυσικές επιστήμες');
    Scholio::portalStudy($fake, 'Δημιουργική Εκπαίδευση', 'Μαθησιακές Περιοχές', 'Μαθηματικά');
    Scholio::portalStudy($fake, 'Δημιουργική Εκπαίδευση', 'Μαθησιακές Περιοχές', 'Αγγλικά');
    Scholio::portalStudy($fake, 'Δημιουργική Εκπαίδευση', 'Μαθησιακές Περιοχές', 'Τέχνες');

    Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Πηλοπλαστική');
    Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μικροί Επιστήμονες');
    Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μονοπάτια της Φύσης');
    Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μουσική');
    Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μαγειρική');

    Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/ntekroli/');





     /*=============== 2 Νηπιακός Κήπος ================*/


     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Πρότυπο Παιδικό Κέντρο - Νηπιακός Κήπος', 'email' => 'info@nipiakoskipos.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'nipiakosKipos'])->id,
         'address' => 'Πεστών 30, Άνω Τούμπα',
         'region' => 'Άνω Τούμπα',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310900059,
         'type_id' => 9,
         'website' => 'nipiakoskipos.gr',
         'approved' => 1,
         'about' => '
      Στον Νηπιακό Κήπο σχεδιάσαμε έναν χώρο που να ικανοποιεί τις βασικές ανάγκες του παιδιού της προσχολικής ηλικίας. Να του παρέχει ποσότητα και ποιότητα εμπειριών, με σκοπό να αποκαλύψει, να γνωρίσει και να αποδεχτεί τον εαυτό του.
      Οργανώσαμε έναν χώρο που στοχεύει στην ανάπτυξη και καλλιέργεια της συναισθηματικής νοημοσύνης του παιδιού, στις κοινωνικές δεξιότητες, στην αναγνώριση των συναισθημάτων, στην ενίσχυση της αυτοεκτίμησης, στην εκμάθηση υγειών συνηθειών, στην ενίσχυση της κριτικής του σκέψης, στην ενίσχυση της αυτογνωσίας τους, στο μοίρασμα, στην αποδοχή του διαφορετικού, στο σεβασμό, στη φιλία, στην αγάπη στην αυτονομία, και στην ανεξαρτησία.
      Μέσα σ΄ ένα ηλιόλουστο και καθαρό περιβάλλον, κοντά στη φύση, τα παιδιά ετοιμάζονται για καινούριες εξευρενήσεις, ανακαλύπτουν νέες εμπειρίες, συναναστρέφονται με άλλα παιδιά, προσπαθούν να γνωρίσουν και να γνωριστούν, ενώ ταυτόχρονα μαθαίνουν να διαχειρίζονται τα συναισθήματά τους, να ελέγχουν την συμπεριφορά τους και να ανταποκρίνονται σε κάθε νέο στόχο που τους δίνεται.
      .......ακολουθήστε μας σε ένα χώρο γεμάτο ζωντάνια, χαρά, πλημμυρισμένο από παιδικές φωνές και γέλια και περιτυλιγμένο από την φαντασία των παιδιών μας!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'frontistirio', 50);

        Scholio::portalStudy($fake, 'Βρεφικό', 'Βρεφικό', 'Παιδιά ηλικίας 1-2 ετών');
        Scholio::portalStudy($fake, 'Παιδικό', 'Παιδικός Σταθμός', 'Παιδιά ηλικίας 2,5-5 ετών');
        Scholio::portalStudy($fake, 'Νηπιαγωγείο', 'Νηπιαγωγείο', 'Παιδιά ηλικίας 5-6 ετών');

        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εικαστικά Εργαστήρια');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εργαστήρι Θεατρικού Παιχνιδιού');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Χορογραφίες');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Φιλαναγνωσία');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εργαστήριο Φυσικών Επιστημών');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Κουκλοθέατρο');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Νέες Τεχνολογίες');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εργαστήρι Μουσικοκινητικής Αγωγής');




     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/nipiakoskipos/');




        /*=============== 3 Αγάπη και Αγωγή στο κέντρο της Πυλαίας ================*/


        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'ΚΔΑΠ Αγάπη και Αγωγή στο κέντρο της Πυλαίας', 'email' => 'kdapagapikaiagogi@hotmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'agapiKaiAgogi'])->id,
            'address' => 'Φιλικής Εταιρείας 3, Πυλαία',
            'region' => 'Πυλαία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310023021,
            'type_id' => 9,
            'website' => 'facebook.com/pg/ΚΔΑΠ-Αγάπη-και-Αγωγή-στο-κέντρο-της-Πυλαίας-309014963217005/about/',
            'approved' => 1,
            'about' => '
                Το νέο κέντρο Δημιουργικής Απασχόλησης Παιδιών «Αγάπη και Αγωγή στο κέντρο την Πυλαίας» βρίσκεται στη διασταύρωση των οδών Παύλου Μελά & Κων/νου Παλαιολόγου. Ένας χώρος γεμάτος έμπνευση και δημιουργία όπου τα παιδιά μπορούν να απελευθερώσουν τη σκέψη και την έκφραση τους σε κατάλληλο διαμορφωμένο περιβάλλον.
                Σωστή αξιοποίηση του ελεύθερου χρόνου με ποικίλες και οργανωμένες δραστηριότητες που πραγματοποιούνται από έμπειρο και εξειδικευμένο προσωπικό. Τα παιδιά καθοδηγούνται σε δράσεις που τα κάνουν χαρούμενα, ταιριάζουν στην ηλικία τους και αναπτύσσουν τις δεξιότητές τους.
                Στόχος μας η σωστή διαπαιδαγώγηση και ψυχαγωγία των παιδιών.
                Η λειτουργία του Κ.Δ.Α.Π. ξεκινά στις 01/09 κάθε ημερολογιακού έτους
                Το ωράριο κατά τη χειμερινή περίοδο είναι από 13:30-17:30 Α’ βάρδια & 17:30-21:30 Β’ βάρδια.
                Περίοδο εορτών (Χριστούγεννα - Πάσχα) όπου τα Δημοτικά σχολεία είναι κλειστά η λειτουργία του κέντρου είναι πρωινή ώρα: 08:00-12:00 η πρώτη βάρδια & 12:00 – 16:00 η δεύτερη βάρδια. Τους καλοκαιρινούς μήνες (15/6 – 31/7) επίσης πρωινή ώρα.
                Το κέντρο διακόπτει τη λειτουργία του κατά τις επίσημες αργίες & κατά τις αργίες λόγω εορτασμού εθνικού ή τοπικού γεγονότος.
                Τα ΚΔΑΠ απευθύνονται σε μαθητές Νηπιαγωγείου και Δημοτικού σχολείου ηλικίας 5 έως 12 ετών.
                Ο αριθμός των παιδιών σε κάθε βάρδια δε θα ξεπερνά τον οριζόμενο στην απόφαση άδειας ίδρυσης & λειτουργίας του Κέντρου.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio', 40);

        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Σχολική Μελέτη');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Γυμναστική');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εργαστήριο Ραπτικής');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Ρομποτική - STEM');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Πειράματα');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Θεατρικό Παιχνίδι');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Χειροτεχνίες - Κατασκευές');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Επιτραπέζια παιχνίδια γεωγραφίας, ιστορίας, σκάκι');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/%CE%9A%CE%94%CE%91%CE%A0-%CE%91%CE%B3%CE%AC%CF%80%CE%B7-%CE%BA%CE%B1%CE%B9-%CE%91%CE%B3%CF%89%CE%B3%CE%AE-%CF%83%CF%84%CE%BF-%CE%BA%CE%AD%CE%BD%CF%84%CF%81%CE%BF-%CF%84%CE%B7%CF%82-%CE%A0%CF%85%CE%BB%CE%B1%CE%AF%CE%B1%CF%82-309014963217005/');




        /*=============== 4 ================*/


        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => '', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => '',
            'region' => '',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310,
            'type_id' => 9,
            'website' => '',
            'approved' => 1,
            'about' => '

            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio', 50);

        Scholio::portalStudy($fake, '', '', '');


//     Scholio::portalSocial($fake, 'facebook', '');


        
        /*=============== 5 ================*/


        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => '', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => '',
            'region' => '',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310,
            'type_id' => 9,
            'website' => '',
            'approved' => 1,
            'about' => '

            ',
            'background' => $background,
        ]);

        new Portal($fake, 5, 'frontistirio', 50);

        Scholio::portalStudy($fake, '', '', '');


//     Scholio::portalSocial($fake, 'facebook', '');







    }
}
