<?php

use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class Kdap01 extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;




     /*=============== 1 Νηπιαγωγείο Ντεκρολί ================*/

     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Νηπιαγωγείο Ντεκρολί, Ωραιόκαστρο', 'email' => 'ntekroli@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ntekroli'])->id,
         'address' => 'Ωραιόκαστρο, Θεσσαλονίκη',
         'region' => 'Ωραιόκαστρο',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310696712,
         'type_id' => 9,
         'website' => 'ntekroli.gr',
         'approved' => 1,
         'ranking'=>50,
         'about' => '
 Ο παιδικός σταθμός – νηπιαγωγείο Ντεκρολί ιδρύθηκε το 1987 από τους εκπαιδευτικούς Νίκο Κυριακίδη και Ειρήνη Αργυριάδου. Το όνομά του το οφείλει στον σημαντικό Βέλγο παιδαγωγό Οβίδιο Ντεκρολί, του οποίου την εκπαιδευτική φιλοσοφία εφαρμόζει από την πρώτη μέρα της λειτουργίας του.
  Αρχικά ο σταθμός στεγάστηκε σε μία μονοκατοικία στον οικισμό Γαλήνη του Ωραιοκάστρου. Σύντομα η μεγάλη αύξηση του αριθμού των παιδιών δημιούργησε την ανάγκη για μεγαλύτερους χώρους. Έτσι, το 1993 το Ντεκρολί μεταφέρθηκε στο κτίριο όπου στεγάζεται και σήμερα, στην ίδια περιοχή.
  Στα 30 χρόνια λειτουργίας του το Ντεκρολί έγινε γνωστό για τα μοναδικά εκπαιδευτικά του προγράμματα και την ποιότητα των υπηρεσιών του, όπως τα προγράμματα ψυχικής υγείας, οι ομάδες γονέων κ.ά., που ανέβασαν ψηλά τον πήχη της προσχολικής εκπαίδευσης στη Θεσσαλονίκη.
  Από το 2014 συνεχίζει τη λειτουργία του υπό νέα διεύθυνση, πάντοτε στο ίδιο πνεύμα και με την ίδια υπευθυνότητα και φροντίδα για το παιδί. Στον καινούργιο αυτό κύκλο λειτουργίας του, νέες δραστηριότητες, με έμφαση στον αθλητισμό, έρχονται να συμπληρώσουν το εκπαιδευτικό πρόγραμμα του Ντεκρολί και να προσφέρουν στο παιδί ένα μεγαλύτερο φάσμα επιλογών
            ',
         'background' => $background,
     ]);

     new Portal($fake, 13, 'kdap');
    Scholio::portalStudy($fake, 'Τμήματα', 'Βρεφικό', 'Παιδιά ηλικίας 1-2 χρονών');
    Scholio::portalStudy($fake, 'Τμήματα', 'Μεταβρεφικό', 'Παιδιά ηλικίας 2-3 χρονών');
    Scholio::portalStudy($fake, 'Τμήματα', 'Μικρό Προνηπιακό', 'Παιδιά ηλικίας 3-4 χρονών');
    Scholio::portalStudy($fake, 'Τμήματα', 'Προνηπιακό', 'Παιδιά ηλικίας 4-5 χρονών');
    Scholio::portalStudy($fake, 'Τμήματα', 'Νηπιαγωγείο', 'Παιδιά ηλικίας 5-6 χρονών');

    Scholio::portalStudy($fake, 'Δημιουργική Εκπαίδευση', 'Μαθησιακές Περιοχές', 'Γλώσσα');
    Scholio::portalStudy($fake, 'Δημιουργική Εκπαίδευση', 'Μαθησιακές Περιοχές', 'Φυσικές επιστήμες');
    Scholio::portalStudy($fake, 'Δημιουργική Εκπαίδευση', 'Μαθησιακές Περιοχές', 'Μαθηματικά');
    Scholio::portalStudy($fake, 'Δημιουργική Εκπαίδευση', 'Μαθησιακές Περιοχές', 'Αγγλικά');
    Scholio::portalStudy($fake, 'Δημιουργική Εκπαίδευση', 'Μαθησιακές Περιοχές', 'Τέχνες');

    Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Πηλοπλαστική');
    Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μικροί Επιστήμονες');
    Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μονοπάτια της Φύσης');
    Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μουσική');
    Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μαγειρική');

    Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/ntekroli/');





     /*=============== 2 Νηπιακός Κήπος ================*/


     $fake = factory(App\Models\School::class)->create([
         'user_id' => factory(App\User::class)->create(['name' => 'Πρότυπο Παιδικό Κέντρο - Νηπιακός Κήπος, Τούμπα', 'email' => 'info@nipiakoskipos.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'nipiakosKipos'])->id,
         'address' => 'Πεστών 30, Άνω Τούμπα',
         'region' => 'Άνω Τούμπα',
         'city' => 'Θεσσαλονίκη',
         'phone' => 2310900059,
         'type_id' => 9,
         'website' => 'nipiakoskipos.gr',
         'approved' => 1,
         'ranking'=>50,
         'about' => '
      Στον Νηπιακό Κήπο σχεδιάσαμε έναν χώρο που να ικανοποιεί τις βασικές ανάγκες του παιδιού της προσχολικής ηλικίας. Να του παρέχει ποσότητα και ποιότητα εμπειριών, με σκοπό να αποκαλύψει, να γνωρίσει και να αποδεχτεί τον εαυτό του.
      Οργανώσαμε έναν χώρο που στοχεύει στην ανάπτυξη και καλλιέργεια της συναισθηματικής νοημοσύνης του παιδιού, στις κοινωνικές δεξιότητες, στην αναγνώριση των συναισθημάτων, στην ενίσχυση της αυτοεκτίμησης, στην εκμάθηση υγειών συνηθειών, στην ενίσχυση της κριτικής του σκέψης, στην ενίσχυση της αυτογνωσίας τους, στο μοίρασμα, στην αποδοχή του διαφορετικού, στο σεβασμό, στη φιλία, στην αγάπη στην αυτονομία, και στην ανεξαρτησία.
      Μέσα σ΄ ένα ηλιόλουστο και καθαρό περιβάλλον, κοντά στη φύση, τα παιδιά ετοιμάζονται για καινούριες εξευρενήσεις, ανακαλύπτουν νέες εμπειρίες, συναναστρέφονται με άλλα παιδιά, προσπαθούν να γνωρίσουν και να γνωριστούν, ενώ ταυτόχρονα μαθαίνουν να διαχειρίζονται τα συναισθήματά τους, να ελέγχουν την συμπεριφορά τους και να ανταποκρίνονται σε κάθε νέο στόχο που τους δίνεται.
      .......ακολουθήστε μας σε ένα χώρο γεμάτο ζωντάνια, χαρά, πλημμυρισμένο από παιδικές φωνές και γέλια και περιτυλιγμένο από την φαντασία των παιδιών μας!
            ',
         'background' => $background,
     ]);

     new Portal($fake, 9, 'kdap');

        Scholio::portalStudy($fake, 'Τμήματα', 'Βρεφικό', 'Παιδιά ηλικίας 1-2 ετών');
        Scholio::portalStudy($fake, 'Τμήματα', 'Παιδικός Σταθμός', 'Παιδιά ηλικίας 2,5-5 ετών');
        Scholio::portalStudy($fake, 'Τμήματα', 'Νηπιαγωγείο', 'Παιδιά ηλικίας 5-6 ετών');

        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εικαστικά Εργαστήρια');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εργαστήρι Θεατρικού Παιχνιδιού');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Χορογραφίες');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Φιλαναγνωσία');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εργαστήριο Φυσικών Επιστημών');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Κουκλοθέατρο');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Νέες Τεχνολογίες');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εργαστήρι Μουσικοκινητικής Αγωγής');




     Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/nipiakoskipos/');




        /*=============== 3 Αγάπη και Αγωγή στο κέντρο της Πυλαίας ================*/


        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'ΚΔΑΠ Αγάπη και Αγωγή στο κέντρο της Πυλαίας', 'email' => 'kdapagapikaiagogi@hotmail.com', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'agapiKaiAgogi'])->id,
            'address' => 'Φιλικής Εταιρείας 3, Πυλαία',
            'region' => 'Πυλαία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310023021,
            'type_id' => 12,
            'website' => 'facebook.com/pg/ΚΔΑΠ-Αγάπη-και-Αγωγή-στο-κέντρο-της-Πυλαίας-309014963217005/about/',
            'approved' => 1,
            'ranking'=>40,
            'about' => '
                Το νέο κέντρο Δημιουργικής Απασχόλησης Παιδιών «Αγάπη και Αγωγή στο κέντρο την Πυλαίας» βρίσκεται στη διασταύρωση των οδών Παύλου Μελά & Κων/νου Παλαιολόγου. Ένας χώρος γεμάτος έμπνευση και δημιουργία όπου τα παιδιά μπορούν να απελευθερώσουν τη σκέψη και την έκφραση τους σε κατάλληλο διαμορφωμένο περιβάλλον.
                Σωστή αξιοποίηση του ελεύθερου χρόνου με ποικίλες και οργανωμένες δραστηριότητες που πραγματοποιούνται από έμπειρο και εξειδικευμένο προσωπικό. Τα παιδιά καθοδηγούνται σε δράσεις που τα κάνουν χαρούμενα, ταιριάζουν στην ηλικία τους και αναπτύσσουν τις δεξιότητές τους.
                Στόχος μας η σωστή διαπαιδαγώγηση και ψυχαγωγία των παιδιών.
                Η λειτουργία του Κ.Δ.Α.Π. ξεκινά στις 01/09 κάθε ημερολογιακού έτους
                Το ωράριο κατά τη χειμερινή περίοδο είναι από 13:30-17:30 Α’ βάρδια & 17:30-21:30 Β’ βάρδια.
                Περίοδο εορτών (Χριστούγεννα - Πάσχα) όπου τα Δημοτικά σχολεία είναι κλειστά η λειτουργία του κέντρου είναι πρωινή ώρα: 08:00-12:00 η πρώτη βάρδια & 12:00 – 16:00 η δεύτερη βάρδια. Τους καλοκαιρινούς μήνες (15/6 – 31/7) επίσης πρωινή ώρα.
                Το κέντρο διακόπτει τη λειτουργία του κατά τις επίσημες αργίες & κατά τις αργίες λόγω εορτασμού εθνικού ή τοπικού γεγονότος.
                Τα ΚΔΑΠ απευθύνονται σε μαθητές Νηπιαγωγείου και Δημοτικού σχολείου ηλικίας 5 έως 12 ετών.
                Ο αριθμός των παιδιών σε κάθε βάρδια δε θα ξεπερνά τον οριζόμενο στην απόφαση άδειας ίδρυσης & λειτουργίας του Κέντρου.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'frontistirio');

        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Σχολική Μελέτη');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Γυμναστική');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εργαστήριο Ραπτικής');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Ρομποτική - STEM');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Πειράματα');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Θεατρικό Παιχνίδι');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Χειροτεχνίες - Κατασκευές');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Επιτραπέζια παιχνίδια γεωγραφίας, ιστορίας, σκάκι');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/%CE%9A%CE%94%CE%91%CE%A0-%CE%91%CE%B3%CE%AC%CF%80%CE%B7-%CE%BA%CE%B1%CE%B9-%CE%91%CE%B3%CF%89%CE%B3%CE%AE-%CF%83%CF%84%CE%BF-%CE%BA%CE%AD%CE%BD%CF%84%CF%81%CE%BF-%CF%84%CE%B7%CF%82-%CE%A0%CF%85%CE%BB%CE%B1%CE%AF%CE%B1%CF%82-309014963217005/');




        /*=============== 4 Happy Kiddo ================*/


        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Βρεφονηπιακός Σταθμός – ΚΔΑΠ Happy Kiddo Εύοσμος', 'email' => 'info@happykiddo.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'happyKiddo'])->id,
            'address' => 'Αντώνη Τρίτση, 54, Εύοσμος',
            'region' => 'Εύοσμος',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310762135,
            'type_id' => 9,
            'website' => 'happykiddo.gr',
            'approved' => 1,
            'ranking'=>50,
            'about' => '
            Το HAPPY KIDDO αποτελεί τον πρώτο σταθμό της σχολικής ζωής του παιδιού σας. Φροντίζουμε να είναι μια κοινωνία γεμάτη αγάπη και δημιουργία, όπου και το δικό σας παιδί έχει μια θέση.
            Προσφέρουμε πλούσιο παιδαγωγικό υλικό, ασφάλεια χώρου και φροντίδα μέσα σε εγκαταστάσεις που είναι ειδικά διαμορφωμένες για την παραμονή των μικρών παιδιών σε αυτές.
            Σκοπός μας είναι η πολύπλευρη και σφαιρική, νοητική, συναισθηματική, κοινωνική και σωματική ανάπτυξη στα παιδιά με τις πιο σύγχρονες παιδαγωγικές μεθόδους.
            Η φιλοσοφία που διέπει το HAPPY KIDDO είναι να αποκτήσουν τα παιδιά μόρφωση, γνώση αλλά και τρόπους συμπεριφοράς ζωής και σκέψης, έτσι ώστε να βρουν τη θέση τους στη κοινωνία και να εξασφαλίσουν τη δυνατότητα, βασιζόμενα στην προσωπικότητα τους, να είναι υπεύθυνα, δημιουργικά και κοινωνικοποιημένα άτομα.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 11, 'kdap';

        Scholio::portalStudy($fake, 'Τμήματα', 'Βρεφικό', 'Παιδιά ηλικίας 2 μηνών-1,5 χρονών');        
        Scholio::portalStudy($fake, 'Τμήματα', 'Μεταβρεφικό', 'Παιδιά ηλικίας 1,5 - 2 χρονών');
        Scholio::portalStudy($fake, 'Τμήματα', 'Μικρό Προνηπιακό', 'Παιδιά ηλικίας 2,5 - 3,5 χρονών');
        Scholio::portalStudy($fake, 'Τμήματα', 'Προνηπιακό', 'Παιδιά ηλικίας 3,5-5 χρονών');
        Scholio::portalStudy($fake, 'Τμήματα', 'Νηπιαγωγείο', 'Παιδιά ηλικίας 5-6 χρονών');


        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Σχολική Μελέτη');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μικροί Picasso');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μουσικές Περιπλανήσεις');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Επιστήμονες Εν Δράση');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Η τέχνη του Θεάτρου και του κινηματογράφου');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Master Chef');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Ράβε Ξήλωνε');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Ψηφιακή Σκέψη');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Πράκτορες Πολιτισμού');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Πράσινο Μονοπάτι');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Λιλιπούτειοι Φιλόσοφοι');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Η ώρα του παιδιού');

        Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/HappyKiddopaidikos');


        
        /*=============== 5 Ουράνιο Τόξο ================*/


        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Βρεφονηπιακός Σταθμός - ΚΔΑΠ Ουράνιο Τόξο', 'email' => 'info@ouraniotoxothess.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'ouranio-Toxo-Thessaloniki'])->id,
            'address' => 'Καπετάν Ντόγρα 30 Κωνσταντινοπολίτικα, Πυλαία',
            'region' => 'Πυλαία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310901400,
            'type_id' => 9,
            'website' => 'ouraniotoxothess.gr',
            'approved' => 1,
            'ranking'=>50,
            'about' => '
              Ο Βρεφονηπιακός Σταθμός «Ουράνιο Τόξο» λειτουργεί από τον Σεπτέμβριο του 2009 στην οδό Ευφροσύνης 2 και Θάλειας γωνία, στον Έυοσμο Θεσσαλονίκης. Βασισμένοι στην αγάπη μας για τα παιδιά, δημιουργήσαμε έναν τέλεια διαμορφωμένο χώρο βάση των καινούργιων προδιαγραφών που έχει ορίσει το Υπουργείο Υγείας και Πρόνοιας, ώστε να προσφέρουμε την ασφάλεια και την ξεγνοιασιά σε σας και τα παιδιά σας.
              Το κτήριο των 250 τ.μ., όπου στεγάζεται ο Βρεφονηπιακός Σταθμός μας, πληρεί όλους τους κρατικούς κανονισμούς υγιεινής, καθαριότητας ενώ είναι εξοπλισμένος με τα πιο σύγχρονα συστήματα πυρανίχνευσης και πυρόσβεσης. Επίσης στον εξωτερικό χώρο των 200 τ.μ. υπάρχει οργανωμένη παιδική χαρά μεπιστοποιημένο εξοπλισμό, που επιτρέπει στα παιδιά μας να ψυχαγωγούνται και να «εκτονώνονται» με ασφάλεια.
              Στις εγκαταστάσεις μας φιλοξενούμε βρεφάκια από 40 ημερών, έως 5 ετών νήπια, σε ξεχωριστά τμήματα, σύμφωνα με τις ανάγκες της κάθε ηλικίας.
              Η φιλοσοφία μας είναι να αντιμετωπίζουμε κάθε παιδί σαν μια μοναδική προσωπικότητα, γι’ αυτό παρέχουμε τη δυνατότητα της έκφρασης με διάφορες δημιουργικές δραστηριότητες.
              Γνωρίζοντας ότι η προσωπικότητα του ατόμου διαμορφώνεται σε πολύ μεγάλο ποσοστό στα πρώτα χρόνια της ζωής του, φροντίσαμε να δημιουργήσουμε ένα περιβάλλον πλούσιο σε ερεθίσματα, βοηθώντας τα παιδιά μας να αναπτυχθούν σωματικά, συναισθηματικά, νοητικά και κοινωνικά.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 9, 'kdap');

        Scholio::portalStudy($fake, 'Τμήματα', 'Βρεφικό', 'Παιδιά ηλικίας 2 μηνών-1,5 χρονών');        
        Scholio::portalStudy($fake, 'Τμήματα', 'Μεταβρεφικό', 'Παιδιά ηλικίας 1,5 - 2 χρονών');
        Scholio::portalStudy($fake, 'Τμήματα', 'Μικρό Προνηπιακό', 'Παιδιά ηλικίας 2,5 - 3,5 χρονών');
        Scholio::portalStudy($fake, 'Τμήματα', 'Προνηπιακό', 'Παιδιά ηλικίας 3,5-5 χρονών');
        Scholio::portalStudy($fake, 'Τμήματα', 'Νηπιαγωγείο', 'Παιδιά ηλικίας 5-6 χρονών');

        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εικαστικές Δραστηριότητες - Εργαστήρι Τέχνης');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Κουκλοθέατρο - Κατασκευή Κούκλας');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Γυμναστική - Παιδική Zoumba');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Χορός - Κινητικά Παιχνίδια');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εργαστήρι Μουσικοκινητικής Αγωγής');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μουσικό Παιχνίδι - Εισαγωγή στη Μουσική');



       /*=============== 6 Γέλα Χαμογέλα, Ρετζίκι ================*/


        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Βρεφονηπιακός Σταθμός - Νηπιαγωγείο Γέλα Χαμογέλα, Ρετζίκι', 'email' => 'info@gela-xamogela.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'gela-xamogela'])->id,
            'address' => 'Γαλήνης 29, Ρετζίκι',
            'region' => 'Ρετζίκι',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310676311,
            'type_id' => 9,
            'website' => 'gela-xamogela.gr',
            'approved' => 1,
            'ranking'=>48,
            'about' => '
                Αγαπητοί γονείς ,
                Δημιουργήσαμε αυτόν τον χώρο με πολύ αγάπη και φροντίδα για το παιδί, δίνοντας ευκαιρίες έκφρασης και δημιουργικότητας.
                Σε περιβάλλον οικογενειακό και ασφαλές , με ζεστούς και φωτεινούς χώρους.
                Με κήπο μεγάλο και καταπράσινο και παιδική χαρά.
                Το παιδαγωγικό πρόγραμμα εφαρμόζεται από ανθρώπους με πείρα και πάνω από όλα με αγάπη για το παιδί και διάθεση για δημιουργία.
                Ο Σταθμός λειτουργεί υπό την οργάνωση και εποπτεία του Νηπιαγωγού Δούκα Αθανάσιου αποφοίτου του τμήματος Επιστήμων Προσχολικής Αγωγής & Εκπαίδευσης του Αριστοτελείου Πανεπιστημίου Θεσσαλονίκης,με εξειδίκευση από το Κέντρο Μελέτης Ψυχοφυσιολογίας και Εκπαίδευσης του Παιδαγωγικού Τμήματος ΔΕ του Εθνικού και Καποδιστριακού Πανεπιστημίου Αθηνών στην Ειδική Αγωγή - Μαθησιακές δυσκολίες - Δυσλεξία και της Κολέτσας Ζωής Αποφοίτου της Σχολής Διοίκησης & Οικονομίας του τμήματος Διοίκησης Επιχειρήσεων και της σχολής Προσχολικής Αγωγής δραστηριοτήτων δημιουργίας και έκφρασης με εξειδίκευση από το Πανεπιστήμιο Δυτικής Μακεδονίας - Παιδαγωγικό τμήμα νηπιαγωγών στην Ειδική Αγωγή.
                Θα χαρούμε πολύ αν έρθετε να μας γνωρίσετε από κοντά.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'kdap');

        Scholio::portalStudy($fake, 'Τμήματα', 'Βρεφικό', 'Παιδιά ηλικίας 2 μηνών-1,5 χρονών');        
        Scholio::portalStudy($fake, 'Τμήματα', 'Μεταβρεφικό', 'Παιδιά ηλικίας 1,5-3 χρονών');
        Scholio::portalStudy($fake, 'Τμήματα', 'Junior', 'Παιδιά ηλικίας 3-4 χρονών');
        Scholio::portalStudy($fake, 'Τμήματα', 'Προνηπιακό', 'Παιδιά ηλικίας 4-5 χρονών');
        Scholio::portalStudy($fake, 'Τμήματα', 'Νηπιαγωγείο', 'Παιδιά ηλικίας 5-6 χρονών');

        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Χορός – κινητικά παιχνίδια');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Δημιουργική απασχόληση');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Θεατρικό παιχνίδι');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μουσικοκινητικές δραστηριότητες');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Ηλεκτρονικοί Υπολογιστές');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Οργανωμένες γωνιές παιχνιδιών');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Μουσικό παιχνίδι');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Περιβαλλοντικές δραστηριότητες');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Παιδική λογοτεχνία');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Εκπαιδευτικά προγράμματα');
        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Υλοποίηση προγραμμάτων έκφρασης, ψυχαγωγίας και άθλησης');


    Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/GelaXamogela.GR/');
    Scholio::portalSocial($fake, 'youtube', 'https://www.youtube.com/channel/UCvK-YgpOTowye3QauwiebSQ');





        /*=============== 7 Στρουμφόκοσμος, Ευκαρπία ================*/


        $fake = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Παιδικός Σταθμός - ΚΔΑΠ Στρουμφόκοσμος, Ευκαρπία', 'email' => '', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'Paidikos-Stathmos-Stroumfokosmos'])->id,
            'address' => 'Πολυτεχνείου 46, Ευκαρπία',
            'region' => 'Ευκαρπία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2311208585,
            'type_id' => 9,
            'website' => 'stroumfokosmos.gr',
            'approved' => 1,
            'ranking'=>50,
            'about' => '
                  Φιλοσοφία μας
                  Είναι η Βιωματική Μάθηση
                  Βιωματική μάθηση σημαίνει διδασκαλία που προσαρμόζεται στις ανάγκες, τα ενδιαφέροντα και τα βιώματα των παιδιών.
                  Τα παιδιά βρίσκουν νόημα σε όσα μαθαίνουν και κάνουν συνδέσεις ανάμεσα στις γνώσεις και τις εμπειρίες που αποκτούν.
                  Η λειτουργία σε ομάδες, οι εμπειρίες, το συνεργατικό κλίμα, η συναισθηματική εμπλοκή, η Δημοκρατική κουλτούρα, η αυτενέργεια, η ενεργητική ακρόαση, ο σεβασμός του διαφορετικού, οι αναδυόμενοι στόχοι, το ελκυστικό παιδαγωγικό περιβάλλον αποτελούν τις βασικές παραμέτρους της βιωματικής μάθησης.
                  Σε αυτό το πλαίσιο αναπτύσσεται κάθε προσωπικότητα, κάθε μικρή κοινωνία όπως η σχολική ομάδα.

                  Ποιοι είμαστε
                  Μία δημιουργική ομάδα
                  Στον Στρουμφόκοσμο πιστεύουμε ότι το πρώτο σχολείο των παιδιών μας είναι σημαντικό.

                  Στον παιδικό σταθμό βάζουμε τις βάσεις για τη μετέπειτα πορεία τους στην εκπαίδευση και στη ζωή. Είναι η πρώτη φορά που τα παιδιά απομακρύνονται από το οικογενειακό περιβάλλον, έρχονται στην πρώτη δική τους μικρή κοινωνία, αποκτούν τους πρώτους δασκάλους και κάνουν τους πρώτους δικούς τους φίλους. Εδώ διαμορφώνουν ανάλογα την προσωπικότητά τους και την αντίληψή τους για το σχολείο.

                  Για αυτό, στόχος μας είναι να αγαπήσουν την μάθηση και ν´ αναπτύσσονται πολύπλευρα και ισορροπημένα: ψυχοκινητικά, κοινωνικά, συναισθηματικά, ηθικά, αισθητικά και νοητικά. Όλο το πρόγραμμά μας στηρίζεται στην αντίληψη οτι η μάθηση θεωρείται φυσικό επακόλουθο μιας ελεύθερης «συνολικής» προετοιμασίας του παιδιού. Μέσα από την ασφάλεια, την προστασία και τη ζεστασιά προτρέπουμε και βοηθούμε το παιδί να ενταχθεί στην ομάδα και το κοινωνικό σύνολο αναπτύσσοντας έτσι πολύπλευρα την προσωπικότητα τους.

                  H φιλοσοφία μας βασίζεται στη βιωματική μάθηση και σε σύγχρονες παιδαγωγικές μεθόδους, όπως την ενεργητική και συνεργατική εκπαίδευση, το παιχνίδι ως κύριο είδος “προνομιούχου” μάθησης και κατάλληλες τεχνικές επικοινωνίας και εμψύχωσης. Έτσι, βοηθάμε κάθε παιδί ν᾽ ανακαλύψει τη μοναδικότητά του, τις ικανότητες και τις κλίσεις του, τις δυνατότητες έκφρασης και επικοινωνίας, τη χαρά της δημιουργικότητας.

                  Μέσα από το πρόγραμμα μας τα παιδιά μαθαίνουν να λειτουργούν ατομικά και ομαδικά, γνωρίζουν τον κόσμο και τη φύση, κατανοούν τις ανθρώπινες αξίες και τους “άλλους”, δημιουργούν.
            ',
            'background' => $background,
        ]);

        new Portal($fake, 6, 'kdap');

        Scholio::portalStudy($fake, 'Τμήματα', 'Μικρό Προνηπιακό', 'Παιδιά ηλικίας 2,5 - 3,5 χρονών');
        Scholio::portalStudy($fake, 'Τμήματα', 'Προνηπιακό', 'Παιδιά ηλικίας 3,5-5 χρονών');

        Scholio::portalStudy($fake, 'Δημιουργική Απασχόληση', 'Δραστηριότητες', 'Δημιουργική απασχόληση');


    Scholio::portalSocial($fake, 'facebook', 'https://www.facebook.com/PaidikosStathmosStroumfokosmos/');




    }
}
