<?php
$school1 = factory(App\Models\School::class)->create([
            'city' => '',
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια ΠΛΑΤΩΝ', 'email' => 'mail@platon.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Γανόχωρα-Κατερίνη, Πιερία',
            'phone' => 2351031111-31993
            'type_id' => 6,
            'website' => 'http://www.platon.edu.gr',
            'approved' => 1,
            'about' => 'Οραματιστήκαμε και λειτουργούμε ένα σχολείο που η αποστολή του είναι:

            Η καλλιέργεια του πνεύματος με την αναζήτηση γνώσεων μέσα από ατομική και ομαδική δημιουργία.
            
            Η διαμόρφωση χαρακτήρων που θα αποδέχονται και θα στηρίζουν τις κοινωνικές αξίες.
            
            Η διάπλαση υγιούς σώματος μέσα από τη δυναμική πλούσιων αθλητικών προγραμμάτων. Η υποστήριξη των μαθητών να αποκτήσουν αυτογνωσία, να παίρνουν αποφάσεις μόνοι τους, να επικοινωνούν με τους συνανθρώπους τους, να προετοιμαστούν για το μέλλον τους και να νοιώθουν ευτυχείς.',
            'background' => $background,
        ]);
        // βρεφονηπιακός - νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο

        Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/PlatonSchools');
        Scholio::portalSocial($school1, 'instagram', '');
        Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/PlatonSchools'
        Scholio::portalSocial($school1, 'youtube', '');
        Scholio::portalSocial($school1, 'linkedin', '');
        Scholio::portalSocial($school1, 'skype', '');

        

        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'ΑΞΙΟΝ', 'email' => 'info@axion.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => ' Άβδηρα',
            'city' => 'Ξάνθη',
            'phone' => 25410 81130-81520 ,
            'type_id' => 6,
            'website' => 'http://axion.edu.gr',
            'approved' => 1,
            'about' => 'Στο σχολείο ο μαθητής μαθαίνει να χειρίζεται σωστά το χρόνο του, να σκέφτεται, να συγκεντρώνει τη σκέψη του, να αποφασίζει, να οργανώνει τις εργασίες του και με τον ίδιο ρυθμό συνεχίζει στο σπίτι.
            Προσπαθούμε να δημιουργήσουμε μεθοδικούς, ικανούς και ανεξάρτητους μαθητές, να κάνουμε τη διαδικασία της μάθησης φιλική για τα παιδιά, να αγαπήσουν οι μαθητές μας το σχολείο.
            Έχουμε πρόθεση για ακόμα περισσότερες παρεμβάσεις, στην εκπαιδευτική διαδικασία, αφού διαπιστώσουμε ότι είναι αναγκαίες για την καλύτερη επίδοση των μαθητών μας.
            Πιστεύουμε ότι ένα σχολείο με υψηλές επιδόσεις μαθητών δείχνει ένα υψηλό επίπεδο εκπαίδευσης. Αυτή είναι η επιδίωξή μας.
            Δεν στοχεύουμε μόνο στις γνώσεις αλλά και στην ανάπτυξη δεξιοτήτων. Στόχος μας, να δημιουργήσουμε τους αυριανούς πολίτες του κόσμου, γιατί αυτό απαιτούν οι καιροί. Κι όλα αυτά μέσα σε ένα ασφαλές, οικογενειακό και στοργικό κλίμα.
            Η βιωματική μάθηση κυριαρχεί. Οι μαθητές κατανοούν καλύτερα όταν ερευνούν, ανακαλύπτουν, βιώνουν και γεμίζουν εμπειρίες. Κάθε εκπαιδευτικό πρόγραμμα συνοδεύεται από εκπαιδευτικές επισκέψεις και δράσεις εντός και εκτός σχολείου.
            Από εσάς τους γονείς ζητάμε συνεργασία, κατανόηση, εμπιστοσύνη και συμπαράσταση στα παιδιά σας. Να είστε δίπλα τους. Το έργο του μικρού μαθητή είναι δύσκολο. Μια ενθάρρυνση, μια επιβράβευση, είναι η καλύτερη συμπαράσταση από μέρους σας. Να πιστέψουμε στις ικανότητές του. Η απλή φράση “μπορείς, σου έχω εμπιστοσύνη παιδί μου” δίνει δύναμη και φτερά στο μικρό μαθητή.' => $background,
        ]);

        Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/%CE%A3%CF%87%CE%BF%CE%BB%CE%B5%CE%AF%CE%B1-%CE%91%CE%9E%CE%99%CE%9F%CE%9D-AXION-Schools-246611032016806/');
        Scholio::portalSocial($school1, 'instagram', '');
        Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/Axion4');
        Scholio::portalSocial($school1, 'youtube', 'https://www.youtube.com/channel/UC11WmM5zf7GX3ptY7GCIMdA');
        Scholio::portalSocial($school1, 'linkedin', 'https://www.linkedin.com/company/4874569?trk=tyah&trkInfo=clickedVertical:company,clickedEntityId:4874569,idx:2-1-2,tarId:1484250427961,tas:axion%20sc');
        Scholio::portalSocial($school1, 'skype', '');
          //νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο

        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Αριστοτέλειο `εκπαιδευτήριο', 'email' => 'info@aristotelio.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => '6ο Χιλιόμετρο Σερρών-Δράμας',
            'city' => 'Σέρρες',
            'phone' => 23210-51111,
            'type_id' => 6,
            'website' => 'http://www.aristotelio.gr',
            'approved' => 1,
            'about' => 'Εμείς οι ιδρυτές του «ΑΡΙΣΤΟΤΕΛΕΙΟΥ ΕΚΠΑΙΔΕΥΤΗΡΙΟΥ», ως μαχόμενοι εκπαιδευτικοί - φροντιστές, γνωρίσαμε την πραγματικότητα της Ελληνικής Εκπαίδευσης για μία 20ετία. Γνωρίσαμε από πρώτο χέρι όχι μόνο τα τρωτά της σημεία, τα αδιέξοδα και της αδυναμίες της, αλλά και εκείνους τους τρόπους που διευκόλυναν τους μαθητές μας να πετύχουν τους στόχους τους και να πραγματοποιήσουν τα όνειρά τους.

            Με την εμπειρία που αποκτήσαμε και τη φλόγα που ακόμα καίει μέσα μας για ένα Σχολείο όπως όλοι κάποτε το ονειρευτήκαμε δημιουργήσαμε το ΑΡΙΣΤΟΤΕΛΕΙΟ ΕΚΠΑΙΔΕΥΤΗΡΙΟ σαν τόπο μάθησης και καλλιέργειας των αυριανών πολιτών της πατρίδας μας.
            
            Δημιουργήσαμε ένα Σχολείο που διέπεται από μία συγκεκριμένη φιλοσοφία και ακολουθεί κάποιες βασικές αρχές.
            
            Σχολείο φιλικό προς τον μαθητή: Πράγματι εκείνο για το οποίο μπορούμε να καυχηθούμε χωρίς να το αμφισβητεί κανείς είναι, ότι σήμερα στο ΑΡΙΣΤΟΤΕΛΕΙΟ έχουμε μαθητές ευχαριστημένους που έρχονται καθημερινά στο Σχολείο με θετική ψυχολογία και διάθεση. Σε αυτό συντελούν οι σύγχρονες εγκαταστάσεις, οι καθηγητές και το υπόλοιπο προσωπικό καθώς και οι ποικίλες δραστηριότητες ψυχαγωγικές και πολιτιστικές που έχουν σκοπό να κάνουν τον μαθητή να νοιώσει ότι ξεφεύγει από την στείρα εκπαιδευτική διαδικασία. Ήταν πράγματι ένας πολύ μεγάλος στόχος τον οποίο πετύχαμε.
            Ελεύθερος χρόνος στον μαθητή: Ο σημερινός μαθητής όπως είναι γνωστό και εφ'όσον βέβαια προσπαθεί να ανταποκριθεί στις υποχρεώσεις του είναι ο πιο σκληρά εργαζόμενος πολίτης. Και τούτο γιατί είναι υποχρεωμένος για να ξεπεράσει τις αδυναμίες του σημερινού Ελληνικού Σχολείου αλλά και για να ανταπεξέλθει στον σκληρό ανταγωνισμό να καταφεύγει τα απογεύματα στα παντός είδους φροντιστήρια με αποτέλεσμα να υπάρχει ελάχιστος χρόνος για την απαραίτητη μελέτη και φυσικά καθόλου ελεύθερος προσωπικός χρόνος με ότι συνεπάγονται τα παραπάνω. Ο στόχος μας λοιπόν ήταν:
            o Ένα ολοήμερο σχολείο που θα εκμηδένιζε την ανάγκη για απογευματινά φροντιστήρια.
            o Στο Σχολείο μας λοιπόν οι μαθητές προετοιμάζονται από τους πλέον έμπειρους καθηγητές είτε για τις Πανελλήνιες Εξετάσεις, είτε για τα πτυχία των Ξένων Γλωσσών, είτε για τα πτυχία της Πληροφορικής χωρίς να ξοδεύουν χρόνο και επί πλέον χρήματα τα απογεύματα για Φροντιστήρια και ιδιαίτερα μαθήματα.
            Τώρα μπορούμε να καυχηθούμε ότι πετύχαμε τον στόχο μας και μάλιστα με αποτελέσματα εντυπωσιακά.
            Πειθαρχία: Το Σχολείο μας μακριά από τα σημερινά φαινόμενα που ζει το σημερινό Ελληνικό Σχολείο (καταλήψεις, απεργίες) και υιοθετώντας ένα σύστημα πειθαρχίας προσπαθεί να παντρέψει το Παραδοσιακό Σχολείο από το οποίο περάσαμε οι παλαιότεροι με το σύγχρονο φιλελεύθερο πνεύμα της εποχής μας δίνοντας στους μαθητές μας το αίσθημα της ασφάλειας που είναι απαραίτητο για να επιτελούν απερίσπαστοι το καθήκον τους.
             ',
            'background' => $background,
        ]);

        Scholio::portalSocial($school1, 'facebook', 'http://www.facebook.com/aristotelioekpaideutirio/');
        Scholio::portalSocial($school1, 'instagram', '');
        Scholio::portalSocial($school1, 'twitter', '');
        Scholio::portalSocial($school1, 'youtube', '');
        Scholio::portalSocial($school1, 'linkedin', '');
        Scholio::portalSocial($school1, 'blogger', 'http://aristotelioserron.blogspot.com/');
        // γυμνάσιο - λύκειο


        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ιδιωτικά Εκπαιδευτήρια Προμηθέας', 'email' => 'info@promitheas.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Βενιζέλου & Χατζή, Νέα Ιωνία ',
            'city' => 'Βόλος',
            'phone' => 2421064888
            'type_id' => 6,
            'website' => 'http://promitheas.edu.gr',
            'approved' => 1,
            'about' => 'Στις 12 Σεπτεμβρίου 2012 άνοιξαν τις πύλες τους στους μαθητές τα Ιδιωτικά Εκπαιδευτήρια Βόλου «Προμηθέας» . Με σύγχρονες εκπαιδευτικές εγκαταστάσεις και τεχνολογικά μέσα, εξειδικευμένους καθηγητές και πολύπλευρο παιδαγωγικό έργοπροσφέρουμε :

            Εκπαίδευση με προοπτική και αγάπη για το μαθητή
            Εντατικά προγράμματα διδασκαλίας
            Ενδοσχολική μελέτη
            Εκμάθηση ξένων γλωσσών (Αγγλικά-Γαλλικά-Γερμανικά)
            Μύηση στα Γράμματα – Τέχνες – Επιστήμες
            Πλούσιο αθλητικό πρόγραμμα σε ιδιόκτητες αθλητικές εγκαταστάσεις
            Σε ένα περιβάλλον απόλυτα προσαρμοσμένο στις σύγχρονες εκπαιδευτικές και παιδαγωγικές ανάγκες, το ιδιωτικό σχολείο παρέχει εκπαιδευτικές υπηρεσίες υψηλής ποιότητας. Το σχολείο διαθέτει τα πιο σύγχρονα τεχνολογικά μέσα στον τομέα της εκπαίδευσης, σύγχρονο εργαστήριο φυσικών επιστημών και αίθουσα τεχνολογίας και Η/Υ.
            
             
            
            ΜΑΘΗΤΟΚΕΝΤΡΙΚΗ μάθηση
            Δημιουργική προσέγγιση της γνώσης
            Γνωστική επάρκεια των μαθητών
            Σφαιρική προσέγγιση των γνωστικών αντικειμένων
            Διαθεματική και βιωματική προσέγγιση της γνώσης
            Γνωριμία με πολιτισμούς και κουλτούρες άλλων ευρωπαϊκών χωρών, μέσα από τη συνεργασία του σχολείου με άλλα σχολεία του εξωτερικού και με ανταλλαγές μαθητών, μέσω ευρωπαϊκών προγραμμάτων.
            Ανάπτυξη των ιδιαίτερων δεξιοτήτων των μαθητών στους ειδικά διαμορφωμένους χώρους του σχολείου από το εξειδικευμένο προσωπικό
            Στόχος μας είναι η ανάπτυξη ολοκληρωμένων προσωπικοτήτων μέσα σε κλίμα άριστης συνεργασίας εκπαιδευτικών – μαθητών – γονέων',
            'background' => $background,
        ]);

        Scholio::portalSocial($school1, 'facebook', '');
        Scholio::portalSocial($school1, 'instagram', '');
        Scholio::portalSocial($school1, 'twitter', '');
        Scholio::portalSocial($school1, 'youtube', '');
        Scholio::portalSocial($school1, 'linkedin', '');
        Scholio::portalSocial($school1, 'skype', '');
  
        // γυμνάσιο - λύκειο


        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Ν.Μπακογιάννη', 'email' => 'mail@dim-nmpakog.lar.sch.gr','mail@lyk-nmpakog.lar.sch.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => '1ο χιλιόμετρο περιφερειακής Τρικάλων – Λάρισα',
            'city' => 'Λάρισα',
            'phone' => 2410624424
            'type_id' => 6,
            'website' => 'http://ekpmpakogianni.gr',
            'approved' => 1,
            'about' => 'Ο  ρόλος του σχολείου σήμερα, στο πλαίσιο των ευρύτερων, κοινωνικών, επιστημονικών και τεχνολογικών αλλαγών, έχει μεταβληθεί σημαντικά σε σχέση με τη βιωματική εικόνα που έχουμε όλοι εμείς οι μεγαλύτεροι για το δημοτικό σχολείο ως εκπαιδευτική βαθμίδα.

            Γίνεται  φανερό ότι οι μαθητές μας σήμερα, και πολύ περισσότερο αύριο, χρειάζονται ένα σύγχρονο, ρεαλιστικό και πολυδιάστατο «εξοπλισμό», συμβατό με την πολυπλοκότητα, τη δυναμική και τη μεταβλητότητα των συνθηκών του αύριο, τις οποίες θα κληθούν να αντιμετωπίσουν. Ταυτόχρονα, οι ίδιοι οι μαθητές θα πρέπει να αξιοποιήσουν αβίαστα το σύνολο του δυναμικού που διαθέτουν, να βοηθήσουν στην υιοθέτηση κινήτρων στη ζωή και τη δράση τους, καθώς και στη σταδιακή οικοδόμηση ενός συστήματος στάσεων και αξιών που να υποδηλώνει την αγωγή και την καλλιέργειά τους και να συμβάλλει τελικά στην ολόπλευρη και αρμονική ανάπτυξη της προσωπικότητας του κάθε παιδιού.
            Γι’ αυτό, λοιπόν, έχουμε σχεδιάσει και προχωρούμε σε ένα πολυδιάστατο, αποτελεσματικό και σύγχρονό εκπαιδευτικό πρόγραμμα που απαντά με πληρότητα στις ανάγκες των μαθητών και στηρίζεται σε σύγχρονα ερευνητικά δεδομένα των επιστημών αγωγής. Ένα πρόγραμμα ενιαίο και συνεκτικό από το Νηπιαγωγείο μέχρι το Λύκειο, ώστε να εξασφαλίζεται η συνέχεια και η σύνδεση της γνώσης μεταξύ των μαθημάτων από τάξη σε τάξη και από βαθμίδα σε βαθμίδα.  Συγχρόνως, δημιουργήσαμε ένα πρόγραμμα παιδαγωγικά διαφοροποιούμενο για να λαμβάνει υπόψη το διαφορετικό ρυθμό μάθησης των μαθητών, τα ιδιαίτερα χαρακτηριστικά της ομάδας, τη μοναδικότητα κάθε μαθητή και μαθήτριας. Έτσι η διδασκαλία γίνεται μια μη αυτοματοποιημένη διαδικασία, αφού η ομάδα τάξη νοείται ως άθροισμα διαφορετικοτήτων και όχι ως στατιστική προσέγγιση μιας θεωρητικής μέσης επίδοσης ή ενός, ουσιαστικά ανύπαρκτου  «μέσου μαθητή».
            Το πρόγραμμα είναι οργανωμένο σύμφωνα με τις πιο σύγχρονες μεθοδολογίες, οι οποίες καλλιεργούν το βιωματικό, συνεργατικό, μαθητοκεντρικό τρόπο μάθησης, ο οποίος  αναπτύσσει όλες τις πλευρές της προσωπικότητας των παιδιών, τα  χειραφετεί,   τα δίνει τη δυνατότητα να ανακαλύπτουν μόνα τους τα κενά τους, να οργανώνουν τη μελέτη τους και εν τέλει να λειτουργούν ως αυτόνομα και υπεύθυνα άτομα. Αυτό θα δώσει τη δυνατότητα να λειτουργούν αργότερα ως υπεύθυνοι πολίτες που θα διαθέτουν τα εφόδια να συμμετέχουν ενεργά στην οικονομική, κοινωνική και πολιτιστική ζωή. Δίνει τη δυνατότητα να έρθουν σε επικοινωνία με την ιστορία μας, την πολιτιστική μας κληρονομιά, τη θρησκεία μας, την παράδοσή μας, να αποκτήσουν βαθύ σεβασμό για την ελληνική κληρονομιά, σεβόμενοι παράλληλα την ιστορία, τη θρησκεία και παράδοση και την πολιτιστική κληρονομιά των άλλων. Να γίνουν έτσι καλοί Έλληνες αλλά και πολίτες του κόσμου.
            
            ',
            'background' => $background,
        ]);

        Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/pages/%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%9D%CE%9C%CF%80%CE%B1%CE%BA%CE%BF%CE%B3%CE%B9%CE%AC%CE%BD%CE%BD%CE%B7/264291897039643?fref=ts');
        Scholio::portalSocial($school1, 'instagram', '');
        Scholio::portalSocial($school1, 'twitter', '');
        Scholio::portalSocial($school1, 'youtube', 'https://www.youtube.com/channel/UCAIP6-e3dEP-qxjMc9Mma9Q');
        Scholio::portalSocial($school1, 'linkedin', '');
        Scholio::portalSocial($school1, 'skype', '');
        // παιδικός σταθμός - νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο


        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => ' Σχολή Καραβάνα, Το ολοήμερο σχολείο', 'email' => 'info@karavana.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => '6ο χλμ Περιφερειακής Οδού Λαρίσης Τρικάλων',
            'city' => 'Λάρισα',
            'phone' => 2410660435
            'type_id' => 6,
            'website' => 'http://www.karavana.gr',
            'approved' => 1,
            'about' => 'Η Σχολή  Καραβάνα ιδρύθηκε με σκοπό να εκπληρώσει το όραμα του ιδρυτή της για παροχή υψηλού επιπέδου εκπαίδευσης στους μαθητές της και διακρίθηκε για την ξεχωριστή της φιλοσοφία στην εκπαίδευση.

            Το σχολείο  μας είναι ένας ζωντανός, δυναμικός οργανισμός που εξελίσσεται και προχωρά ανοδικά, βελτιώνοντας συνεχώς τις υπηρεσίες που προσφέρει, χτίζοντας γερές βάσεις και προετοιμάζοντας τα παιδιά για την κοινωνία που εκείνα θα ζήσουν, την κοινωνία του αύριο.
            
            Βασικές αρχές της φιλοσοφίας της  είναι αυτές που αναγράφονται στο λογότυπο: «Ελληνική Παιδεία – Ευρωπαϊκή Εκπαίδευση».
            
             «Ελληνική Παιδεία» γιατί οι αρχές της ελληνικής παιδείας αποτελούν το θεμέλιο λίθο της εκπαίδευσης όχι μόνο στην Ελλάδα αλλά και σε όλο τον σύγχρονο κόσμο. Ελλάδα και παιδεία είναι έννοιες ταυτόσημες στην παγκόσμια συνείδηση σε όλες τις εποχές, έννοιες επίσης ταυτόσημες με τον πολιτισμό, όπου γνώση και στοχασμός, δεξιότητα και δημιουργία, σωματική και πνευματική καλλιέργεια, εργασία και αναψυχή  συμβαδίζουν αρμονικά. «Ελληνική Παιδεία» γιατί ανήκει στο παρελθόν όλων μας, αλλά και γιατί είναι το καλύτερο εχέγγυο για το μέλλον! Και «Ευρωπαϊκή εκπαίδευση» γιατί τα παιδιά μας είναι ευρωπαίοι πολίτες μιας παγκόσμιας πλέον κοινωνίας. Πρέπει να έχουν γνώσεις και δεξιότητες, ισχυρό χαρακτήρα και ολοκληρωμένη προσωπικότητα, για να εξελιχθούν και να προοδεύσουν.
            
            Βασικές αρχές
            
            Πιστεύουμε ότι:
            
            1) Το σχολείο οφείλει να μορφώνει ουσιαστικά τους μαθητές εφαρμόζοντας ένα ολοκληρωμένο πρόγραμμα σπουδών που να ανταποκρίνεται στις αυξημένες απαιτήσεις των καιρών.
            
            2) Μόνο η αγάπη για το σχολείο και η θετική στάση απέναντι στη μάθηση οδηγούν σε επιτυχημένη σχολική πορεία.
            
            3) Το καλό σχολείο πρέπει να ασχολείται συστηματικά με την διαπαιδαγώγηση των μαθητών και την ολόπλευρη ανάπτυξη της προσωπικότητάς τους.
            
            4)  Η πορεία ενός επιτυχημένου και ευτυχισμένου ανθρώπου ξεκινά από πολύ νωρίς στη ζωή του και εξαρτάται από πολλούς παράγοντες. Στη Σχολή Καραβάνα θέλουμε άριστους μαθητές αλλά και επιτυχημένους και ευτυχισμένους ενήλικες. Το πρόγραμμα του σχολείου είναι δομημένο κατά τέτοιο τρόπο ώστε οι απόφοιτοί του να είναι προετοιμασμένοι για τον ανταγωνισμό που θα συναντήσουν σε όλα τα επίπεδα – επαγγελματικά και κοινωνικά. Ασχολούμαστε με τον κάθε μαθητή χωριστά, φροντίζοντας για τις ανάγκες του και ενισχύοντας τις ιδιαίτερες ικανότητες και τα ταλέντα του. Αυτά άλλωστε μας κάνουν να ξεχωρίζουμε από τα άλλα ιδιωτικά σχολεία.
            
             ',
            'background' => $background,
        ]);

        Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/sxoliKaravana/');
        Scholio::portalSocial($school1, 'google', 'https://www.google.gr/maps/place/%CE%A3%CF%87%CE%BF%CE%BB%CE%AE+%CE%9A%CE%B1%CF%81%CE%B1%CE%B2%CE%AC%CE%BD%CE%B1+Sxoli+Karavana/@39.6017731,22.4220863,17z/data=!3m1!4b1!4m5!3m4!1s0x13588f5990d147d9:0xaaca83719f10cc92!8m2!3d39.601769!4d22.424275');
        Scholio::portalSocial($school1, 'twitter', '');
        Scholio::portalSocial($school1, 'youtube', 'https://www.youtube.com/user/sxolh5');
        Scholio::portalSocial($school1, 'linkedin', '');
        Scholio::portalSocial($school1, 'skype', '');
       // παιδικός σταθμός - νηπιαγωγείο - δημοτικό - γυμνάσιο



        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Αθηνά', 'email' => 'athina-sch@otenet.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => '6o χλμ Τρικάλων-Καλαμπάκας',
            'city' => 'Τρίκαλα',
            'phone' => 24310 88600-1
            'type_id' => 6,
            'website' => 'http://www.athina-sch.gr',
            'approved' => 1,
            'about' => 'Τα εκπαιδευτήρια "Αθηνά" αποτελούν έναν ολοκληρωμένο Εκπαιδευτικό Οργανισμό, ο οποίος παρέχει γενική παιδεία υψηλού επιπέδου και προετοιμάζει τους μαθητές να ανταποκριθούν στις σύγχρονες απαιτήσεις της ζωής και της νέας εποχής που διαμορφώνεται. Μιας εποχής που απαιτεί ουσιαστική πνευματική καλλιέργεια, σύγχρονες γνώσεις, ηθική συγκρότηση, πολύπλευρη και δημιουργική προσωπικότητα. Με αυτό το μήνυμα τα Εκπαιδευτήρια "Αθηνά" φιλοδοξούν να διαμορφώσουν τον πολίτη του 21ου αιώνα που θα έχει αφομοιώσει τις αξίες του Ελληνικού πολιτισμού, θα ανταποκρίνεται στις απαιτήσεις μιας παγκοσμιοποιημένης κοινωνίας και θα οραματίζεται ένα δημιουργικό μέλλον.
            
            Πιστεύοντας βαθιά στην παιδευτική λειτουργία της Εκπαίδευσης, έχουν θέσει ως αποστολή τους τη διαμόρφωση ανθρώπων με άρτια πνευματική συγκρότηση, υψηλό ήθος και υποδειγματική υπευθυνότητα. Ανθρώπων ικανών να ανταποκριθούν στις απαιτήσεις και τις προκλήσεις της σύγχρονης εποχής και οι οποίοι θα ενταχθούν στο κοινωνικό σύνολο ως δημιουργικά μέλη και ενεργοί πολίτες.
            
            Αυτήν την υψηλή τους αποστολή τα Εκπαιδευτήρια υπηρετούν με εκπαιδευτικό προσωπικό υψηλής επιστημονικής και παιδαγωγικής κατάρτισης, τέλειες εγκαταστάσεις, άριστη οργάνωση και με ένα διευρυμένο, σύγχρονο και ποιοτικό πρόγραμμα σπουδών το οποίο προσδιορίζεται από τους ακόλουθους στόχους:
            
            τη μετάδοση ανθρωπιστικών αξιών, αρχών και ιδανικών
            τη διεύρυνση του πνευματικού ορίζοντα των μαθητών και κυρίως την ανάπτυξη της κριτικής και δημιουργικής σκέψης
            την άριστη γνωστική κατάρτιση των μαθητών που θα τους επιτρέψει την απρόσκοπτη συνέχιση των σπουδών τους στην Τριτοβάθμια Εκπαίδευση
            το σεβασμό της Εθνικής μας Κληρονομιάς και Παράδοσης
            την αγάπη για τη φύση και την ευαισθητοποίηση σε θέματα προστασίας του περιβάλλοντος
            τη γόνιμη γνωριμία με την Τέχνη, την Επιστήμη και την Τεχνολογία
            την ενθάρρυνση της σωστής σωματικής άσκησης και της αγάπης για τον αθλητισμό
            την προετοιμασία των μαθητών ως πολιτών της Ελλάδας, της Ευρώπης και του Κόσμου',
            'background' => $background,
           
            Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/athinasch.gr');
            Scholio::portalSocial($school1, 'google',''
            Scholio::portalSocial($school1, 'twitter', '');
            Scholio::portalSocial($school1, 'youtube', ');
            Scholio::portalSocial($school1, 'linkedin', '');
            Scholio::portalSocial($school1, 'skype', '')
        // γυμνάσιο - λύκειο
            ]);

        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια ΑΝΑΓΕΝΝΗΣΗ ΙΚΕ', 'email' => 'info@anagennisiedu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Γηροκομείου 61',
            'city' => 'Πάτρα',
            'phone' => 2610224260,
            'type_id' => 6,
            'website' => 'http://anagennisiedu.gr',
            'approved' => 1,
            'about' => 'Είμαστε μια ομάδα εκπαιδευτικών, που βασιζόμενοι στην αγάπη μας για την Εκπαίδευση, δημιουργήσαμε στην Πάτρα τα Εκπαιδευτήρια «Αναγέννηση». Κεφάλαιό μας η αγάπη για τη μάθηση και το μαθητή και ισχυρό μας εφόδιο η  πολυετής εμπειρία μας στο χώρο της    ιδιωτικής εκπαίδευσης.

            Όραμά μας…
            « Ένα σχολείο που θεωρεί τον κάθε   μαθητή ξεχωριστό, μια προσωπικότητα μοναδική με τις ευαισθησίες, τις ιδιαιτερότητες, τις ανησυχίες, τα όνειρα και τις φιλοδοξίες του, τα προβλήματα και τους προβληματισμούς του.
            
            Ένα σχολείο που προσφέρει ένα περιβάλλον αγάπης, ασφάλειας και αποδοχής, στο οποίο ο καθένας έχει τη θέση του και τη συμπαράσταση που χρειάζεται, για να αποκτήσει αυτοεκτίμηση, να ανακαλύψει και να αξιοποιήσει τις ικανότητες και τις κλίσεις του.
            
            Ένα σχολείο που αξιοποιεί την πλούσια παράδοση του τόπου μας στην προσπάθειά του να διαμορφώσει ενεργούς πολίτες με ανεπτυγμένη κοινωνική συνείδηση»',
            'background' => $background,
        ]);
        Scholio::portalSocial($school1, 'facebook', 'http://www.facebook.com/sharer.php?u=http://anagennisiedu.gr/poioi-eimaste/');
            Scholio::portalSocial($school1, 'google', 'https://plus.google.com/share?url=http://anagennisiedu.gr/poioi-eimaste/'
            Scholio::portalSocial($school1, 'twitter', 'http://twitter.com/share?url=http://anagennisiedu.gr/poioi-eimaste/&text=%CE%A0%CE%9F%CE%99%CE%9F%CE%99%20%CE%95%CE%99%CE%9C%CE%91%CE%A3%CE%A4%CE%95%20');
            Scholio::portalSocial($school1, 'youtube', ');
            Scholio::portalSocial($school1, 'linkedin', '');
            Scholio::portalSocial($school1, 'skype', '')
           // νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο



        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήριο ΤΟ ΠΑΓΚΡΗΤΙΟΝ', 'email' => 'dimotiko@pagkritio.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Οδός Πανδάρεω 61, Φιλοθέη - Αγ. Ιωάννης',
            'city' => 'Ηράκλειο',
            'phone' => 2810 230379,
            'type_id' => 6,
            'website' => 'http://www.pagkritio.gr',
            'approved' => 1,
            'about' => 'Το Εκπαιδευτήριο “ΤΟ ΠΑΓΚΡΗΤΙΟΝ” ιδρύθηκε το 1963 μέσα σε πνεύμα δημιουργίας και ανανέωσης. «Η παιδεία οφείλει να ξεφύγει από τη συντηρητικότητα και να μπει περισσότερο στη γνώση της ζωής και στον αγώνα για μια σωστή ελευθερία του πνεύματος», έγραφε τότε το πρώτο ιστορικό φυλλάδιο γνωριμίας του σχολείου.  Με αφετηρία  αυτές τις σταθερές αρχές, η πορεία του υπήρξε σταθερή και ανοδική. Σήμερα, όλες οι βαθμίδες εκπαίδευσης, Παιδικός Σταθμός, Νηπιαγωγείο, Δημοτικό, Γυμνάσιο, Λύκειο, στελεχώνονται από έμπειρους, καταρτισμένους εκπαιδευτικούς, που αγαπούν τη δουλειά τους και το παιδί. Με τον άρτιο συντονισμό των διδασκόντων, τη διαρκή επιμόρφωσή τους για τον εκσυγχρονισμό των διδακτικών μέσων και την καθημερινή  συνεργασία τους με μαθητές και γονείς, το μάθημα είναι πάντα δημιουργικό και ο ρυθμός δουλειάς αποδοτικός. Παράλληλα, οι πολύπλευρες καλλιτεχνικές και πνευματικές δραστηριότητες του, κάνουν το Εκπαιδευτήριο “ΤΟ ΠΑΓΚΡΗΤΙΟΝ”  να λειτουργεί σαν ένας ζωντανός πυρήνας για την Τέχνη και τον Πολιτισμό στην πόλη του Ηρακλείου.

            Πέρα από την εγρήγορση για υψηλού επιπέδου καθημερινή δουλειά και για επιτυχίες στα ανώτατα εκπαιδευτικά ιδρύματα, το Εκπαιδευτήριο σήμερα προσφέρει πολλά παραπάνω. Σε κάθε βαθμίδα αναπτύσσονται πολύπλευρες δραστηριότητες και λειτουργούν ποικίλοι κύκλοι ενδιαφερόντων για την ελεύθερη έκφραση της προσωπικότητας του μαθητή: σχολική ορχήστρα, θεατρική ομάδα, κύκλος εικαστικών και ζωγραφικής, κύκλος φωτογραφίας, κύκλος σχεδίασης ιστοσελίδων στο Διαδίκτυο, ομάδα περιβάλλοντος, ομάδα δημοσιογραφίας. Μέσα από τη δουλειά αυτών των κύκλων, οι μαθητές πάντα δημιουργούν. Όπως η ομάδα δημοσιογραφίας, που εδώ και 25 χρόνια, εκδίδει το ιστορικό πια περιοδικό "Έκφραση και Ενημέρωση" για τη ζωή και τη δραστηριότητα του σχολείου ή την μαθητική έκδοση "Μας πήραν είδηση". Παράλληλα, το Λύκειο εκδίδει τη δική του εφημερίδα με το όνομα "Νεανικές Φωνές", το Γυμνάσιο εκδίδει τη μηνιαία εφημερίδα "Μέρες Σχολέίου" που αποτυπώνει τη ζωή και τις δραστηριότητες της βαθμίδας, ενώ τα μικρά παιδιά του Δημοτικού την "Πένα", έκδοση που το Μάιο του 2010 απέσπασε το βραβείο Καλύτερης Εφημερίδας στον 17ο Πανελλήνιο Διαγωνισμό Μαθητικών Εντύπων της Εφημερίδας "ΤΑ ΝΕΑ".
            
            Δημιουργική δουλειά και μεγάλες επιτυχίες έχει δώσει και η θεατρική ομάδα του Παγκρητίου. Κορυφαίες στιγμές της, θεατρικές παραστάσεις που αγαπήθηκαν και βραβεύτηκαν σε πανελλήνιο επίπεδο, όπως ο "Ήλιος Ηλιάτορας" του Οδυσσέα Ελύτη, "Το τραγούδι του Νεκρού Αδερφού" και οι "Ελεύθεροι Πολιορκοιμένοι" του Διονυσίου Σολωμού.
            
            Σήμερα στο εκπαιδευτήριο λειτουργούν και πολλές απογευματινές, προαιρετικές δραστηριότητες:
            
            τμήματα απογευματινής μελέτης για παιδιά Δημοτικού
            μουσική σχολή με τμήματα κλασσικών, μοντέρνων και παραδοσιακών μουσικών σπουδών για παιδιά Δημοτικού και Γυμνασίου
            τμήματα για τα πιστοποιημένα διπλώματα πληροφορικής CAMBRIDGE και MOS 
            απογευματινά προγράμματα Αγγλικών για μαθητές Γυμνασίου που θέλουν να οδηγηθούν  συντομότερα στα διπλώματα Cambridge FCE και κρατικό πιστοποιητικό γλωσσομάθειας',
            'background' => $background,

            Scholio::portalSocial($school1, 'facebook');
            Scholio::portalSocial($school1, 'google', '
            Scholio::portalSocial($school1, 'twitter', '');
            Scholio::portalSocial($school1, 'youtube', ');
            Scholio::portalSocial($school1, 'linkedin', '');
            Scholio::portalSocial($school1, 'skype', '')
         // παιδικός σταθμός - νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο




        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Κωστέα - Γείτονα CGS', 'email' => 'info@cgs.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'ΠΑΛΛΗΝΗ ΑΤΤΙΚΗΣ  Τ.Κ. 15351',
            'city' => 'Αθήνα',
            'phone' => 2106030411,
            'type_id' => 6,
            'website' => 'https://cgs.gr/',
            'approved' => 1,
            'about' => 'Τα Εκπαιδευτήρια Κωστέα-Γετονα, διανύοντας την πέμπτη δεκαετία τους ως ένας από τους σημαντικότερους εκπαιδευτικούς οργανισμούς στη χώρα μας, επαναπροσδιορίζονται ως CGS.
            Κρατάμε ακέραιες τις στέρεες βάσεις πάνω στις οποίες στηριχτήκαμε όλα αυτά τα χρόνια και προβάλλουμε τη δυναμική και αναπτυξιακή μας πορεία με τη νέα μας ταυτότητα. Το CGS παραμένει ένα ελληνικό σχολείο με διεθνή προοπτική, με στόχο να εκπαιδεύσει τους μελλοντικούς ενεργούς πολίτες του κόσμου.',
            'background' => $background,
        ]);
Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/cgs.gr/?pnref=lhc');
            Scholio::portalSocial($school1, 'instagram', 'https://www.instagram.com/cgs_school/'
            Scholio::portalSocial($school1, 'twitter', '');
            Scholio::portalSocial($school1, 'youtube','https://www.youtube.com/channel/UCn4pw8HK0w63l5dvFVK9UmA');
            Scholio::portalSocial($school1, 'linkedin', 'https://www.linkedin.com/company/18204073/');
            Scholio::portalSocial($school1, 'skype', '')
         // παιδικός σταθμός - νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο



        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Αυγουλέα - Λιναρδάτου', 'email' => 'info@avgouleaschool.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Αρκαδίου 63 - 65 & Λυκούργου, 12132, Περιστέρι',
            'city' => 'Αθήνα',
            'phone' => 2115002300,
            'type_id' => 6,
            'website' => 'http://www.avgouleaschool.gr/',
            'approved' => 1,
            'about' => 'Σας καλωσορίζουμε στον δικτυακό τόπο των Εκπαιδευτηρίων Σ. Αυγουλέα - Λιναρδάτου. Βρίσκεστε σε ένα χώρο με υλικό και πληροφορίες για την εξηνταεφτάχρονη ιστορία της Σχολής μας, τις υλικοτεχνικές της υποδομές, τις κτιριακές της εγκαταστάσεις, τα πρότυπα ποιότητας που εφαρμόζει, τα εκπαιδευτικά προγράμματα που εκπονεί, τις καινοτόμες δράσεις που υλοποιεί, τις αθλητικές δραστηριότητες που προσφέρει, τις πολιτιστικές εκδηλώσεις που διοργανώνει, τις σχολικές εκδόσεις που διανέμει, το ικανό και έμπειρο εκπαιδευτικό δυναμικό που απασχολεί και τα εξαιρετικά αποτελέσματα των μαθητών της σε όλους τους τομείς.
            Περιηγούμενοι στον ιστοχώρο μας, θα γνωρίσετε την οργάνωση, δομή και λειτουργία του Παιδικού Σταθμού, του Νηπιαγωγείου, του Δημοτικού, του Γυμνασίου και του Λυκείου μας και θα ανακαλύψετε την εκπαιδευτική μας φιλοσοφία και τα παιδαγωγικά μας «πιστεύω».
            Η περιήγηση στον δικτυακό μας χώρο παρέχει σίγουρα πολλές κι ενδιαφέρουσες πληροφορίες, αλλά όχι όλες. Θα χαρούμε να έρθετε κοντά μας, να συζητήσουμε και να σας παρουσιάσουμε διά ζώσης το ολοκληρωμένο εκπαιδευτικό πρόγραμμα του Σχολείου μας και τη δυναμική, πολυεπίπεδη μόρφωση που μπορεί να προσφέρει στο παιδί σας.
            Ωστόσο, ως πρώτη επαφή και εφόσον το επιθυμείτε, μπορείτε να συμπληρώσετε τη φόρμα επικοινωνίας για να σας αποστείλουμε περισσότερες ή ειδικές πληροφορίες μέσω του ηλεκτρονικού ταχυδρομείου (e-mail).
            
            ',
            'background' => $background,
        ]);

        Scholio::portalSocial($school1, 'facebook', 'http://www.facebook.com/avgoulea.gr');
            Scholio::portalSocial($school1, 'instagram', 'http://instagram.com/avgouleaschool?ref=badge'
            Scholio::portalSocial($school1, 'twitter', '');
            Scholio::portalSocial($school1, 'youtube', 'http://youtube.com/avgouleaschool'
            Scholio::portalSocial($school1, 'linkedin', '');
            Scholio::portalSocial($school1, 'skype', '')
        // αθλητικό κέντρο - παιδικός σταθμός - νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο

        
        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Γεωργίου Ζώη', 'email' => ' info@zois-school.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Αβέρωφ 12-14, 16452 Αργυρούπολη',
            'city' => 'Αθήνα',
            'phone' => 2109617817,
            'type_id' => 6,
            'website' => 'http://www.zois-school.gr/',
            'approved' => 1,
            'about' => 'Χαρτογραφώντας μέσα σε λίγες γραμμές την εκπαιδευτική φιλοσοφία των ΕΚΠΑΙΔΕΥΤΗΡΙΩΝ ΓΕΩΡΓΙΟΥ ΖΩΗ, επισημαίνουμε τα εξής:

            Βασική παιδαγωγική αρχή για τα Εκπαιδευτήριά μας είναι: τα πάντα για τους μαθητές μας, που μας χαρίζουν την ευτυχία «χωρίς ζύγι». Προσφορά αφειδώλευτη σ’ όλα τα παιδιά, γιατί στα μάτια όλων των παιδιών τρέχει ανόθευτο το αγίασμα που το λένε μέλλον, που το λένε φως, που το λένε ελπίδα.
            Καλό σχολείο για μας είναι το χαρούμενο σχολείο, το σχολείο στο οποίο τα παιδιά πηγαίνουν με χαρά και επιστρέφουν στο σπίτι με μεγαλύτερη χαρά. Το σχολείο στο οποίο η κάθε μέρα είναι γιορτή, γιορτή γνώσης, γιορτή σχολικής ζωής.
            Σύγχρονο σχολείο θεωρούμε το σχολείο που είναι απαλλαγμένο από άχρηστα, περιττά και αναχρονιστικά στοιχεία, που είναι ανοικτό στις ιδέες και στην κοινωνία, στη γνώση και στο μέλλον, και που αξιοποιεί κάθε σύγχρονο εργαλείο (διαδραστικό πίνακα, ψηφιακό εκπαιδευτικό υλικό) με το οποίο διευρύνονται οι ορίζοντες κάθε μαθητή και μαθήτριας, καταργούνται τα σύνορα της γνώσης και διευκολύνεται η επικοινωνία με τον εκπαιδευτικό.
            Ευθύνη των εκπαιδευτικών μας είναι να προσπαθούν καθημερινά για τη δημιουργία ενός πράσινου σχολείου, το οποίο καλλιεργεί στον μαθητή την περιβαλλοντική συνείδηση, προκειμένου να εξοικονομείται ενέργεια, να διατρέφεται υγιεινά και να σέβεται το περιβάλλον.
            Για μας η παιδεία είναι «ανθρωποποιία» (Μέγας Αντώνιος) και επιτυγχάνεται αν συνδέεται άρρηκτα με την παράδοσή μας, πυρήνας της οποίας είναι το ήθος της ορθοδοξίας.
            Θέλουμε τους εκπαιδευτικούς μας να είναι δάσκαλοι και λειτουργοί και όχι «παράγοντες» με υπαλληλική νοοτροπία, που περισσότερο διεκδικούν παρά διακονούν. Θέλουμε εκπαιδευτικούς που σέβονται την προσωπικότητα κάθε μαθητή, έχουν θετικές προσδοκίες για όλα τα παιδιά, καλή επικοινωνία μαζί τους, καθώς και μέτρο στη συμπεριφορά, διατηρώντας έτσι ισορροπία ανάμεσα στο χιούμορ και στην αυστηρότητα.
            Ρόλος ενός σύγχρονου εκπαιδευτικού οργανισμού είναι για μας να οδηγήσει τα παιδιά «να μάθουν πώς να μαθαίνουν» και πώς να προσαρμόζονται σ’ έναν κόσμο που μεταλλάσσεται ραγδαία, ώστε, διατηρώντας τον ελληνοκεντρικό του χαρακτήρα, να έχει παράλληλα το βλέμμα του στραμμένο στην Ευρώπη και στον κόσμο ολόκληρο, για να μπορέσει να εξοπλίσει γνωσιολογικά τον Έλληνα Ευρωπαίο, τον Έλληνα Πολίτη της Οικουμένης.
            Σωστό σχολείο θεωρούμε το σχολείο εκείνο που αξιοποιεί και τις κινητικές ικανότητες και κλίσεις όλων των μαθητών μέσα από αθλητικές δραστηριότητες, ώστε να αποκτούν συνήθειες οι οποίες αναβαθμίζουν την ποιότητα της ζωής τους. Στα ΕΚΠΑΙΔΕΥΤΗΡΙΑ ΓΕΩΡΓΙΟΥ ΖΩΗ έχουμε από νωρίς καταλάβει ότι η συμμετοχή στην άθληση σημαίνει συμμετοχή στη ζωή.
            «Εν κατακλείδι» για τα ΕΚΠΑΙΔΕΥΤΗΡΙΑ ΓΕΩΡΓΙΟΥ ΖΩΗ η παιδεία οφείλει κυρίως να δίνει σταθερά σημεία προσανατολισμού, δοκιμασμένες αξίες και καταξιωμένα ιδεώδη ως βάση του ζην, του συζήν και του ευζην.',
            'background' => $background,
        ]);
        Scholio::portalSocial($school1, 'facebook', 'http://www.facebook.com/pages/%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%93%CE%B5%CF%89%CF%81%CE%B3%CE%AF%CE%BF%CF%85-%CE%96%CF%8E%CE%B7/199217543485682');
            Scholio::portalSocial($school1, 'google', '
            Scholio::portalSocial($school1, 'twitter', 'http://twitter.com/ZoisSchool');
            Scholio::portalSocial($school1, 'youtube', 'http://www.youtube.com/user/zoisschool'
            Scholio::portalSocial($school1, 'linkedin', '');
            Scholio::portalSocial($school1, 'skype', '')
        // βρεφικός σταθμός - παιδικός σταθμός - νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο


        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φιλεκπαιδευτική Εταιρεία Αερσάκεια - Τοσιτσεία Σχολεία', 'email' => 'info@arsakeio.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Κοκκώνη 18 / Π. Ψυχικό 154 52',
            'city' => 'Αθήνα',
            'phone' => 210 6755555,
            'type_id' => 6,
            'website' => 'http://www.arsakeio.gr/',
            'approved' => 1,
            'about' => 'Τα Αρσάκεια - Τοσίτσεια Σχολεία είναι συγκροτήματα σχολικών μονάδων πρωτοβάθμιας και δευτεροβάθμιας εκπαίδευσης, τα οποία ανήκουν στην Φιλεκπαιδευτική Εταιρεία (ΦΕ). Εδρεύουν στην Αθήνα, Παλαιό Ψυχικό και Εκάλη, Πάτρα, Θεσσαλονίκη, Ιωάννινα και Τίρανα (Αλβανία).',
            'background' => $background,
        ]);

        Scholio::portalSocial($school1, 'facebook', '');
            Scholio::portalSocial($school1, 'google', '
            Scholio::portalSocial($school1, 'twitter', '');
            Scholio::portalSocial($school1, 'youtube', ');
            Scholio::portalSocial($school1, 'linkedin', '');
            Scholio::portalSocial($school1, 'skype', '')
         // νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο


        $school1 = factory(App\Models\School::class)->create([
                        'user_id' => factory(App\User::class)->create(['name' => 'Νέα Γενιά Ζηρίδη', 'email' => 'info@ziridis.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'ΧΡΙΣΤΟΥΠΟΛΗ, ΣΠΑΤΑ, ΤΚ: 19004',
            'city' => ''Αθήνα,
            'phone' => 2106685600,
            'type_id' => 6,
            'website' => 'http://www.ziridis.gr',
            'approved' => 1,
            'about' => 'Αναζητήστε σχολεία με ιστορία, με παράδοση, με αρχές, με αξίες, με οικογενειακή ιστορία. Ανθρώπινα σχολεία. Ελληνικά σχολεία.

            Αναζητήστε μία θετική, παιδαγωγική ατμόσφαιρα. Ανθρώπους που νοιάζονται. Ανθρώπους που έχουν τυπικά και ουσιαστικά προσόντα.
            
            Αναζητήστε μεταπτυχιακά, διδακτορικά, ψάξτε για ανθρώπους που έχουν φλόγα στην καρδιά και ενθουσιασμό και αφοσίωση στο έργο τους, που αγαπούν αυτό που κάνουν.
            
            Αναζητήστε ένα ασφαλές, οικογενειακό, στοργικό κλίμα. Ένα περιβάλλον, που από μόνο του δημιουργεί ερεθίσματα, γιατί στα πρώτα χρόνια είναι που διαμορφώνεται η αντίληψη του ποιοτικού.
            
            Είναι οι άνθρωποι που γνωρίζουν τα ταλέντα τους, τα χαρίσματά τους και τη μοναδικότητά τους.
            
            Είναι οι άνθρωποι που έχουν ωριμάσει φυσικά, κοινωνικά, συναισθηματικά, διανοητικά και πνευματικά μέσα σ’ ένα θετικό περιβάλλον.
            
            Είναι οι άνθρωποι που είναι εξοπλισμένοι με όλες τις δεξιότητες και τα εφόδια που χρειάζεται η ζωή.
            
            «Γι’ αυτό, μην μου λες σε ποιο Πανεπιστήμιο πήγες, πες μου σε ποιο σχολείο ήσουνα.»
            
            ',
            'background' => $background,
        ]);Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/ziridis/');
            Scholio::portalSocial($school1, 'instagram', 'https://www.instagram.com/ziridis/'
            Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/neageniaziridis');
            Scholio::portalSocial($school1, 'youtube', 'https://www.youtube.com/user/ziridistv'
            Scholio::portalSocial($school1, 'linkedin', '');
            Scholio::portalSocial($school1, 'skype', '')
         //νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο


        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ελληνοαμερικανικόν Εκπαιδευτικόν Ίδρυμα, Κολλέγιο Αθηνών - Κολλέγιο Ψυχικού ', 'email' => 'info[at]haef.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Στεφάνου Δέλτα 15, 154 52', Ψυχικό
            'city' => 'Αθήνα',
            'phone' => 2106798100,
            'type_id' => 6,
            'website' => 'https://www.haef.gr/',
            'approved' => 1,
            'about' => '"Αποστολή του ΕΕΙ είναι να προσφέρει παιδεία ανωτάτου επιπέδου -με διεθνή κριτήρια- και να καλλιεργεί στους μαθητές του εκείνες τις ικανότητες της ψυχής, του σώματος και του πνεύματος που είναι αναγκαίες για κάθε υπεύθυνο πολίτη".',
            'background' => $background,
        ]);Scholio::portalSocial($school1, 'facebook', 'https://www.haef.gr/-/media/Images/HAEF/Icons/fb.ashx?h=16&la=el&w=16');
            Scholio::portalSocial($school1, 'google', '
            Scholio::portalSocial($school1, 'twitter', 'https://www.haef.gr/-/media/Images/HAEF/Icons/tw.ashx?h=16&la=el&w=16');
            Scholio::portalSocial($school1, 'youtube', ');
            Scholio::portalSocial($school1, 'linkedin', '');
            Scholio::portalSocial($school1, 'skype', '')
         // δημοτικό - γυμνάσιο - λύκειο 


        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Δούκα', 'email' => 'info@doukas.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Μεσογείων 151, 151 26, Μαρούσι            ',
            'city' => ''Αθήνα,
            'phone' => 2106186000 ,
            'type_id' => 6,
            'website' => 'http://www.doukas.gr/',
            'approved' => 1,
            'about' => '> Εκπαιδεύουμε παγκόσμιους πολίτες με Ελληνική ταυτότητα & ικανότητες 21ου αιώνα
            Πιστεύουμε στην ισορροπία ανάμεσα στην Παράδοση και την Πρόοδο. Σκοπός μας είναι να βελτιώνουμε διαρκώς την ποιότητα των υπηρεσιών μας και να ξεπερνάμε τις ανάγκες και τις προσδοκίες των μαθητών μας, των γονέων τους καθώς και της ευρύτερης κοινωνίας.
            Στόχος μας είναι να εκπαιδεύουμε Παγκόσμιους Πολίτες με Ελληνική Ταυτότητα, εφοδιάζοντάς τους με Ικανότητες του 21ου αιώνα, δείχνοντας ταυτόχρονα σεβασμό στη μοναδικότητα του κάθε παιδιού.',
            'background' => $background,
        ]);Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/DoukaSchool');
            Scholio::portalSocial($school1, 'instagram', 'https://instagram.com/doukas_school/'
            Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/Doukas_School');
            Scholio::portalSocial($school1, 'youtube', ');
            Scholio::portalSocial($school1, 'linkedin', '');
            Scholio::portalSocial($school1, 'skype', '')
         // νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο


        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Πρότυπα Εκπαιδευτήρια Θεσσαλονίκης', 'email' => 'info@protypa.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Ελαιώνες Πυλαίας Τ.Κ. 555 36',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310300002,
            'type_id' => 6,
            'website' => 'https://www.protypa.gr/frontend/index.php',
            'approved' => 1,
            'about' => 'Τα Πρότυπα Εκπαιδευτήρια Θεσσαλονίκης με μια δημιουργική πορεία 40 ετών είναι μια πλήρης μονάδα. Ειδικεύεται στην πρωτοβάθμια εκπαίδευση στην οποία και επικεντρώνεται γνωρίζοντας τη δομική σημασία στη μετέπειτα πορεία των μαθητών. Ως αναγνώριση και επιβεβαίωση του υψηλού επιπέδου σπουδών μας, επισημαίνουμε ότι οι απόφοιτοι των Εκπαιδευτηρίων μας κατέχουν τις πρώτες θέσεις στις εισαγωγικές εξετάσεις κολεγίων, καθώς και τις υψηλότερες βαθμολογίες στα ιδιωτικά και δημόσια Γυμνάσια και Λύκεια της πόλης μας.',
            'background' => $background,
        ]);


Scholio::portalSocial($school1, 'facebook', 'http://www.facebook.com/pages/Thessaloniki-Greece/Protypa-Ekpaideuteria-Thessalonikes/170518156295078');
            Scholio::portalSocial($school1, 'google', 'https://plus.google.com/117536093537987040966/'
            Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/protypa_gr'
            Scholio::portalSocial($school1, 'youtube', 'http://www.youtube.com/user/protypa'
            Scholio::portalSocial($school1, 'linkedin', '');
            Scholio::portalSocial($school1, 'skype', '')
         // παιδικός σταθμός - νηπιαγωγείο - δημοτικό



            $school1 = factory(App\Models\School::class)->create([
                'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Μαντουλίδη', 'email' => 'primary@mandoulides.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
                'address' => '6ο χλμ. Οδού Χαριλάου - Θέρμης',
                'city' => 'Θέρμη,Θεσσαλονίκη',
                'phone' => 2310473813,
                'type_id' => 6,
                'website' => 'https://mandoulides.edu.gr/',
                'approved' => 1,
                'about' => 'Τα Εκπαιδευτήρια αποτελούν σήμερα μια σύγχρονη και δυναμική κοινότητα παιδείας, πολιτισμού και αθλητισμού, αναγνωρισμένη σε όλη την Ελλάδα.

                Τα Εκπαιδευτήρια περιλαμβάνουν:
                Παιδικό Σταθμό, Νηπιαγωγείο, Δημοτικό, Γυμνάσιο, Λύκειο, κέντρο συμβουλευτικής και τμήματα προετοιμασίας για σπουδές στο εξωτερικό.
                
                ',
                'background' => $background,
            ]);
    
    
    Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/mandoulides'
                Scholio::portalSocial($school1, 'instagram', 'https://www.instagram.com/mandoulides_schools/'
                Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/Mandoulides'
                Scholio::portalSocial($school1, 'youtube', 'http://www.youtube.com/user/mandoulidesschools'
                Scholio::portalSocial($school1, 'linkedin', 'https://www.linkedin.com/company/mandoulides'
                Scholio::portalSocial($school1, 'skype', '')
             // παιδικός σταθμός - νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο




                $school1 = factory(App\Models\School::class)->create([
                    'user_id' => factory(App\User::class)->create(['name' => 'Ανατόλια / The American College of Thessaloniki (ACT)', 'email' => 'acagyreg@anatolia.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
                    'address' => '555 10 Πυλαία',
                    'city' => 'Θεσσαλονίκη',
                    'phone' => 2310398357,
                    'type_id' => 6,
                    'website' => 'http://www.anatolia.edu.gr/cms.jsp?extLang=',
                    'approved' => 1,
                    'about' => 'Στόχος μας είναι να εμφυσήσουμε στους μαθητές μας τη φιλοδοξία και να τους δώσουμε όλα τα απαραίτητα εφόδια να γίνουν πολίτες του κόσμου, υπεύθυνοι και με αρχές, αλλά και κριτικά σκεπτόμενα άτομα με ανοιχτό πνεύμα που αναζητούν με ενεργό τρόπο τη γνώση σε όλη τη διάρκεια της ζωής τους.
                     Όραμά μας είναι να εδραιώσουμε το Ανατόλια ως την πρώτη επιλογή για κάθε ικανό μαθητή και μαθήτρια ανεξαρτήτως οικονομικής δυνατότητας, ως ένα σχολείο-πρότυπο στον τομέα της διαρκούς ανάπτυξης και εφαρμογής νέων εκπαιδευτικών πρακτικών, που προσφέρει πολύτιμα εφόδια και αποτελεί καθοριστικό παράγοντα για τη μελλοντική τους επιτυχία στην ακαδημαϊκή, επαγγελματική και προσωπική τους ζωή. ',
                    'background' => $background,
                ]);
        
        
        Scholio::portalSocial($school1, 'facebook', 'http://www.facebook.com/search/?q=anatolia#/pages/Thessaloniki-Greece/Anatolia-College/300380195330?ref=ss'
                    Scholio::portalSocial($school1, 'google', '
                    Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/Anatolia1886'
                    Scholio::portalSocial($school1, 'youtube', 'http://www.youtube.com/anatoliacollege'
                    Scholio::portalSocial($school1, 'linkedin', '');
                    Scholio::portalSocial($school1, 'skype', '')
                // γυμνάσιο - λύκειο




                    $school1 = factory(App\Models\School::class)->create([
                        'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτικός Οργανισμός Ελληνικό Κολλέγιο Θεσσαλονίκης', 'email' => 'hel-col@otenet.gr
                        ', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
                        'address' => 'Δροσιά Θέρμης',
                        'city' => 'Θέρμη, Θεσσαλονίκη',
                        'phone' => 2310473112,
                        'type_id' => 6,
                        'website' => 'http://www.hellenic-college.gr/index.php',
                        'approved' => 1,
                        'about' => 'Σήμερα, το Ελληνικό Κολλέγιο Θεσσαλονίκης, με τη γόνιμη πείρα των 56 ετών από την ίδρυσή του, έχει επιδείξει ένα σύγχρονο και πρωτοποριακό παιδαγωγικό έργο. Το προσεκτικά επιλεγμένο και άριστα καταρτισμένο διδακτικό προσωπικό μας, χρησιμοποιώντας τα σύγχρονα εποπτικά μέσα και τις σύγχρονες μεθόδους παιδαγωγικής διδασκαλίας, σέβεται τα οράματα και την προσωπικότητα του κάθε μαθητή, παρέχοντάς του έτσι, όχι στείρες γνώσεις, αλλά ουσιαστική παιδεία. Έτσι, στο Ελληνικό Κολλέγιο Θεσσαλονίκης, κάθε μαθητής έχει τη δυνατότητα να αξιοποιήσει τις ικανότητές του, να αυτενεργήσει, να εμβαθύνει και να εμπεδώσει τη γνώση, πειθαρχώντας συνειδητά στους κανόνες του σχολείου.
                        Το εκπαιδευτικό πρόγραμμα που εφαρμόζουμε στοχεύει στην πνευματική εγρήγορση, την καλλιέργεια και την ολόπλευρη ανάπτυξη της προσωπικότητας του μαθητή, προκειμένου να αναδειχτεί νικητής στο στίβο της ζωής.
                        Ο πρωταρχικό στόχος του Ελληνικού Κολλεγίου Θεσσαλονίκης είναι η παροχή υψηλού επιπέδου εκπαίδευσης, που εξασφαλίζει ουσιαστική παιδεία και επιτυχημένη μεταλυκειακή σταδιοδρομία.',
                        'background' => $background,
                    ]);
            
            
            Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/HellenicCollegeOfThessaloniki'
                        Scholio::portalSocial($school1, 'pinterest', 'http://www.hellenic-college.gr/organization.php#'
                        Scholio::portalSocial($school1, 'twitter', '');
                        Scholio::portalSocial($school1, 'youtube', 'http://www.youtube.com/user/HellenicCollegeThess'
                        Scholio::portalSocial($school1, 'linkedin', '');
                        Scholio::portalSocial($school1, 'skype', '')
                     // βρεφονηπιακός σταθμός - παιδικός σταθμός - νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο




                        $school1 = factory(App\Models\School::class)->create([
                            'user_id' => factory(App\User::class)->create(['name' => 'Deutsche Schule Thessaloniki - Γερμανική Σχολή Θεσσαλονίκης', 'email' => 'info@dst.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
                            'address' => '9ο χλμ Θεσσαλονίκης – Θέρμης',
                            'city' => 'Θέρμη, Θεσσαλονίκη',
                            'phone' => 2310475900,
                            'type_id' => 6,
                            'website' => 'http://www.dst.gr/?lang=el',
                            'approved' => 1,
                            'about' => 'Η Γερμανική Σχολή Θεσσαλονίκης, έχει ως γερμανικό σχολείο εξωτερικού
                            παράδοση άνω των 120 ετών – τα μαθήματα άρχισαν στις 13 Φεβρουαρίου 1888.
                            Έκτοτε, η Γερμανική Σχολή Θεσσαλονίκης αποτελεί αναπόσπαστο κομμάτι της
                            «Απόδημης Πολιτικής Πολιτισμού και Μόρφωσης» της Γερμανίας, στις
                            διαφορετικές της μορφές: Γερμανική Αυτοκρατορία του Κάιζερ (έως το 1918),
                            Δημοκρατία της Βαϊμάρης (1918-1933), φασιστική Δικτατορία (1933-1945) και
                            τέλος Ομοσπονδιακή Δημοκρατία της Γερμανίας (από το 1949), οι οποίες
                            επηρέασαν κάθε μια με το δικό της τρόπο το μάθημα και την εκπαίδευση στη
                            Γερμανική Σχολή Θεσσαλονίκης, καθώς και τη διαμόρφωση του τρόπου με τον
                            οποίο αντιλαμβάνεται η ελληνική κοινωνία τη σχολή ως ιδιωτικό εκπαιδευτικό
                            ίδρυμα. Σήμερα, η ΓΣΘ, κατέχει μια εξαιρετική φήμη: έχει εδραιωθεί ως ένα από τα
                            καλύτερα ιδιωτικά σχολεία της περιφέρειας και της Ελλάδας γενικότερα. Οι
                            απόφοιτοί της, μετά τις σπουδές τους και την επαγγελματική τους κατάρτιση,
                            καταλαμβάνουν συχνά σημαντικές θέσεις στο κράτος, την οικονομία και την
                            κοινωνία της χώρας. Πολλοί εξ αυτών σπούδασαν στη Γερμανία, ενδυναμώνοντας
                            σημαντικά τους δεσμούς μεταξύ των δύο χωρών.',
                            'background' => $background,
                        ]);
                
                
                Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fwww.dst.gr%2Fdie-schule%2Fdie-geschichte-der-dst%2F%3Flang%3Del'
                            Scholio::portalSocial($school1, 'google', 'https://plus.google.com/share?url=http%3A%2F%2Fwww.dst.gr%2Fdie-schule%2Fdie-geschichte-der-dst%2F%3Flang%3Del'
                            Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/share?text=%CE%97%20%CE%B9%CF%83%CF%84%CE%BF%CF%81%CE%AF%CE%B1%20%CE%BC%CE%B1%CF%82&url=http%3A%2F%2Fwww.dst.gr%2Fdie-schule%2Fdie-geschichte-der-dst%2F%3Flang%3Del'
                            Scholio::portalSocial($school1, 'youtube', ');
                            Scholio::portalSocial($school1, 'skype', '')
                         // νηπιαγωγείο - δημοτικό - γερμανικό τμήμα - ελληνικό τμήμα?>?>