<?php

        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Αυγουλέα - Λιναρδάτου', 'email' => 'info@avgouleaschool.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Αρκαδίου 63 - 65 & Λυκούργου, 12132, Περιστέρι',
            'city' => 'Αθήνα',
            'phone' => 2115002300,
            'type_id' => 6,
            'website' => 'http://www.avgouleaschool.gr/',
            'approved' => 1,
            'about' => 'Σας καλωσορίζουμε στον δικτυακό τόπο των Εκπαιδευτηρίων Σ. Αυγουλέα - Λιναρδάτου. Βρίσκεστε σε ένα χώρο με υλικό και πληροφορίες για την εξηνταεφτάχρονη ιστορία της Σχολής μας, τις υλικοτεχνικές της υποδομές, τις κτιριακές της εγκαταστάσεις, τα πρότυπα ποιότητας που εφαρμόζει, τα εκπαιδευτικά προγράμματα που εκπονεί, τις καινοτόμες δράσεις που υλοποιεί, τις αθλητικές δραστηριότητες που προσφέρει, τις πολιτιστικές εκδηλώσεις που διοργανώνει, τις σχολικές εκδόσεις που διανέμει, το ικανό και έμπειρο εκπαιδευτικό δυναμικό που απασχολεί και τα εξαιρετικά αποτελέσματα των μαθητών της σε όλους τους τομείς.
            Περιηγούμενοι στον ιστοχώρο μας, θα γνωρίσετε την οργάνωση, δομή και λειτουργία του Παιδικού Σταθμού, του Νηπιαγωγείου, του Δημοτικού, του Γυμνασίου και του Λυκείου μας και θα ανακαλύψετε την εκπαιδευτική μας φιλοσοφία και τα παιδαγωγικά μας «πιστεύω».
            Η περιήγηση στον δικτυακό μας χώρο παρέχει σίγουρα πολλές κι ενδιαφέρουσες πληροφορίες, αλλά όχι όλες. Θα χαρούμε να έρθετε κοντά μας, να συζητήσουμε και να σας παρουσιάσουμε διά ζώσης το ολοκληρωμένο εκπαιδευτικό πρόγραμμα του Σχολείου μας και τη δυναμική, πολυεπίπεδη μόρφωση που μπορεί να προσφέρει στο παιδί σας.
            Ωστόσο, ως πρώτη επαφή και εφόσον το επιθυμείτε, μπορείτε να συμπληρώσετε τη φόρμα επικοινωνίας για να σας αποστείλουμε περισσότερες ή ειδικές πληροφορίες μέσω του ηλεκτρονικού ταχυδρομείου (e-mail).
            
            ',
            'background' => $background,
        ]);

        Scholio::portalSocial($school1, 'facebook', 'http://www.facebook.com/avgoulea.gr');
            Scholio::portalSocial($school1, 'instagram', 'http://instagram.com/avgouleaschool?ref=badge');
            Scholio::portalSocial($school1, 'youtube', 'http://youtube.com/avgouleaschool');
        // αθλητικό κέντρο - παιδικός σταθμός - νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο

        
        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Γεωργίου Ζώη', 'email' => ' info@zois-school.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Αβέρωφ 12-14, 16452 Αργυρούπολη',
            'city' => 'Αθήνα',
            'phone' => 2109617817,
            'type_id' => 6,
            'website' => 'http://www.zois-school.gr/',
            'approved' => 1,
            'about' => 'Χαρτογραφώντας μέσα σε λίγες γραμμές την εκπαιδευτική φιλοσοφία των ΕΚΠΑΙΔΕΥΤΗΡΙΩΝ ΓΕΩΡΓΙΟΥ ΖΩΗ, επισημαίνουμε τα εξής:

            Βασική παιδαγωγική αρχή για τα Εκπαιδευτήριά μας είναι: τα πάντα για τους μαθητές μας, που μας χαρίζουν την ευτυχία «χωρίς ζύγι». Προσφορά αφειδώλευτη σ’ όλα τα παιδιά, γιατί στα μάτια όλων των παιδιών τρέχει ανόθευτο το αγίασμα που το λένε μέλλον, που το λένε φως, που το λένε ελπίδα.
            Καλό σχολείο για μας είναι το χαρούμενο σχολείο, το σχολείο στο οποίο τα παιδιά πηγαίνουν με χαρά και επιστρέφουν στο σπίτι με μεγαλύτερη χαρά. Το σχολείο στο οποίο η κάθε μέρα είναι γιορτή, γιορτή γνώσης, γιορτή σχολικής ζωής.
            Σύγχρονο σχολείο θεωρούμε το σχολείο που είναι απαλλαγμένο από άχρηστα, περιττά και αναχρονιστικά στοιχεία, που είναι ανοικτό στις ιδέες και στην κοινωνία, στη γνώση και στο μέλλον, και που αξιοποιεί κάθε σύγχρονο εργαλείο (διαδραστικό πίνακα, ψηφιακό εκπαιδευτικό υλικό) με το οποίο διευρύνονται οι ορίζοντες κάθε μαθητή και μαθήτριας, καταργούνται τα σύνορα της γνώσης και διευκολύνεται η επικοινωνία με τον εκπαιδευτικό.
            Ευθύνη των εκπαιδευτικών μας είναι να προσπαθούν καθημερινά για τη δημιουργία ενός πράσινου σχολείου, το οποίο καλλιεργεί στον μαθητή την περιβαλλοντική συνείδηση, προκειμένου να εξοικονομείται ενέργεια, να διατρέφεται υγιεινά και να σέβεται το περιβάλλον.
            Για μας η παιδεία είναι «ανθρωποποιία» (Μέγας Αντώνιος) και επιτυγχάνεται αν συνδέεται άρρηκτα με την παράδοσή μας, πυρήνας της οποίας είναι το ήθος της ορθοδοξίας.
            Θέλουμε τους εκπαιδευτικούς μας να είναι δάσκαλοι και λειτουργοί και όχι «παράγοντες» με υπαλληλική νοοτροπία, που περισσότερο διεκδικούν παρά διακονούν. Θέλουμε εκπαιδευτικούς που σέβονται την προσωπικότητα κάθε μαθητή, έχουν θετικές προσδοκίες για όλα τα παιδιά, καλή επικοινωνία μαζί τους, καθώς και μέτρο στη συμπεριφορά, διατηρώντας έτσι ισορροπία ανάμεσα στο χιούμορ και στην αυστηρότητα.
            Ρόλος ενός σύγχρονου εκπαιδευτικού οργανισμού είναι για μας να οδηγήσει τα παιδιά «να μάθουν πώς να μαθαίνουν» και πώς να προσαρμόζονται σ’ έναν κόσμο που μεταλλάσσεται ραγδαία, ώστε, διατηρώντας τον ελληνοκεντρικό του χαρακτήρα, να έχει παράλληλα το βλέμμα του στραμμένο στην Ευρώπη και στον κόσμο ολόκληρο, για να μπορέσει να εξοπλίσει γνωσιολογικά τον Έλληνα Ευρωπαίο, τον Έλληνα Πολίτη της Οικουμένης.
            Σωστό σχολείο θεωρούμε το σχολείο εκείνο που αξιοποιεί και τις κινητικές ικανότητες και κλίσεις όλων των μαθητών μέσα από αθλητικές δραστηριότητες, ώστε να αποκτούν συνήθειες οι οποίες αναβαθμίζουν την ποιότητα της ζωής τους. Στα ΕΚΠΑΙΔΕΥΤΗΡΙΑ ΓΕΩΡΓΙΟΥ ΖΩΗ έχουμε από νωρίς καταλάβει ότι η συμμετοχή στην άθληση σημαίνει συμμετοχή στη ζωή.
            «Εν κατακλείδι» για τα ΕΚΠΑΙΔΕΥΤΗΡΙΑ ΓΕΩΡΓΙΟΥ ΖΩΗ η παιδεία οφείλει κυρίως να δίνει σταθερά σημεία προσανατολισμού, δοκιμασμένες αξίες και καταξιωμένα ιδεώδη ως βάση του ζην, του συζήν και του ευζην.',
            'background' => $background,
        ]);
        Scholio::portalSocial($school1, 'facebook', 'http://www.facebook.com/pages/%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%93%CE%B5%CF%89%CF%81%CE%B3%CE%AF%CE%BF%CF%85-%CE%96%CF%8E%CE%B7/199217543485682');
            Scholio::portalSocial($school1, 'google', '
            Scholio::portalSocial($school1, 'twitter', 'http://twitter.com/ZoisSchool');
            Scholio::portalSocial($school1, 'youtube', 'http://www.youtube.com/user/zoisschool'
        // βρεφικός σταθμός - παιδικός σταθμός - νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο


        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Φιλεκπαιδευτική Εταιρεία Αερσάκεια - Τοσιτσεία Σχολεία', 'email' => 'info@arsakeio.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Κοκκώνη 18 / Π. Ψυχικό 154 52',
            'city' => 'Αθήνα',
            'phone' => 210 6755555,
            'type_id' => 6,
            'website' => 'http://www.arsakeio.gr/',
            'approved' => 1,
            'about' => 'Τα Αρσάκεια - Τοσίτσεια Σχολεία είναι συγκροτήματα σχολικών μονάδων πρωτοβάθμιας και δευτεροβάθμιας εκπαίδευσης, τα οποία ανήκουν στην Φιλεκπαιδευτική Εταιρεία (ΦΕ). Εδρεύουν στην Αθήνα, Παλαιό Ψυχικό και Εκάλη, Πάτρα, Θεσσαλονίκη, Ιωάννινα και Τίρανα (Αλβανία).',
            'background' => $background,
        ]);

        Scholio::portalSocial($school1, 'facebook', '');
            Scholio::portalSocial($school1, 'google', '
            Scholio::portalSocial($school1, 'youtube', ');
         // νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο


        $school1 = factory(App\Models\School::class)->create([
                        'user_id' => factory(App\User::class)->create(['name' => 'Νέα Γενιά Ζηρίδη', 'email' => 'info@ziridis.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'ΧΡΙΣΤΟΥΠΟΛΗ, ΣΠΑΤΑ, ΤΚ: 19004',
            'city' => ''Αθήνα,
            'phone' => 2106685600,
            'type_id' => 6,
            'website' => 'http://www.ziridis.gr',
            'approved' => 1,
            'about' => 'Αναζητήστε σχολεία με ιστορία, με παράδοση, με αρχές, με αξίες, με οικογενειακή ιστορία. Ανθρώπινα σχολεία. Ελληνικά σχολεία.

            Αναζητήστε μία θετική, παιδαγωγική ατμόσφαιρα. Ανθρώπους που νοιάζονται. Ανθρώπους που έχουν τυπικά και ουσιαστικά προσόντα.
            
            Αναζητήστε μεταπτυχιακά, διδακτορικά, ψάξτε για ανθρώπους που έχουν φλόγα στην καρδιά και ενθουσιασμό και αφοσίωση στο έργο τους, που αγαπούν αυτό που κάνουν.
            
            Αναζητήστε ένα ασφαλές, οικογενειακό, στοργικό κλίμα. Ένα περιβάλλον, που από μόνο του δημιουργεί ερεθίσματα, γιατί στα πρώτα χρόνια είναι που διαμορφώνεται η αντίληψη του ποιοτικού.
            
            Είναι οι άνθρωποι που γνωρίζουν τα ταλέντα τους, τα χαρίσματά τους και τη μοναδικότητά τους.
            
            Είναι οι άνθρωποι που έχουν ωριμάσει φυσικά, κοινωνικά, συναισθηματικά, διανοητικά και πνευματικά μέσα σ’ ένα θετικό περιβάλλον.
            
            Είναι οι άνθρωποι που είναι εξοπλισμένοι με όλες τις δεξιότητες και τα εφόδια που χρειάζεται η ζωή.
            
            «Γι’ αυτό, μην μου λες σε ποιο Πανεπιστήμιο πήγες, πες μου σε ποιο σχολείο ήσουνα.»
            
            ',
            'background' => $background,
        ]);Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/ziridis/');
            Scholio::portalSocial($school1, 'instagram', 'https://www.instagram.com/ziridis/'
            Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/neageniaziridis');
            Scholio::portalSocial($school1, 'youtube', 'https://www.youtube.com/user/ziridistv'
         //νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο


        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ελληνοαμερικανικόν Εκπαιδευτικόν Ίδρυμα, Κολλέγιο Αθηνών - Κολλέγιο Ψυχικού ', 'email' => 'info[at]haef.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Στεφάνου Δέλτα 15, 154 52', Ψυχικό
            'city' => 'Αθήνα',
            'phone' => 2106798100,
            'type_id' => 6,
            'website' => 'https://www.haef.gr/',
            'approved' => 1,
            'about' => '"Αποστολή του ΕΕΙ είναι να προσφέρει παιδεία ανωτάτου επιπέδου -με διεθνή κριτήρια- και να καλλιεργεί στους μαθητές του εκείνες τις ικανότητες της ψυχής, του σώματος και του πνεύματος που είναι αναγκαίες για κάθε υπεύθυνο πολίτη".',
            'background' => $background,
        ]);Scholio::portalSocial($school1, 'facebook', 'https://www.haef.gr/-/media/Images/HAEF/Icons/fb.ashx?h=16&la=el&w=16');
            Scholio::portalSocial($school1, 'google', '
            Scholio::portalSocial($school1, 'twitter', 'https://www.haef.gr/-/media/Images/HAEF/Icons/tw.ashx?h=16&la=el&w=16');
            Scholio::portalSocial($school1, 'youtube', ');
         // δημοτικό - γυμνάσιο - λύκειο 


        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Δούκα', 'email' => 'info@doukas.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Μεσογείων 151, 151 26, Μαρούσι            ',
            'city' => ''Αθήνα,
            'phone' => 2106186000 ,
            'type_id' => 6,
            'website' => 'http://www.doukas.gr/',
            'approved' => 1,
            'about' => '> Εκπαιδεύουμε παγκόσμιους πολίτες με Ελληνική ταυτότητα & ικανότητες 21ου αιώνα
            Πιστεύουμε στην ισορροπία ανάμεσα στην Παράδοση και την Πρόοδο. Σκοπός μας είναι να βελτιώνουμε διαρκώς την ποιότητα των υπηρεσιών μας και να ξεπερνάμε τις ανάγκες και τις προσδοκίες των μαθητών μας, των γονέων τους καθώς και της ευρύτερης κοινωνίας.
            Στόχος μας είναι να εκπαιδεύουμε Παγκόσμιους Πολίτες με Ελληνική Ταυτότητα, εφοδιάζοντάς τους με Ικανότητες του 21ου αιώνα, δείχνοντας ταυτόχρονα σεβασμό στη μοναδικότητα του κάθε παιδιού.',
            'background' => $background,
        ]);Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/DoukaSchool');
            Scholio::portalSocial($school1, 'instagram', 'https://instagram.com/doukas_school/'
            Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/Doukas_School');
            Scholio::portalSocial($school1, 'youtube', ');
         // νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο


        $school1 = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Πρότυπα Εκπαιδευτήρια Θεσσαλονίκης', 'email' => 'info@protypa.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
            'address' => 'Ελαιώνες Πυλαίας Τ.Κ. 555 36',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310300002,
            'type_id' => 6,
            'website' => 'https://www.protypa.gr/frontend/index.php',
            'approved' => 1,
            'about' => 'Τα Πρότυπα Εκπαιδευτήρια Θεσσαλονίκης με μια δημιουργική πορεία 40 ετών είναι μια πλήρης μονάδα. Ειδικεύεται στην πρωτοβάθμια εκπαίδευση στην οποία και επικεντρώνεται γνωρίζοντας τη δομική σημασία στη μετέπειτα πορεία των μαθητών. Ως αναγνώριση και επιβεβαίωση του υψηλού επιπέδου σπουδών μας, επισημαίνουμε ότι οι απόφοιτοι των Εκπαιδευτηρίων μας κατέχουν τις πρώτες θέσεις στις εισαγωγικές εξετάσεις κολεγίων, καθώς και τις υψηλότερες βαθμολογίες στα ιδιωτικά και δημόσια Γυμνάσια και Λύκεια της πόλης μας.',
            'background' => $background,
        ]);


Scholio::portalSocial($school1, 'facebook', 'http://www.facebook.com/pages/Thessaloniki-Greece/Protypa-Ekpaideuteria-Thessalonikes/170518156295078');
            Scholio::portalSocial($school1, 'google', 'https://plus.google.com/117536093537987040966/'
            Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/protypa_gr'
            Scholio::portalSocial($school1, 'youtube', 'http://www.youtube.com/user/protypa'
         // παιδικός σταθμός - νηπιαγωγείο - δημοτικό



            $school1 = factory(App\Models\School::class)->create([
                'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Μαντουλίδη', 'email' => 'primary@mandoulides.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
                'address' => '6ο χλμ. Οδού Χαριλάου - Θέρμης',
                'city' => 'Θέρμη,Θεσσαλονίκη',
                'phone' => 2310473813,
                'type_id' => 6,
                'website' => 'https://mandoulides.edu.gr/',
                'approved' => 1,
                'about' => 'Τα Εκπαιδευτήρια αποτελούν σήμερα μια σύγχρονη και δυναμική κοινότητα παιδείας, πολιτισμού και αθλητισμού, αναγνωρισμένη σε όλη την Ελλάδα.

                Τα Εκπαιδευτήρια περιλαμβάνουν:
                Παιδικό Σταθμό, Νηπιαγωγείο, Δημοτικό, Γυμνάσιο, Λύκειο, κέντρο συμβουλευτικής και τμήματα προετοιμασίας για σπουδές στο εξωτερικό.
                
                ',
                'background' => $background,
            ]);
    
    
    Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/mandoulides'
                Scholio::portalSocial($school1, 'instagram', 'https://www.instagram.com/mandoulides_schools/'
                Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/Mandoulides'
                Scholio::portalSocial($school1, 'youtube', 'http://www.youtube.com/user/mandoulidesschools'
                Scholio::portalSocial($school1, 'linkedin', 'https://www.linkedin.com/company/mandoulides'

             // παιδικός σταθμός - νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο




                $school1 = factory(App\Models\School::class)->create([
                    'user_id' => factory(App\User::class)->create(['name' => 'Ανατόλια / The American College of Thessaloniki (ACT)', 'email' => 'acagyreg@anatolia.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
                    'address' => '555 10 Πυλαία',
                    'city' => 'Θεσσαλονίκη',
                    'phone' => 2310398357,
                    'type_id' => 6,
                    'website' => 'http://www.anatolia.edu.gr/cms.jsp?extLang=',
                    'approved' => 1,
                    'about' => 'Στόχος μας είναι να εμφυσήσουμε στους μαθητές μας τη φιλοδοξία και να τους δώσουμε όλα τα απαραίτητα εφόδια να γίνουν πολίτες του κόσμου, υπεύθυνοι και με αρχές, αλλά και κριτικά σκεπτόμενα άτομα με ανοιχτό πνεύμα που αναζητούν με ενεργό τρόπο τη γνώση σε όλη τη διάρκεια της ζωής τους.
                     Όραμά μας είναι να εδραιώσουμε το Ανατόλια ως την πρώτη επιλογή για κάθε ικανό μαθητή και μαθήτρια ανεξαρτήτως οικονομικής δυνατότητας, ως ένα σχολείο-πρότυπο στον τομέα της διαρκούς ανάπτυξης και εφαρμογής νέων εκπαιδευτικών πρακτικών, που προσφέρει πολύτιμα εφόδια και αποτελεί καθοριστικό παράγοντα για τη μελλοντική τους επιτυχία στην ακαδημαϊκή, επαγγελματική και προσωπική τους ζωή. ',
                    'background' => $background,
                ]);
        
        
        Scholio::portalSocial($school1, 'facebook', 'http://www.facebook.com/search/?q=anatolia#/pages/Thessaloniki-Greece/Anatolia-College/300380195330?ref=ss'
                    Scholio::portalSocial($school1, 'google', '
                    Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/Anatolia1886'
                    Scholio::portalSocial($school1, 'youtube', 'http://www.youtube.com/anatoliacollege'
    
    
                // γυμνάσιο - λύκειο




                    $school1 = factory(App\Models\School::class)->create([
                        'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτικός Οργανισμός Ελληνικό Κολλέγιο Θεσσαλονίκης', 'email' => 'hel-col@otenet.gr
                        ', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
                        'address' => 'Δροσιά Θέρμης',
                        'city' => 'Θέρμη, Θεσσαλονίκη',
                        'phone' => 2310473112,
                        'type_id' => 6,
                        'website' => 'http://www.hellenic-college.gr/index.php',
                        'approved' => 1,
                        'about' => 'Σήμερα, το Ελληνικό Κολλέγιο Θεσσαλονίκης, με τη γόνιμη πείρα των 56 ετών από την ίδρυσή του, έχει επιδείξει ένα σύγχρονο και πρωτοποριακό παιδαγωγικό έργο. Το προσεκτικά επιλεγμένο και άριστα καταρτισμένο διδακτικό προσωπικό μας, χρησιμοποιώντας τα σύγχρονα εποπτικά μέσα και τις σύγχρονες μεθόδους παιδαγωγικής διδασκαλίας, σέβεται τα οράματα και την προσωπικότητα του κάθε μαθητή, παρέχοντάς του έτσι, όχι στείρες γνώσεις, αλλά ουσιαστική παιδεία. Έτσι, στο Ελληνικό Κολλέγιο Θεσσαλονίκης, κάθε μαθητής έχει τη δυνατότητα να αξιοποιήσει τις ικανότητές του, να αυτενεργήσει, να εμβαθύνει και να εμπεδώσει τη γνώση, πειθαρχώντας συνειδητά στους κανόνες του σχολείου.
                        Το εκπαιδευτικό πρόγραμμα που εφαρμόζουμε στοχεύει στην πνευματική εγρήγορση, την καλλιέργεια και την ολόπλευρη ανάπτυξη της προσωπικότητας του μαθητή, προκειμένου να αναδειχτεί νικητής στο στίβο της ζωής.
                        Ο πρωταρχικό στόχος του Ελληνικού Κολλεγίου Θεσσαλονίκης είναι η παροχή υψηλού επιπέδου εκπαίδευσης, που εξασφαλίζει ουσιαστική παιδεία και επιτυχημένη μεταλυκειακή σταδιοδρομία.',
                        'background' => $background,
                    ]);
            
            
            Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/HellenicCollegeOfThessaloniki'
                        Scholio::portalSocial($school1, 'pinterest', 'http://www.hellenic-college.gr/organization.php#'
        
                        Scholio::portalSocial($school1, 'youtube', 'http://www.youtube.com/user/HellenicCollegeThess'
        
        
                     // βρεφονηπιακός σταθμός - παιδικός σταθμός - νηπιαγωγείο - δημοτικό - γυμνάσιο - λύκειο




                        $school1 = factory(App\Models\School::class)->create([
                            'user_id' => factory(App\User::class)->create(['name' => 'Deutsche Schule Thessaloniki - Γερμανική Σχολή Θεσσαλονίκης', 'email' => 'info@dst.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => ''])->id,
                            'address' => '9ο χλμ Θεσσαλονίκης – Θέρμης',
                            'city' => 'Θέρμη, Θεσσαλονίκη',
                            'phone' => 2310475900,
                            'type_id' => 6,
                            'website' => 'http://www.dst.gr/?lang=el',
                            'approved' => 1,
                            'about' => 'Η Γερμανική Σχολή Θεσσαλονίκης, έχει ως γερμανικό σχολείο εξωτερικού
                            παράδοση άνω των 120 ετών – τα μαθήματα άρχισαν στις 13 Φεβρουαρίου 1888.
                            Έκτοτε, η Γερμανική Σχολή Θεσσαλονίκης αποτελεί αναπόσπαστο κομμάτι της
                            «Απόδημης Πολιτικής Πολιτισμού και Μόρφωσης» της Γερμανίας, στις
                            διαφορετικές της μορφές: Γερμανική Αυτοκρατορία του Κάιζερ (έως το 1918),
                            Δημοκρατία της Βαϊμάρης (1918-1933), φασιστική Δικτατορία (1933-1945) και
                            τέλος Ομοσπονδιακή Δημοκρατία της Γερμανίας (από το 1949), οι οποίες
                            επηρέασαν κάθε μια με το δικό της τρόπο το μάθημα και την εκπαίδευση στη
                            Γερμανική Σχολή Θεσσαλονίκης, καθώς και τη διαμόρφωση του τρόπου με τον
                            οποίο αντιλαμβάνεται η ελληνική κοινωνία τη σχολή ως ιδιωτικό εκπαιδευτικό
                            ίδρυμα. Σήμερα, η ΓΣΘ, κατέχει μια εξαιρετική φήμη: έχει εδραιωθεί ως ένα από τα
                            καλύτερα ιδιωτικά σχολεία της περιφέρειας και της Ελλάδας γενικότερα. Οι
                            απόφοιτοί της, μετά τις σπουδές τους και την επαγγελματική τους κατάρτιση,
                            καταλαμβάνουν συχνά σημαντικές θέσεις στο κράτος, την οικονομία και την
                            κοινωνία της χώρας. Πολλοί εξ αυτών σπούδασαν στη Γερμανία, ενδυναμώνοντας
                            σημαντικά τους δεσμούς μεταξύ των δύο χωρών.',
                            'background' => $background,
                        ]);
                
                
                Scholio::portalSocial($school1, 'facebook', 'https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fwww.dst.gr%2Fdie-schule%2Fdie-geschichte-der-dst%2F%3Flang%3Del'
                            Scholio::portalSocial($school1, 'google', 'https://plus.google.com/share?url=http%3A%2F%2Fwww.dst.gr%2Fdie-schule%2Fdie-geschichte-der-dst%2F%3Flang%3Del'
                            Scholio::portalSocial($school1, 'twitter', 'https://twitter.com/share?text=%CE%97%20%CE%B9%CF%83%CF%84%CE%BF%CF%81%CE%AF%CE%B1%20%CE%BC%CE%B1%CF%82&url=http%3A%2F%2Fwww.dst.gr%2Fdie-schule%2Fdie-geschichte-der-dst%2F%3Flang%3Del'
                            Scholio::portalSocial($school1, 'youtube', ');
            
                         // νηπιαγωγείο - δημοτικό - γερμανικό τμήμα - ελληνικό τμήμα?>?>