<?php

use Illuminate\Database\Seeder;

class Schools extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;

        /*===============  Εκπαιδευτήρια Βασιλειάδη ================*/
        $vas = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Βασιλειάδη (Γυμνάσιο)', 'email' => 'info@vassiliadis.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'vasileiadi'])->id,
            'address' => '12o χλμ Θεσ/νίκης-Μουδανιών, Θέρμη',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310475958,
            'type_id' => 13,
            'website' => 'vassiliadis.edu.gr',
            'approved' => 1,
            'about' => '<p><strong>Στα Εκπαιδευτήρια Βασιλειάδη</strong></p>
<ul>
<li><strong>Επικοινωνούμε</strong>: Επιδιώκουμε την ουσιαστική επικοινωνία μεταξύ διεύθυνσης, διδακτικού προσωπικού, γονέων και μαθητών. Η συνεργασία και η αλληλοκατανόηση αποκτούν ουσιαστικό περιεχόμενο στην τάξη, έξω απ’ αυτήν, αλλά και με τακτικές προγραμματισμένες συναντήσεις.</li>
<li><strong>Διδάσκουμε</strong>: Ένα άριστο επιτελείο καθηγητών αποτελεί το διδακτικό μας προσωπικό. Άνθρωποι που για χρόνια και με συνέπεια υπηρετούν την εκπαίδευση, διαθέτουν φροντιστηριακή πείρα, αλλά και την απαιτούμενη παιδαγωγική κατάρτιση, για να υποστηρίξουν κάθε ανάγκη του μαθητή.</li>
<li><strong>Υποστηρίζουμε</strong>: Παρέχουμε στους μαθητές μας το βοηθητικό υλικό που απαιτείται για την καλύτερη προσέγγιση της διδακτέας ύλης: Σημειώσεις ανά μάθημα σε έντυπη και ηλεκτρονική μορφή, προηγμένη χρήση διαδραστικών πινάκων (smartboard), ηλεκτρονική εκπαιδευτική πλατφόρμα (moodle) και πρόσβαση στη δανειστική βιβλιοθήκη του σχολείου. Το σχολείο μας έχει προχωρήσει σε ενίσχυση του προγράμματος με πρόσθετες ώρες διδασκαλίας των πανελλαδικώς εξεταζόμενων μαθημάτων για τις τάξεις του Λυκείου, εξασφαλίζοντας περισσότερο χρόνο προετοιμασίας για τους μαθητές και απαλλάσσοντας τους γονείς από επιπρόσθετες οικονομικές δαπάνες.  </li>
<li><strong>Καινοτομούμε</strong>: Πρωτοστατήσαμε στην εισαγωγή της νέας τεχνολογίας στην εκπαιδευτική διαδικασία, εξοπλίζοντας όλες τις αίθουσες και τα εργαστήρια με διαδραστικούς πίνακες(smartboard). Συνεχίζουμε να πρωτοπορούμε αξιοποιώντας τις δυνατότητές τους στην ενεργοποίηση της προσοχής και της αφομοιωτικής ικανότητας των μαθητών μας. Η συνεχής επιμόρφωση όλων των εκπαιδευτικών μας στη χρήση Η/Υ και αντίστοιχων εκπαιδευτικών προγραμμάτων εγγυάται την ουσιαστική συμβολή των νέων εποπτικών μέσων στην αποτελεσματικότητα της διδασκαλίας.</li>
<li><strong>Ενθαρρύνουμε</strong>: Αφουγκραζόμαστε και κινητοποιούμε τη δημιουργικότητα των παιδιών από το επίπεδο της τάξης έως την εξειδικευμένη ενασχόληση στους ομίλους ενδιαφερόντων (clubs). Συμμετέχουμε ενεργά στους θεσμοθετημένους διαγωνισμούς με γνωστικό αλλά και πολιτιστικό-αθλητικό περιεχόμενο. Ενθαρρύνουμε τη συμμετοχή των μαθητών μας σε προγράμματα με κοινωνικό, οικολογικό και καλλιτεχνικό προσανατολισμό.</li>
<li><strong>Εμπνέουμε</strong>: Στοχεύουμε σε ένα σχολείο ανοιχτό στην κοινωνία. Επιδιώκουμε να διατηρούμε συνεχή επαφή με τα συμβαίνοντα στην κοινωνική πραγματικότητα σε τοπικό, εθνικό και διεθνές περιβάλλον.</li>
</ul>',
            'background' => $background,
        ]);

        new Portal($vas, 5, 'sxoleio');

        Scholio::portalStudy($vas, 'Ιδιωτικό Σχολείο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($vas, 'Ιδιωτικό Σχολείο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($vas, 'Ιδιωτικό Σχολείο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($vas, 'Ιδιωτικό Σχολείο', 'Λύκειο', 'Ά Λυκείου');
        Scholio::portalStudy($vas, 'Ιδιωτικό Σχολείο', 'Λύκειο', '΄Β Λυκείου');
        Scholio::portalStudy($vas, 'Ιδιωτικό Σχολείο', 'Λύκειο', '΄Γ Λυκείου');

        Scholio::portalSocial($vas, 'facebook', 'https://www.facebook.com/ekpaideftiria.vassiliadi/');
        Scholio::portalSocial($vas, 'instagram', 'https://www.instagram.com/vassiliadis.school/');
        Scholio::portalSocial($vas, 'youtube', 'https://www.youtube.com/user/VASSILIADISSCHOOL');
        Scholio::portalSocial($vas, 'google', 'https://plus.google.com/u/0/+%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%AE%CF%81%CE%B9%CE%B1%CE%92%CE%B1%CF%83%CE%B9%CE%BB%CE%B5%CE%B9%CE%AC%CE%B4%CE%B7');

        /*===============  Εκπαιδευτήρια Φρυγανιώτη ================*/
        $fryg = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Φρυγανιώτη', 'email' => 'info@fryganiotis.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'fryganioti'])->id,
            'address' => 'Περιοχή Νοσ. Παπαγεωργίου, Πολίχνη',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310692940,
            'type_id' => 13,
            'website' => 'fryganiotis.gr',
            'approved' => 1,
            'about' => '<h2>Φιλοσοφία</h2>
<p>Είναι δύσκολο για μας να περιγράψουμε μέσα σε λίγες γραμμές, την πολυσύνθετη προσπάθειά μας, για να καλλιεργήσουμε πνευματικά, μορφωτικά και ηθικά τα παιδιά μας. Οι στόχοι μας υπαγορεύονται από την <strong>αγάπη,</strong> τον <strong>ανθρώπινο χαρακτήρα</strong> και την <strong>επιστημονική πληρότητα</strong>.</p>
<div>
<p><br />Η <strong>ελεύθερη σκέψη</strong>, η <strong>κριτική ικανότητα</strong>, το <strong>δημιουργικό πνεύμα</strong>, ο <strong>σεβασμός για το περιβάλλον και τον άνθρωπο</strong> αποτελούν κατευθυντήριες έννοιες της σχολικής καθημερινότητας στα Εκπαιδευτήριά μας. Προσφέρουμε στους μαθητές μας υψηλής ποιότητας παιδεία, προσαρμοσμένη στις ανάγκες του κάθε παιδιού.<br /><br />Επιδιώκουμε με κάθε τρόπο να αναγνωρίσουμε και <strong>να αναδείξουμε τις ιδιαίτερες ικανότητες του κάθε μαθητή</strong>. Για μας το παιδί δεν είναι θεατής, αλλά ενεργός συμμέτοχος στην εκπαιδευτική διαδικασία. Προετοιμάζουμε σκεπτόμενους πολίτες που με τις γνώσεις και το ήθος τους θα είναι έτοιμοι να αντιμετωπίζουν τις προκλήσεις των καιρών.</p>
<p>Το <strong>φιλικό και ζεστό περιβάλλον</strong> των Εκπαιδευτηρίων μας, αποτελεί πάντα σημαντικό παράγοντα στην υλοποίηση των στόχων μας. Με <strong>ιδιαίτερη στοργή</strong> και <strong>ενδιαφέρον</strong> σκύβουμε στις ανησυχίες και τις αναζητήσεις των νέων ανθρώπων, οπλίζοντάς τους με δύναμη και αισιοδοξία για τη ζωή.<br /><br />Πιστεύουμε ότι κάθε μορφωτικό αγαθό μπορεί να βλαστήσει μόνο μέσα από <strong>σχέσεις υγιείς και ευτυχισμένες,</strong> <strong>σχέσεις εμπιστοσύνης</strong> που μόνο στο <strong>οικογενειακό περιβάλλον που προσφέρουμε</strong> μπορούν να καλλιεργηθούν και με την προσωπική μας φροντίδα να καρποφορήσουν.</p>
</div>',
            'background' => $background,
        ]);

        new Portal($fryg, 5, 'sxoleio');

        Scholio::portalStudy($fryg, 'Παιδικός Σταθμός', 'Παιδικός Σταθμός', 'Παιδικός Σταθμός');
        Scholio::portalStudy($fryg, 'Νηπιαγωγίο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($fryg, 'Νηπιαγωγίο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($fryg, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($fryg, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($fryg, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($fryg, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($fryg, 'Δημοτικό', 'Γενική Παιδεία', '΄Έ Δημοτικού');
        Scholio::portalStudy($fryg, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');

        Scholio::portalStudy($fryg, 'Γυμνάσιο', 'Γενική Παιδεία', 'Ά Γυμνασίου');
        Scholio::portalStudy($fryg, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Β Γυμνασίου');
        Scholio::portalStudy($fryg, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Γ Γυμνασίου');
        Scholio::portalStudy($fryg, 'Λύκειο', 'Γενική Παιδεία', 'Ά Λυκείου');
        Scholio::portalStudy($fryg, 'Λύκειο', 'Γενική Παιδεία', '΄Β Λυκείου');
        Scholio::portalStudy($fryg, 'Λύκειο', 'Γενική Παιδεία', '΄Γ Λυκείου');

        Scholio::portalSocial($fryg, 'facebook', 'https://www.facebook.com/pages/%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%A6%CF%81%CF%85%CE%B3%CE%B1%CE%BD%CE%B9%CF%8E%CF%84%CE%B7/177952078968022');
        Scholio::portalSocial($fryg, 'twitter', 'https://twitter.com/Fryganiotis');
        Scholio::portalSocial($fryg, 'google', 'https://plus.google.com/115516704175748625108');
        Scholio::portalSocial($fryg, 'youtube', 'http://www.youtube.com/user/Fryganiotis');

        /*===============  8 Εκπαιδευτήρια Απόστολος Παύλος  ================*/
        $eap = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Απόστολος Παύλος', 'email' => 'gymnasio@eap.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'eap'])->id,
            'address' => 'Κένεντι 119, Πυλαία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310329540,
            'type_id' => 13,
            'website' => 'eap.edu.gr',
            'approved' => 1,
            'about' => '<p>Τα Εκπαιδευτήρια «Ο Απόστολος Παύλος» ιδρύθηκαν <strong>το 1976</strong> από τον μακαριστό Μητροπολίτη Θεσσαλονίκης <strong>πατέρα Λεωνίδα Παρασκευόπουλο </strong>, ο οποίος οραματίστηκε για την αγαπημένη του Θεσσαλονίκη ένα σχολείο που θα κάλυπτε όλες τις βαθμίδες και θα παρείχε στους μαθητές του άριστη μόρφωση αλλά και χριστιανική αγωγή ψυχής.<br />Η επιθυμία του αειμνήστου πατρός βρήκε ένθερμους υποστηρικτές οι οποίοι με ζήλο και αυταπάρνηση υλοποίησαν το όραμα. Ο ιεραποστολικός σύλλογος της Θεσσαλονίκης<strong> "Απόστολος Παύλος" </strong>ανέλαβε την ευθύνη αυτού του έργου, την οποία έχει ως σήμερα. Πρώτα λειτούργησε ένα τμήμα του Νηπιαγωγείου με την ονομασία «Κυκλάμινα». Σιγά-σιγά ολοκληρώθηκαν οι τάξεις του Δημοτικού, του Γυμνασίου και του Λυκείου.</p>
<p><strong>Παιδικός Σταθμός, </strong>δύο<strong> Νηπιαγωγεία, </strong>δύο <strong>Δημοτικά Σχολεία, </strong>δύο<strong> Γυμνάσια </strong>και το <strong>Λύκειο </strong>λειτουργούν σήμερα και έχουν φιλοξενήσει εκατοντάδες μαθητές παρέχοντας εξαιρετικού επιπέδου μόρφωση και αγωγή. Το Σχολείο αγαπήθηκε από τους Θεσσαλονίκεις, οι οποίοι με εμπιστοσύνη «ακούμπησαν» σ’ αυτό τα παιδιά τους.</p>
<p>Με ταχύτατο ρυθμό αναπτύχθηκαν οι κτιριακές εγκαταστάσεις σ\' έναν χώρο μοναδικής θέσης και ομορφιάς στους πρόποδες του Πανοράματος που έχει το προνόμιο να είναι κατάφυτος. Το 1980 εγκαινιάστηκε το κτίριο του Δημοτικού Σχολείου από το ιδρυτή των Εκπαιδευτηρίων μας π. Λεωνίδα ο οποίος συγκινημένος έβλεπε να υλοποιείται το όραμά του, το 1983 ολοκληρώθηκε και εγκαινιάστηκε το κτίριο που στεγάζει το Γυμνάσιο, το 1992 το κτίριο του Λυκείου, το 2003 εγκαινιάστηκε νέο κτίριο νηπιαγωγείων και το 2006 νέο δεύτερο κτίριο Δημοτικού σχολείου. Αίθουσες τελετών, γυμναστήρια, γήπεδα και πολύ άνετοι προαύλιοι χώροι συμπληρώνουν τις εγκαταστάσεις.</p>',
            'background' => $background,
        ]);

        new Portal($eap, 5, 'sxoleio');

        Scholio::portalStudy($eap, 'Παιδικός Σταθμός', 'Παιδικός Σταθμός', 'Παιδικός Σταθμός');
        Scholio::portalStudy($eap, 'Νηπιαγωγίο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($eap, 'Νηπιαγωγίο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($eap, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($eap, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($eap, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($eap, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($eap, 'Δημοτικό', 'Γενική Παιδεία', '΄Έ Δημοτικού');
        Scholio::portalStudy($eap, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');

        Scholio::portalStudy($eap, 'Γυμνάσιο', 'Γενική Παιδεία', 'Ά Γυμνασίου');
        Scholio::portalStudy($eap, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Β Γυμνασίου');
        Scholio::portalStudy($eap, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Γ Γυμνασίου');
        Scholio::portalStudy($eap, 'Λύκειο', 'Γενική Παιδεία', 'Ά Λυκείου');
        Scholio::portalStudy($eap, 'Λύκειο', 'Γενική Παιδεία', '΄Β Λυκείου');
        Scholio::portalStudy($eap, 'Λύκειο', 'Γενική Παιδεία', '΄Γ Λυκείου');

        Scholio::portalSocial($eap, 'facebook', 'https://www.facebook.com/%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%9F-%CE%91%CF%80%CF%8C%CF%83%CF%84%CE%BF%CE%BB%CE%BF%CF%82-%CE%A0%CE%B1%CF%8D%CE%BB%CE%BF%CF%82-%CE%94%CE%B7%CE%BC%CE%BF%CF%84%CE%B9%CE%BA%CF%8C-183084695556876/');
        Scholio::portalSocial($eap, 'youtube', 'https://www.youtube.com/channel/UCsUqecWmvPDYEUe9Y2xxbow');
        Scholio::portalSocial($eap, 'blogger', 'http://eapdim.blogspot.gr/');

        /*===============  Αδαμάντιος Σχολή ================*/
        $adam = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Αδαμάντιος Σχολή', 'email' => 'info@adamantios.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'adamantios'])->id,
            'address' => 'Λεωφ. Γεωργικής Σχολής 44, Πυλαία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310472474,
            'type_id' => 13,
            'website' => 'adamantios.gr',
            'approved' => 1,
            'about' => '<p class="homePadRight">Η Αδαμάντιος Σχολή μέσα σ\' ένα ασφαλές περιβάλλον φροντίζει τους μαθητές της με αγάπη. Τους παρέχει πολύπλευρη εκπαίδευση και διαμορφώνει την προσωπικότητά τους.</p>
<p class="homePadRight">Tο προσωπικό μας είναι άριστα καταρτισμένο. Η εκπαιδευτική διαδικασία υποστηρίζεται με σύνολο εξειδικευμένων δασκάλων που καλλιεργούν και αναπτύσσουν τις δεξιότητες και τα χαρίσματα των μαθητών.</p>
<p class="homePadRight">Διδάσκονται τρεις ξένες γλώσσες, Αγγλικά, Γαλλικά και Γερμανικά, μέσα στις ώρες λειτουργίας του σχολικού προγράμματος. Στους νεοεγγραφόμενους μαθητές παραδίδονται μαθήματα ξένων γλωσσών για την ομαλή ένταξή τους στην τάξη. Επίσης, λαμβάνεται ιδιαίτερη μέριμνα για Δημιουργική Απασχόληση-Φύλαξη των παιδιών σε ώρες πέραν του ωρολογίου προγράμματος.</p>
<p class="homePadRight">Η συνεργασία Γονέων- Σχολείου αποτελεί βασικό παράγοντα της εκπαιδευτικής μας διαδικασίας. Η επίδοση και η διαγωγή των μαθητών μας αποτελεί καθημερινό μας μέλημα.</p>',
            'background' => $background,
        ]);

        new Portal($adam, 5, 'sxoleio');

        Scholio::portalStudy($adam, 'Παιδικός Σταθμός', 'Παιδικός Σταθμός', 'Παιδικός Σταθμός');
        Scholio::portalStudy($adam, 'Νηπιαγωγίο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($adam, 'Νηπιαγωγίο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($adam, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($adam, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($adam, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($adam, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($adam, 'Δημοτικό', 'Γενική Παιδεία', '΄Έ Δημοτικού');
        Scholio::portalStudy($adam, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');

        Scholio::portalSocial($adam, 'facebook', 'https://www.facebook.com/%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%9F-%CE%91%CF%80%CF%8C%CF%83%CF%84%CE%BF%CE%BB%CE%BF%CF%82-%CE%A0%CE%B1%CF%8D%CE%BB%CE%BF%CF%82-%CE%94%CE%B7%CE%BC%CE%BF%CF%84%CE%B9%CE%BA%CF%8C-183084695556876/');
        Scholio::portalSocial($adam, 'youtube', 'https://www.youtube.com/channel/UCsUqecWmvPDYEUe9Y2xxbow');
        Scholio::portalSocial($adam, 'blogger', 'http://eapdim.blogspot.gr/');

        /*===============  Καλαμαρί ================*/
        $kalam = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Καλαμαρί', 'email' => 'info@kalamari.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'kalamari'])->id,
            'address' => 'Λεωφ. Γεωργικής Σχολής 44, Πυλαία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310472115,
            'type_id' => 13,
            'website' => 'www.kalamari.gr',
            'approved' => 1,
            'about' => '<div>
            <p>Το σχολείο δεν είναι ένας περιχαρακωμένος χώρος, όπου οι νέοι ανατρέφονται με τη μορφή πειραματόζωων. Πρέπει να αποτελεί συνέχεια της ζωής και της περιρρέουσας κοινωνίας και να βρίσκεται σε μια διαρκή σχέση αλληλοεπικοινωνίας μαζί τους.</p>
            <p>Το σχολείο πρέπει να είναι ενταγμένο μέσα στο δικό τους πλαίσιο και να τις υπηρετεί διαμορφώνοντας ανθρώπους οι οποίοι μπορούν να υποδεικνύουν αλλαγές και υπερβάσεις των κατεστημένων, όταν οι συνθήκες και οι ανάγκες το απαιτούν. Όλα αυτά βέβαια σε συνδυασμό με μια ανατροφή στην οποία κυριαρχεί η ελευθερία και πλεονάζει η αγάπη για το μαθητή.</p>
            <p>Ένα τέτοιο σχολικό και εκπαιδευτικό περιβάλλον είναι ιδανικό για να ξυπνήσουν οι δυνάμεις και οι δυνατότητες του μαθητή, ώστε να μπορέσει να δομήσει μέσα από τη σύγκριση, την έκφραση διαφορετικών γνωμών και προσεγγίσεων των θεμάτων, την ορθή σκέψη. Διαφορετικά παραμένουμε στην απόλυτη και αδιαμφισβήτητη αλήθεια του "από καθέδρας λόγου", που αντιμετωπίζει τους μαθητές σφαιρικά ανίδεους και καλείται να τους πλάσει όπως ο γλύπτης το άψυχο υλικό της τέχνης του.</p>
            <p>Η σύγχρονη μόρφωση δεν μπορεί σε καμιά περίπτωση να αφίσταται της σύγχρονης πραγματικότητας. Μπορεί βέβαια να ανακαλεί την παράδοση καθώς και στοιχεία του παρελθόντος, αλλά το κέντρο βάρους πέφτει πάντοτε στην υπάρχουσα ζωντανή κοινωνία. Η παιδαγωγική θεωρία επιδιώκουμε να πηγάζει αβίαστα από την πράξη, τη ζωή και την ατομική παρατήρηση. Είναι αυτή που ετοιμάζει τα παιδιά για την ατομική ενέργεια και την πρωτοβουλία, μορφώνει καλύτερα τον εαυτό τους και ανυψώνει το σύνολο!</p>
            <p>Τρία είναι λοιπόν τα στοιχεία προς τα οποία συγκλίνουν οι στόχοι των εκπαιδευτικών βαθμίδων της Σχολής μας:</p>
            <ul>
            <li>ελληνοχριστιανικό πνεύμα</li>
            <li>ευρωπαϊκή διάσταση</li>
            <li>σχολείο για το αύριο<br />πιο απλά...</li>
            </ul>
            <p><strong>Παράδοση και πρόοδος στην Εκπαίδευση</strong></p>
            <p>Με γνώμονα αυτές τις γενικές αρχές οι επιμέρους στόχοι στις τρεις βαθμίδες της εκπαίδευσης συνοψίζονται στα εξής:</p>
            <p><strong>Γυμνάσιο:</strong></p>
            <p>Ολοκλήρωση της αρχής για υποχρεωτική εκπαίδευση, αλλά, κυρίως, προετοιμασία των μαθητών για το Λύκειο. Στο επίπεδο αυτό υποστηρίζεται κατάλληλα η ωριμάζουσα αφηρημένη σκέψη των παιδιών με τέτοια μεθοδικότητα, ώστε η γνώση να προκύπτει από την εξοικείωση του μαθητή στην εύρεση τρόπων μάθησης μέσω της κατευθυνόμενης αυτενέργειας.</p>
            <p>Το Γυμνάσιο οφείλει να παραλάβει παιδιά και να παραδώσει ώριμους εφήβους. Έτσι προσπαθούμε να γνωρίσουμε τον κάθε έφηβο με ποικίλες μεθόδους (συζήτηση, διακριτική παρακολούθηση κλπ) και να διαμορφώνουμε πλήρη εικόνα για κάθε μαθητή, ώστε να παρέχουμε στους κηδεμόνες τεκμηριωμένη εικόνα των παιδιών τους.</p>
            <p><strong>Λύκειο:</strong></p>
            <p>Για τα παιδιά το Λύκειο είναι η δεύτερη βαθμίδα της δευτεροβάθμιας εκπαίδευσης και συμπίπτει για πολλά από αυτά με την κορύφωση και τη λήξη της εφηβείας.</p>
            <p><strong>Χαρακτηριστικά του Λυκείου:</strong></p>
            <p>Εκτιμούμε ότι τα κύρια χαρακτηριστικά της βαθμίδας αυτής σήμερα είναι:</p>
            <ul>
            <li>Η ποιοτική και ποσοτική διαφοροποίηση των γνωστικών αντικειμένων σε σχέση με την προηγούμενη βαθμίδα</li>
            <li>Η έναρξη εντονότερων προβληματισμών</li>
            <li>Η προσπάθεια προσανατολισμού και αποσαφήνιση των επιλογών ώστε να διευκολυνθεί η μεταλυκειακή πορεία.</li>
            <li>Το εξαιρετικά φορτισμένο κλίμα που διαμορφώνεται από την πίεση της εξεταστικής διαδικασίας.</li>
            <li>Η διαπίστωση της δυσκολίας να συνυπάρξουν στο 24ωρο των παιδιών, η προετοιμασία, η μελέτη, η "εξωσχολική βοήθεια", η ξεκούραση, η ψυχαγωγία, η ενημέρωση...</li>
            </ul>
            </div>
            <div class="sp-social-share clearfix"> </div>',
            'background' => $background,
        ]);

        new Portal($kalam, 5, 'sxoleio');

        Scholio::portalStudy($kalam, 'Ιδιωτικό Σχολείο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($kalam, 'Ιδιωτικό Σχολείο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($kalam, 'Ιδιωτικό Σχολείο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($kalam, 'Ιδιωτικό Σχολείο', 'Λύκειο', 'Ά Λυκείου');
        Scholio::portalStudy($kalam, 'Ιδιωτικό Σχολείο', 'Λύκειο', '΄Β Λυκείου');
        Scholio::portalStudy($kalam, 'Ιδιωτικό Σχολείο', 'Λύκειο', '΄Γ Λυκείου');

        Scholio::portalSocial($kalam, 'facebook', 'https://www.facebook.com/pages/%CE%95%CE%BB%CE%BB%CE%B7%CE%BD%CE%BF%CE%B3%CE%B1%CE%BB%CE%BB%CE%B9%CE%BA%CE%AE-%CE%A3%CF%87%CE%BF%CE%BB%CE%AE-%CE%9A%CE%B1%CE%BB%CE%B1%CE%BC%CE%B1%CF%81%CE%AF/153128398062687');
        Scholio::portalSocial($kalam, 'youtube', 'https://www.youtube.com/channel/UC-hZdASj0OHVn8NJsivcLwQ');
        Scholio::portalSocial($kalam, 'google', 'https://www.google.gr/webhp?source=search_app&gws_rd=cr,ssl#bav=on.2,or.r_qf.&ei=7z8SUp_iNsexhAfGjoCgDA&fp=3025ea08a36d24bb&psj=1&q=%CE%95%CE%BB%CE%BB%CE%B7%CE%BD%CE%BF%CE%B3%CE%B1%CE%BB%CE%BB%CE%B9%CE%BA%CE%AE+%CE%A3%CF%87%CE%BF%CE%BB%CE%AE+%CE%9A%CE%B1%CE%BB%CE%B1%CE%BC%CE%B1%CF%81%CE%AF&sa=X&spell=1&ved=0CCcQBSgA');
    

        /*===============  36 Αμερικανική Γεωργική Σχολή Θεσσαλονίκης================*/
        $afs = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Αμερικανική Γεωργική Σχολή Θεσσαλονίκης', 'email' => 'info@afs.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'afsGel'])->id,
            'address' => 'Μαρίνου Αντύπα 54, Θέρμη',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310492700,
            'type_id' => 13,
            'website' => 'www.afs.edu.gr',
            'approved' => 1,
            'about' => '<p>Η Αμερικανική Γεωργική Σχολή Θεσσαλονίκης είναι ένας ανεξάρτητος, μη κερδοσκοπικός εκπαιδευτικός οργανισμός, που ιδρύθηκε το 1904 στη Θεσσαλονίκη για να εξυπηρετήσει τις ανάγκες του πληθυσμού της Ελλάδος και των Βαλκανίων.
            Τα κύρια εκπαιδευτικά της τμήματα είναι η Πρωτοβάθμια Εκπαίδευση, η Δευτεροβάθμια Εκπαίδευση (Γενικό Λύκειο), η Σχολή Επαγγελματικής Εκπαίδευσης (Επαγγελματικό Λύκειο και Εκπαίδευση Ενηλίκων) και το Perrotis College of Agriculture, Environment and Life Sciences.
            Η Σχολή προετοιμάζει τους αποφοίτους της για ανάληψη κυρίαρχων ρόλων στην κοινωνική ζωή και για ποικίλες επαγγελματικές σταδιοδρομίες στη γεωργία, την επιστήμη και τη βιομηχανία τροφίμων μέσω της μάθησης αγροτικών και επιχειρηματικών πρακτικών που είναι οικονομικά βιώσιμες,
            φιλικές προς το περιβάλλον και κοινωνικά υπεύθυνες. Ο ιδρυτής της Σχολής, Dr. John Henry House, ήταν ένας πρακτικός ιδεαλιστής που πίστευε ότι η εκπαίδευση πρέπει να απευθύνεται σε ολόκληρο το άτομο: στο νου, στα χέρια και στην ψυχή.
            Μετά από περισσότερο από έναν αιώνα εφαρμογής του οράματος του ιδρυτή της, η Σχολή παραμένει προσηλωμένη στη δυναμική συνύπαρξη θεωρίας και πράξης σε όλα τα επίπεδα της γεωργίας και των επιστημών ζωής, σήμα κατατεθέν του οργανισμού.</p>',
            'background' => $background,
        ]);

        new Portal($afs, 5, 'sxoleio');

        Scholio::portalStudy($afs, 'Παιδικός Σταθμός', 'Παιδικός Σταθμός', 'Παιδικός Σταθμός');
        Scholio::portalStudy($afs, 'Νηπιαγωγίο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($afs, 'Νηπιαγωγίο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($afs, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($afs, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($afs, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($afs, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($afs, 'Δημοτικό', 'Γενική Παιδεία', '΄Έ Δημοτικού');
        Scholio::portalStudy($afs, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');
        Scholio::portalStudy($afs, 'Ιδιωτικό Σχολείο', 'Λύκειο', 'Ά Λυκείου');
        Scholio::portalStudy($afs, 'Ιδιωτικό Σχολείο', 'Λύκειο', '΄Β Λυκείου');
        Scholio::portalStudy($afs, 'Ιδιωτικό Σχολείο', 'Λύκειο', '΄Γ Λυκείου');

        Scholio::portalSocial($afs, 'facebook', 'https://www.facebook.com/AmericanFarmSchoolThessaloniki');
        Scholio::portalSocial($afs, 'intagram', 'https://www.instagram.com/americanfarmschool/');
        Scholio::portalSocial($afs, 'flickr', 'https://www.flickr.com/photos/americanfarmschool/');
        Scholio::portalSocial($afs, 'youtube', 'https://www.youtube.com/user/AmericanFarmSchool?feature=mhee');

        /*===============  37 Αριστοτέλειο Κολλέγιο ================*/
        $aristotelio = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Αριστοτέλειο Κολλέγιο', 'email' => 'info@afs.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'aristoteleioCollegeD'])->id,
            'address' => 'Τζων Κέννεντυ, Πυλαία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310311711,
            'type_id' => 13,
            'website' => 'www.aristotelio.edu.gr/web/',
            'approved' => 1,
            'about' => '<h2>Φιλοσοφία του Σχολείου</h2><h3>«ΣΤΟΥΣ ΓΟΝΕΙΣ ΟΦΕΙΛΟΜΕΝ ΤΟ ΖΗΝ, ΣΤΟΥΣ ΔΕ ΔΙΔΑΣΚΑΛΟΥΣ ΤΟ ΕΥ ΖΗΝ» ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ, 356-323 Π.Χ.</h3><p>Καλλιεργώντας ένα θερμό συνεργατικό κλίμα μεταξύ εκπαιδευτικού, μαθητή και γονέων, το σχολείο μας λειτουργεί ως προέκταση της οικογένειας για τα παιδιά. Σεβόμενοι την προσωπικότητα και τις ιδιαίτερες πτυχές του χαρακτήρα του κάθε παιδιού μας ξεχωριστά, στοχεύουμε στην κοινωνικοποίηση του και του παρέχουμε ένα ζεστό, ιδανικό περιβάλλον μάθησης μέσα από τη βιωματική προσέγγιση, τις ευκαιρίες για αυτενέργεια και την επαφή με τις νέες τεχνολογίες. Με τη συμμετοχή μας σε πολλαπλές δράσεις πανελλήνιας, πανευρωπαϊκής ή παγκόσμιας εμβέλειας και τη συνεργασία μας με παγκοσμίου φήμης εκπαιδευτικούς φορείς, δίνεται η ευκαιρία στα παιδιά μας να καταστούν ενεργά μέλη της παγκόσμιας κοινότητας. Με σεβασμό στις παραδόσεις του τόπου μας αλλά με το βλέμμα στραμμένο στο μέλλον, δημιουργούμε ένα σχολείο «ανοιχτών οριζόντων» που επιδιώκει την ολόπλευρη ανάπτυξη των μαθητών μας. Μ’ αυτόν τον τρόπο αναδεικνύουμε την ανθρωποκεντρική μας προσέγγιση που οδηγεί στην επιτυχία.

</p> <h2>Ιστορία του Σχολείου</h2> <h3>ΣΥΝΕΧΗΣ ΠΑΡΟΥΣΙΑ ΣΤΟ ΧΩΡΟ ΤΗΣ ΕΚΠΑΙΔΕΥΣΗΣ ΑΠΟ ΤΟ 1967 ΩΣ ΣΗΜΕΡΑ
</h3> <p>Το Αριστοτέλειο Κολλέγιο είναι ένας πολυδύναμος και πολυεπίπεδος διεθνώς αναγνωρισμένος εκπαιδευτικός οργανισμός με έδρα τη Θεσσαλονίκη που μετρά πάνω από μισό αιώνα εκπαιδευτικής παρουσίας. Αποτελεί την εκπαιδευτική συνέχεια των «Εκπαιδευτηρίων Γκροζούδη» που ιδρύθηκαν το 1967 ενώ την τελική του ονομασία έλαβε το 1980 όταν και η έδρα του σχολείου μεταφέρθηκε στους Δήμους Πανοράματος και Πυλαίας. Σήμερα, το Αριστοτέλειο Κολλέγιο εξακολουθεί να είναι ένα από τα πιο δραστήρια εκπαιδευτικά ιδρύματα της χώρας στο οποίο λειτουργούν ευδόκιμα όλες οι βαθμίδες της Πρωτοβάθμιας και Δευτεροβάθμιας εκπαίδευσης (Παιδικός Σταθμός, Νηπιαγωγείο, Δημοτικό, Γυμνάσιο και Λύκειο). Στο διάστημα των τελευταίων ετών, πέρα από την απόλυτη επιτυχία των μαθητών του σε πανεπιστημιακά ιδρύματα της Ελλάδας και του εξωτερικού, το σχολείο διακρίθηκε σε πολιτιστικές και αθλητικές δράσεις σε πανελλήνιο και παγκόσμιο επίπεδο έχοντας ταυτόχρονα επιδείξει κοινωνική ευαισθησία στον καιρό της κρίσης.

</p>',
            'background' => $background,
        ]);

        new Portal($aristotelio, 5, 'sxoleio');

        Scholio::portalStudy($aristotelio, 'Παιδικός Σταθμός', 'Παιδικός Σταθμός', 'Παιδικός Σταθμός');
        Scholio::portalStudy($aristotelio, 'Νηπιαγωγίο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($aristotelio, 'Νηπιαγωγίο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($aristotelio, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($aristotelio, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($aristotelio, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($aristotelio, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($aristotelio, 'Δημοτικό', 'Γενική Παιδεία', '΄Έ Δημοτικού');
        Scholio::portalStudy($aristotelio, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');

        Scholio::portalStudy($aristotelio, 'Γυμνάσιο', 'Γενική Παιδεία', 'Ά Γυμνασίου');
        Scholio::portalStudy($aristotelio, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Β Γυμνασίου');
        Scholio::portalStudy($aristotelio, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Γ Γυμνασίου');
        Scholio::portalStudy($aristotelio, 'Λύκειο', 'Γενική Παιδεία', 'Ά Λυκείου');
        Scholio::portalStudy($aristotelio, 'Λύκειο', 'Γενική Παιδεία', '΄Β Λυκείου');
        Scholio::portalStudy($aristotelio, 'Λύκειο', 'Γενική Παιδεία', '΄Γ Λυκείου');

        Scholio::portalSocial($aristotelio, 'facebook', 'https://www.facebook.com/aristotelio');
        Scholio::portalSocial($aristotelio, 'intagram', 'http://instagram.com/aristoteliokollegio');
        Scholio::portalSocial($aristotelio, 'twitter', 'http://twitter.com/aristotelioThes');
        Scholio::portalSocial($aristotelio, 'youtube', 'https://www.youtube.com/channel/UCX7f5qucX_qQDgsaxq20Qjg');
        Scholio::portalSocial($aristotelio, 'google', 'https://plus.google.com/u/0/106662055385826670321');

    }
}
