<?php

use Illuminate\Database\Seeder;
use App\Scholio\Scholio;
use Portal\Portal;

class Schools extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;

        /*===============  Εκπαιδευτήρια Βασιλειάδη ================*/
        $vas = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Βασιλειάδη (Γυμνάσιο)', 'email' => 'info@vassiliadis.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'vasileiadi'])->id,
            'address' => '12o χλμ Θεσ/νίκης-Μουδανιών, Θέρμη',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310475958,
            'type_id' => 13,
            'website' => 'vassiliadis.edu.gr',
            'approved' => 1,
            'about' => '<p><strong>Στα Εκπαιδευτήρια Βασιλειάδη</strong></p>
<ul>
<li><strong>Επικοινωνούμε</strong>: Επιδιώκουμε την ουσιαστική επικοινωνία μεταξύ διεύθυνσης, διδακτικού προσωπικού, γονέων και μαθητών. Η συνεργασία και η αλληλοκατανόηση αποκτούν ουσιαστικό περιεχόμενο στην τάξη, έξω απ’ αυτήν, αλλά και με τακτικές προγραμματισμένες συναντήσεις.</li>
<li><strong>Διδάσκουμε</strong>: Ένα άριστο επιτελείο καθηγητών αποτελεί το διδακτικό μας προσωπικό. Άνθρωποι που για χρόνια και με συνέπεια υπηρετούν την εκπαίδευση, διαθέτουν φροντιστηριακή πείρα, αλλά και την απαιτούμενη παιδαγωγική κατάρτιση, για να υποστηρίξουν κάθε ανάγκη του μαθητή.</li>
<li><strong>Υποστηρίζουμε</strong>: Παρέχουμε στους μαθητές μας το βοηθητικό υλικό που απαιτείται για την καλύτερη προσέγγιση της διδακτέας ύλης: Σημειώσεις ανά μάθημα σε έντυπη και ηλεκτρονική μορφή, προηγμένη χρήση διαδραστικών πινάκων (smartboard), ηλεκτρονική εκπαιδευτική πλατφόρμα (moodle) και πρόσβαση στη δανειστική βιβλιοθήκη του σχολείου. Το σχολείο μας έχει προχωρήσει σε ενίσχυση του προγράμματος με πρόσθετες ώρες διδασκαλίας των πανελλαδικώς εξεταζόμενων μαθημάτων για τις τάξεις του Λυκείου, εξασφαλίζοντας περισσότερο χρόνο προετοιμασίας για τους μαθητές και απαλλάσσοντας τους γονείς από επιπρόσθετες οικονομικές δαπάνες.  </li>
<li><strong>Καινοτομούμε</strong>: Πρωτοστατήσαμε στην εισαγωγή της νέας τεχνολογίας στην εκπαιδευτική διαδικασία, εξοπλίζοντας όλες τις αίθουσες και τα εργαστήρια με διαδραστικούς πίνακες(smartboard). Συνεχίζουμε να πρωτοπορούμε αξιοποιώντας τις δυνατότητές τους στην ενεργοποίηση της προσοχής και της αφομοιωτικής ικανότητας των μαθητών μας. Η συνεχής επιμόρφωση όλων των εκπαιδευτικών μας στη χρήση Η/Υ και αντίστοιχων εκπαιδευτικών προγραμμάτων εγγυάται την ουσιαστική συμβολή των νέων εποπτικών μέσων στην αποτελεσματικότητα της διδασκαλίας.</li>
<li><strong>Ενθαρρύνουμε</strong>: Αφουγκραζόμαστε και κινητοποιούμε τη δημιουργικότητα των παιδιών από το επίπεδο της τάξης έως την εξειδικευμένη ενασχόληση στους ομίλους ενδιαφερόντων (clubs). Συμμετέχουμε ενεργά στους θεσμοθετημένους διαγωνισμούς με γνωστικό αλλά και πολιτιστικό-αθλητικό περιεχόμενο. Ενθαρρύνουμε τη συμμετοχή των μαθητών μας σε προγράμματα με κοινωνικό, οικολογικό και καλλιτεχνικό προσανατολισμό.</li>
<li><strong>Εμπνέουμε</strong>: Στοχεύουμε σε ένα σχολείο ανοιχτό στην κοινωνία. Επιδιώκουμε να διατηρούμε συνεχή επαφή με τα συμβαίνοντα στην κοινωνική πραγματικότητα σε τοπικό, εθνικό και διεθνές περιβάλλον.</li>
</ul>',
            'background' => $background,
        ]);

        new Portal($vas, 5, 'school');

        Scholio::portalStudy($vas, 'Γυμνάσιο', 'Γυμνάσιο', 'Ά Γυμνασίου');
        Scholio::portalStudy($vas, 'Γυμνάσιο', 'Γυμνάσιο', '΄Β Γυμνασίου');
        Scholio::portalStudy($vas, 'Γυμνάσιο', 'Γυμνάσιο', '΄Γ Γυμνασίου');
        Scholio::portalStudy($vas, 'Λύκειο', 'Λύκειο', 'Ά Λυκείου');
        Scholio::portalStudy($vas, 'Λύκειο', 'Λύκειο', '΄Β Λυκείου');
        Scholio::portalStudy($vas, 'Λύκειο', 'Λύκειο', '΄Γ Λυκείου');

        Scholio::portalSocial($vas, 'facebook', 'https://www.facebook.com/ekpaideftiria.vassiliadi/');
        Scholio::portalSocial($vas, 'instagram', 'https://www.instagram.com/vassiliadis.school/');
        Scholio::portalSocial($vas, 'youtube', 'https://www.youtube.com/user/VASSILIADISSCHOOL');
        Scholio::portalSocial($vas, 'google', 'https://plus.google.com/u/0/+%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%AE%CF%81%CE%B9%CE%B1%CE%92%CE%B1%CF%83%CE%B9%CE%BB%CE%B5%CE%B9%CE%AC%CE%B4%CE%B7');

        /*===============  Εκπαιδευτήρια Φρυγανιώτη ================*/
        $fryg = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Φρυγανιώτη', 'email' => 'info@fryganiotis.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'fryganioti'])->id,
            'address' => 'Περιοχή Νοσ. Παπαγεωργίου, Πολίχνη',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310692940,
            'type_id' => 13,
            'website' => 'fryganiotis.gr',
            'approved' => 1,
            'about' => '<h2>Φιλοσοφία</h2>
<p>Είναι δύσκολο για μας να περιγράψουμε μέσα σε λίγες γραμμές, την πολυσύνθετη προσπάθειά μας, για να καλλιεργήσουμε πνευματικά, μορφωτικά και ηθικά τα παιδιά μας. Οι στόχοι μας υπαγορεύονται από την <strong>αγάπη,</strong> τον <strong>ανθρώπινο χαρακτήρα</strong> και την <strong>επιστημονική πληρότητα</strong>.</p>
<div>
<p><br />Η <strong>ελεύθερη σκέψη</strong>, η <strong>κριτική ικανότητα</strong>, το <strong>δημιουργικό πνεύμα</strong>, ο <strong>σεβασμός για το περιβάλλον και τον άνθρωπο</strong> αποτελούν κατευθυντήριες έννοιες της σχολικής καθημερινότητας στα Εκπαιδευτήριά μας. Προσφέρουμε στους μαθητές μας υψηλής ποιότητας παιδεία, προσαρμοσμένη στις ανάγκες του κάθε παιδιού.<br /><br />Επιδιώκουμε με κάθε τρόπο να αναγνωρίσουμε και <strong>να αναδείξουμε τις ιδιαίτερες ικανότητες του κάθε μαθητή</strong>. Για μας το παιδί δεν είναι θεατής, αλλά ενεργός συμμέτοχος στην εκπαιδευτική διαδικασία. Προετοιμάζουμε σκεπτόμενους πολίτες που με τις γνώσεις και το ήθος τους θα είναι έτοιμοι να αντιμετωπίζουν τις προκλήσεις των καιρών.</p>
<p>Το <strong>φιλικό και ζεστό περιβάλλον</strong> των Εκπαιδευτηρίων μας, αποτελεί πάντα σημαντικό παράγοντα στην υλοποίηση των στόχων μας. Με <strong>ιδιαίτερη στοργή</strong> και <strong>ενδιαφέρον</strong> σκύβουμε στις ανησυχίες και τις αναζητήσεις των νέων ανθρώπων, οπλίζοντάς τους με δύναμη και αισιοδοξία για τη ζωή.<br /><br />Πιστεύουμε ότι κάθε μορφωτικό αγαθό μπορεί να βλαστήσει μόνο μέσα από <strong>σχέσεις υγιείς και ευτυχισμένες,</strong> <strong>σχέσεις εμπιστοσύνης</strong> που μόνο στο <strong>οικογενειακό περιβάλλον που προσφέρουμε</strong> μπορούν να καλλιεργηθούν και με την προσωπική μας φροντίδα να καρποφορήσουν.</p>
</div>',
            'background' => $background,
        ]);

        new Portal($fryg, 5, 'school');

        Scholio::portalStudy($fryg, 'Παιδικός Σταθμός', 'Παιδικός Σταθμός', 'Παιδικός Σταθμός');
        Scholio::portalStudy($fryg, 'Νηπιαγωγείο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($fryg, 'Νηπιαγωγείο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($fryg, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($fryg, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($fryg, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($fryg, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($fryg, 'Δημοτικό', 'Γενική Παιδεία', '΄Έ Δημοτικού');
        Scholio::portalStudy($fryg, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');

        Scholio::portalStudy($fryg, 'Γυμνάσιο', 'Γενική Παιδεία', 'Ά Γυμνασίου');
        Scholio::portalStudy($fryg, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Β Γυμνασίου');
        Scholio::portalStudy($fryg, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Γ Γυμνασίου');
        Scholio::portalStudy($fryg, 'Λύκειο', 'Γενική Παιδεία', 'Ά Λυκείου');
        Scholio::portalStudy($fryg, 'Λύκειο', 'Γενική Παιδεία', '΄Β Λυκείου');
        Scholio::portalStudy($fryg, 'Λύκειο', 'Γενική Παιδεία', '΄Γ Λυκείου');

        Scholio::portalSocial($fryg, 'facebook', 'https://www.facebook.com/pages/%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%A6%CF%81%CF%85%CE%B3%CE%B1%CE%BD%CE%B9%CF%8E%CF%84%CE%B7/177952078968022');
        Scholio::portalSocial($fryg, 'twitter', 'https://twitter.com/Fryganiotis');
        Scholio::portalSocial($fryg, 'google', 'https://plus.google.com/115516704175748625108');
        Scholio::portalSocial($fryg, 'youtube', 'http://www.youtube.com/user/Fryganiotis');

        /*===============  Εκπαιδευτήρια Απόστολος Παύλος  ================*/
        $eap = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Απόστολος Παύλος', 'email' => 'gymnasio@eap.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'eap'])->id,
            'address' => 'Κένεντι 119, Πυλαία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310329540,
            'type_id' => 13,
            'website' => 'eap.edu.gr',
            'approved' => 1,
            'about' => '<p>Τα Εκπαιδευτήρια «Ο Απόστολος Παύλος» ιδρύθηκαν <strong>το 1976</strong> από τον μακαριστό Μητροπολίτη Θεσσαλονίκης <strong>πατέρα Λεωνίδα Παρασκευόπουλο </strong>, ο οποίος οραματίστηκε για την αγαπημένη του Θεσσαλονίκη ένα σχολείο που θα κάλυπτε όλες τις βαθμίδες και θα παρείχε στους μαθητές του άριστη μόρφωση αλλά και χριστιανική αγωγή ψυχής.<br />Η επιθυμία του αειμνήστου πατρός βρήκε ένθερμους υποστηρικτές οι οποίοι με ζήλο και αυταπάρνηση υλοποίησαν το όραμα. Ο ιεραποστολικός σύλλογος της Θεσσαλονίκης<strong> "Απόστολος Παύλος" </strong>ανέλαβε την ευθύνη αυτού του έργου, την οποία έχει ως σήμερα. Πρώτα λειτούργησε ένα τμήμα του Νηπιαγωγείου με την ονομασία «Κυκλάμινα». Σιγά-σιγά ολοκληρώθηκαν οι τάξεις του Δημοτικού, του Γυμνασίου και του Λυκείου.</p>
<p><strong>Παιδικός Σταθμός, </strong>δύο<strong> Νηπιαγωγεία, </strong>δύο <strong>Δημοτικά Σχολεία, </strong>δύο<strong> Γυμνάσια </strong>και το <strong>Λύκειο </strong>λειτουργούν σήμερα και έχουν φιλοξενήσει εκατοντάδες μαθητές παρέχοντας εξαιρετικού επιπέδου μόρφωση και αγωγή. Το Σχολείο αγαπήθηκε από τους Θεσσαλονίκεις, οι οποίοι με εμπιστοσύνη «ακούμπησαν» σ’ αυτό τα παιδιά τους.</p>
<p>Με ταχύτατο ρυθμό αναπτύχθηκαν οι κτιριακές εγκαταστάσεις σ\' έναν χώρο μοναδικής θέσης και ομορφιάς στους πρόποδες του Πανοράματος που έχει το προνόμιο να είναι κατάφυτος. Το 1980 εγκαινιάστηκε το κτίριο του Δημοτικού Σχολείου από το ιδρυτή των Εκπαιδευτηρίων μας π. Λεωνίδα ο οποίος συγκινημένος έβλεπε να υλοποιείται το όραμά του, το 1983 ολοκληρώθηκε και εγκαινιάστηκε το κτίριο που στεγάζει το Γυμνάσιο, το 1992 το κτίριο του Λυκείου, το 2003 εγκαινιάστηκε νέο κτίριο νηπιαγωγείων και το 2006 νέο δεύτερο κτίριο Δημοτικού σχολείου. Αίθουσες τελετών, γυμναστήρια, γήπεδα και πολύ άνετοι προαύλιοι χώροι συμπληρώνουν τις εγκαταστάσεις.</p>',
            'background' => $background,
        ]);

        new Portal($eap, 5, 'school');

        Scholio::portalStudy($eap, 'Παιδικός Σταθμός', 'Παιδικός Σταθμός', 'Παιδικός Σταθμός');
        Scholio::portalStudy($eap, 'Νηπιαγωγείο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($eap, 'Νηπιαγωγείο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($eap, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($eap, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($eap, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($eap, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($eap, 'Δημοτικό', 'Γενική Παιδεία', '΄Έ Δημοτικού');
        Scholio::portalStudy($eap, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');

        Scholio::portalStudy($eap, 'Γυμνάσιο', 'Γενική Παιδεία', 'Ά Γυμνασίου');
        Scholio::portalStudy($eap, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Β Γυμνασίου');
        Scholio::portalStudy($eap, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Γ Γυμνασίου');
        Scholio::portalStudy($eap, 'Λύκειο', 'Γενική Παιδεία', 'Ά Λυκείου');
        Scholio::portalStudy($eap, 'Λύκειο', 'Γενική Παιδεία', '΄Β Λυκείου');
        Scholio::portalStudy($eap, 'Λύκειο', 'Γενική Παιδεία', '΄Γ Λυκείου');

        Scholio::portalSocial($eap, 'facebook', 'https://www.facebook.com/%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%9F-%CE%91%CF%80%CF%8C%CF%83%CF%84%CE%BF%CE%BB%CE%BF%CF%82-%CE%A0%CE%B1%CF%8D%CE%BB%CE%BF%CF%82-%CE%94%CE%B7%CE%BC%CE%BF%CF%84%CE%B9%CE%BA%CF%8C-183084695556876/');
        Scholio::portalSocial($eap, 'youtube', 'https://www.youtube.com/channel/UCsUqecWmvPDYEUe9Y2xxbow');
        Scholio::portalSocial($eap, 'blogger', 'http://eapdim.blogspot.gr/');

        /*===============  Αδαμάντιος Σχολή ok ================*/
        $adam = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Αδαμάντιος Σχολή', 'email' => 'info@adamantios.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'adamantios'])->id,
            'address' => 'Λεωφ. Γεωργικής Σχολής 44, Πυλαία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310472474,
            'type_id' => 13,
            'website' => 'adamantios.gr',
            'approved' => 1,
            'about' => '<p class="homePadRight">Η Αδαμάντιος Σχολή μέσα σ\' ένα ασφαλές περιβάλλον φροντίζει τους μαθητές της με αγάπη. Τους παρέχει πολύπλευρη εκπαίδευση και διαμορφώνει την προσωπικότητά τους.</p>
<p class="homePadRight">Tο προσωπικό μας είναι άριστα καταρτισμένο. Η εκπαιδευτική διαδικασία υποστηρίζεται με σύνολο εξειδικευμένων δασκάλων που καλλιεργούν και αναπτύσσουν τις δεξιότητες και τα χαρίσματα των μαθητών.</p>
<p class="homePadRight">Διδάσκονται τρεις ξένες γλώσσες, Αγγλικά, Γαλλικά και Γερμανικά, μέσα στις ώρες λειτουργίας του σχολικού προγράμματος. Στους νεοεγγραφόμενους μαθητές παραδίδονται μαθήματα ξένων γλωσσών για την ομαλή ένταξή τους στην τάξη. Επίσης, λαμβάνεται ιδιαίτερη μέριμνα για Δημιουργική Απασχόληση-Φύλαξη των παιδιών σε ώρες πέραν του ωρολογίου προγράμματος.</p>
<p class="homePadRight">Η συνεργασία Γονέων- Σχολείου αποτελεί βασικό παράγοντα της εκπαιδευτικής μας διαδικασίας. Η επίδοση και η διαγωγή των μαθητών μας αποτελεί καθημερινό μας μέλημα.</p>',
            'background' => $background,
        ]);

        new Portal($adam, 5, 'school');

        Scholio::portalStudy($adam, 'Παιδικός Σταθμός', 'Παιδικός Σταθμός', 'Παιδικός Σταθμός');
        Scholio::portalStudy($adam, 'Νηπιαγωγείο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($adam, 'Νηπιαγωγείο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($adam, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($adam, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($adam, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($adam, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($adam, 'Δημοτικό', 'Γενική Παιδεία', '΄Έ Δημοτικού');
        Scholio::portalStudy($adam, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');

        Scholio::portalSocial($adam, 'facebook', 'https://www.facebook.com/%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%9F-%CE%91%CF%80%CF%8C%CF%83%CF%84%CE%BF%CE%BB%CE%BF%CF%82-%CE%A0%CE%B1%CF%8D%CE%BB%CE%BF%CF%82-%CE%94%CE%B7%CE%BC%CE%BF%CF%84%CE%B9%CE%BA%CF%8C-183084695556876/');
        Scholio::portalSocial($adam, 'youtube', 'https://www.youtube.com/channel/UCsUqecWmvPDYEUe9Y2xxbow');
        Scholio::portalSocial($adam, 'blogger', 'http://eapdim.blogspot.gr/');

        /*===============   Αμερικανική Γεωργική Σχολή Θεσσαλονίκης================*/
        $afs = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Αμερικανική Γεωργική Σχολή Θεσσαλονίκης', 'email' => 'info@afs.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'afs'])->id,
            'address' => 'Μαρίνου Αντύπα 54, Θέρμη',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310492700,
            'type_id' => 13,
            'website' => 'www.afs.edu.gr',
            'approved' => 1,
            'about' => '<p>Η Αμερικανική Γεωργική Σχολή Θεσσαλονίκης είναι ένας ανεξάρτητος, μη κερδοσκοπικός εκπαιδευτικός οργανισμός, που ιδρύθηκε το 1904 στη Θεσσαλονίκη για να εξυπηρετήσει τις ανάγκες του πληθυσμού της Ελλάδος και των Βαλκανίων.
            Τα κύρια εκπαιδευτικά της τμήματα είναι η Πρωτοβάθμια Εκπαίδευση, η Δευτεροβάθμια Εκπαίδευση (Γενικό Λύκειο), η Σχολή Επαγγελματικής Εκπαίδευσης (Επαγγελματικό Λύκειο και Εκπαίδευση Ενηλίκων) και το Perrotis College of Agriculture, Environment and Life Sciences.
            Η Σχολή προετοιμάζει τους αποφοίτους της για ανάληψη κυρίαρχων ρόλων στην κοινωνική ζωή και για ποικίλες επαγγελματικές σταδιοδρομίες στη γεωργία, την επιστήμη και τη βιομηχανία τροφίμων μέσω της μάθησης αγροτικών και επιχειρηματικών πρακτικών που είναι οικονομικά βιώσιμες,
            φιλικές προς το περιβάλλον και κοινωνικά υπεύθυνες. Ο ιδρυτής της Σχολής, Dr. John Henry House, ήταν ένας πρακτικός ιδεαλιστής που πίστευε ότι η εκπαίδευση πρέπει να απευθύνεται σε ολόκληρο το άτομο: στο νου, στα χέρια και στην ψυχή.
            Μετά από περισσότερο από έναν αιώνα εφαρμογής του οράματος του ιδρυτή της, η Σχολή παραμένει προσηλωμένη στη δυναμική συνύπαρξη θεωρίας και πράξης σε όλα τα επίπεδα της γεωργίας και των επιστημών ζωής, σήμα κατατεθέν του οργανισμού.</p>',
            'background' => $background,
        ]);

        new Portal($afs, 5, 'school');

        Scholio::portalStudy($afs, 'Παιδικός Σταθμός', 'Παιδικός Σταθμός', 'Παιδικός Σταθμός');
        Scholio::portalStudy($afs, 'Νηπιαγωγείο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($afs, 'Νηπιαγωγείο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($afs, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($afs, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($afs, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($afs, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($afs, 'Δημοτικό', 'Γενική Παιδεία', '΄Έ Δημοτικού');
        Scholio::portalStudy($afs, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');
        Scholio::portalStudy($afs, 'Λύκειο', 'Λύκειο', 'Ά Λυκείου');
        Scholio::portalStudy($afs, 'Λύκειο', 'Λύκειο', '΄Β Λυκείου');
        Scholio::portalStudy($afs, 'Λύκειο', 'Λύκειο', '΄Γ Λυκείου');

        Scholio::portalSocial($afs, 'facebook', 'https://www.facebook.com/AmericanFarmSchoolThessaloniki');
        Scholio::portalSocial($afs, 'instagram', 'https://www.instagram.com/americanfarmschool/');
        Scholio::portalSocial($afs, 'flickr', 'https://www.flickr.com/photos/americanfarmschool/');
        Scholio::portalSocial($afs, 'youtube', 'https://www.youtube.com/user/AmericanFarmSchool?feature=mhee');

        /*===============   Αριστοτέλειο Κολλέγιο ok ================*/
        $aristotelio = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Αριστοτέλειο Κολλέγιο Θεσσαλονίκης', 'email' => 'lykeio@aristotelio.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'aristoteleioCollege'])->id,
            'address' => 'Τζων Κέννεντυ, Πυλαία',
            'city' => 'Θεσσαλονίκη',
            'phone' => 2310311711,
            'type_id' => 13,
            'website' => 'www.aristotelio.edu.gr',
            'approved' => 1,
            'about' => '<h2>Φιλοσοφία του Σχολείου</h2><h3>«ΣΤΟΥΣ ΓΟΝΕΙΣ ΟΦΕΙΛΟΜΕΝ ΤΟ ΖΗΝ, ΣΤΟΥΣ ΔΕ ΔΙΔΑΣΚΑΛΟΥΣ ΤΟ ΕΥ ΖΗΝ» ΜΕΓΑΣ ΑΛΕΞΑΝΔΡΟΣ, 356-323 Π.Χ.</h3><p>Καλλιεργώντας ένα θερμό συνεργατικό κλίμα μεταξύ εκπαιδευτικού, μαθητή και γονέων, το σχολείο μας λειτουργεί ως προέκταση της οικογένειας για τα παιδιά. Σεβόμενοι την προσωπικότητα και τις ιδιαίτερες πτυχές του χαρακτήρα του κάθε παιδιού μας ξεχωριστά, στοχεύουμε στην κοινωνικοποίηση του και του παρέχουμε ένα ζεστό, ιδανικό περιβάλλον μάθησης μέσα από τη βιωματική προσέγγιση, τις ευκαιρίες για αυτενέργεια και την επαφή με τις νέες τεχνολογίες. Με τη συμμετοχή μας σε πολλαπλές δράσεις πανελλήνιας, πανευρωπαϊκής ή παγκόσμιας εμβέλειας και τη συνεργασία μας με παγκοσμίου φήμης εκπαιδευτικούς φορείς, δίνεται η ευκαιρία στα παιδιά μας να καταστούν ενεργά μέλη της παγκόσμιας κοινότητας. Με σεβασμό στις παραδόσεις του τόπου μας αλλά με το βλέμμα στραμμένο στο μέλλον, δημιουργούμε ένα σχολείο «ανοιχτών οριζόντων» που επιδιώκει την ολόπλευρη ανάπτυξη των μαθητών μας. Μ’ αυτόν τον τρόπο αναδεικνύουμε την ανθρωποκεντρική μας προσέγγιση που οδηγεί στην επιτυχία.

</p> <h2>Ιστορία του Σχολείου</h2> <h3>ΣΥΝΕΧΗΣ ΠΑΡΟΥΣΙΑ ΣΤΟ ΧΩΡΟ ΤΗΣ ΕΚΠΑΙΔΕΥΣΗΣ ΑΠΟ ΤΟ 1967 ΩΣ ΣΗΜΕΡΑ
</h3> <p>Το Αριστοτέλειο Κολλέγιο είναι ένας πολυδύναμος και πολυεπίπεδος διεθνώς αναγνωρισμένος εκπαιδευτικός οργανισμός με έδρα τη Θεσσαλονίκη που μετρά πάνω από μισό αιώνα εκπαιδευτικής παρουσίας. Αποτελεί την εκπαιδευτική συνέχεια των «Εκπαιδευτηρίων Γκροζούδη» που ιδρύθηκαν το 1967 ενώ την τελική του ονομασία έλαβε το 1980 όταν και η έδρα του σχολείου μεταφέρθηκε στους Δήμους Πανοράματος και Πυλαίας. Σήμερα, το Αριστοτέλειο Κολλέγιο εξακολουθεί να είναι ένα από τα πιο δραστήρια εκπαιδευτικά ιδρύματα της χώρας στο οποίο λειτουργούν ευδόκιμα όλες οι βαθμίδες της Πρωτοβάθμιας και Δευτεροβάθμιας εκπαίδευσης (Παιδικός Σταθμός, Νηπιαγωγείο, Δημοτικό, Γυμνάσιο και Λύκειο). Στο διάστημα των τελευταίων ετών, πέρα από την απόλυτη επιτυχία των μαθητών του σε πανεπιστημιακά ιδρύματα της Ελλάδας και του εξωτερικού, το σχολείο διακρίθηκε σε πολιτιστικές και αθλητικές δράσεις σε πανελλήνιο και παγκόσμιο επίπεδο έχοντας ταυτόχρονα επιδείξει κοινωνική ευαισθησία στον καιρό της κρίσης.

</p>',
            'background' => $background,
        ]);

        new Portal($aristotelio, 5, 'school');

        Scholio::portalStudy($aristotelio, 'Παιδικός Σταθμός', 'Παιδικός Σταθμός', 'Παιδικός Σταθμός');
        Scholio::portalStudy($aristotelio, 'Νηπιαγωγείο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($aristotelio, 'Νηπιαγωγείο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($aristotelio, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($aristotelio, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($aristotelio, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($aristotelio, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($aristotelio, 'Δημοτικό', 'Γενική Παιδεία', '΄Έ Δημοτικού');
        Scholio::portalStudy($aristotelio, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');

        Scholio::portalStudy($aristotelio, 'Γυμνάσιο', 'Γενική Παιδεία', 'Ά Γυμνασίου');
        Scholio::portalStudy($aristotelio, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Β Γυμνασίου');
        Scholio::portalStudy($aristotelio, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Γ Γυμνασίου');
        Scholio::portalStudy($aristotelio, 'Λύκειο', 'Γενική Παιδεία', 'Ά Λυκείου');
        Scholio::portalStudy($aristotelio, 'Λύκειο', 'Γενική Παιδεία', '΄Β Λυκείου');
        Scholio::portalStudy($aristotelio, 'Λύκειο', 'Γενική Παιδεία', '΄Γ Λυκείου');

        Scholio::portalSocial($aristotelio, 'facebook', 'https://www.facebook.com/aristotelio');
        Scholio::portalSocial($aristotelio, 'instagram', 'http://instagram.com/aristoteliokollegio');
        Scholio::portalSocial($aristotelio, 'twitter', 'http://twitter.com/aristotelioThes');
        Scholio::portalSocial($aristotelio, 'youtube', 'https://www.youtube.com/channel/UCX7f5qucX_qQDgsaxq20Qjg');
        Scholio::portalSocial($aristotelio, 'google', 'https://plus.google.com/u/0/106662055385826670321');


        // /*===============  PLATON ok ===============*/
        $platon = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια ΠΛΑΤΩΝ', 'email' => 'mail@platon.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'platonKat'])->id,
            'address' => 'Γανόχωρα-Κατερίνη, Πιερία',
            'city' => 'Κατερίνη',
            'phone' => 2351031111,
            'type_id' => 13,
            'website' => 'www.platon.edu.gr',
            'approved' => 1,
            'about' => '<h3>Οραματιστήκαμε και λειτουργούμε ένα σχολείο που η αποστολή του είναι</h3>:

            <li>Η καλλιέργεια του πνεύματος με την αναζήτηση γνώσεων μέσα από ατομική και ομαδική δημιουργία.</li>

            <li>Η διαμόρφωση χαρακτήρων που θα αποδέχονται και θα στηρίζουν τις κοινωνικές αξίες.</li>

            <li>Η διάπλαση υγιούς σώματος μέσα από τη δυναμική πλούσιων αθλητικών προγραμμάτων. Η υποστήριξη των μαθητών να αποκτήσουν αυτογνωσία, να παίρνουν αποφάσεις μόνοι τους, να επικοινωνούν με τους συνανθρώπους τους, να προετοιμαστούν για το μέλλον τους και να νοιώθουν ευτυχείς.</li>',
            'background' => $background,
        ]);

        new Portal($platon, 5, 'school');

        Scholio::portalStudy($platon, 'Παιδικός Σταθμός', 'Παιδικός Σταθμός', 'Παιδικός Σταθμός');
        Scholio::portalStudy($platon, 'Νηπιαγωγείο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($platon, 'Νηπιαγωγείο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($platon, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($platon, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($platon, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($platon, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($platon, 'Δημοτικό', 'Γενική Παιδεία', 'Έ Δημοτικού');
        Scholio::portalStudy($platon, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');

        Scholio::portalStudy($platon, 'Γυμνάσιο', 'Γενική Παιδεία', 'Ά Γυμνασίου');
        Scholio::portalStudy($platon, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Β Γυμνασίου');
        Scholio::portalStudy($platon, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Γ Γυμνασίου');
        Scholio::portalStudy($platon, 'Λύκειο', 'Γενική Παιδεία', 'Ά Λυκείου');
        Scholio::portalStudy($platon, 'Λύκειο', 'Γενική Παιδεία', '΄Β Λυκείου');
        Scholio::portalStudy($platon, 'Λύκειο', 'Γενική Παιδεία', '΄Γ Λυκείου');

        Scholio::portalSocial($platon, 'facebook', 'https://www.facebook.com/PlatonSchools');
        Scholio::portalSocial($platon, 'twitter', 'https://twitter.com/PlatonSchools');




        /*===============   axion ok ================*/



        $axion = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'ΑΞΙΟΝ', 'email' => 'info@axion.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'axion'])->id,
            'address' => 'Άβδηρα',
            'city' => 'Ξάνθη',
            'phone' => 2541081130,
            'type_id' => 13,
            'website' => 'axion.edu.gr',
            'approved' => 1,
            'about' => 'Στο σχολείο ο μαθητής μαθαίνει να χειρίζεται σωστά το χρόνο του, να σκέφτεται, να συγκεντρώνει τη σκέψη του, να αποφασίζει, να οργανώνει τις εργασίες του και με τον ίδιο ρυθμό συνεχίζει στο σπίτι.
            Προσπαθούμε να δημιουργήσουμε μεθοδικούς, ικανούς και ανεξάρτητους μαθητές, να κάνουμε τη διαδικασία της μάθησης φιλική για τα παιδιά, να αγαπήσουν οι μαθητές μας το σχολείο.
            Έχουμε πρόθεση για ακόμα περισσότερες παρεμβάσεις, στην εκπαιδευτική διαδικασία, αφού διαπιστώσουμε ότι είναι αναγκαίες για την καλύτερη επίδοση των μαθητών μας.
            Πιστεύουμε ότι ένα σχολείο με υψηλές επιδόσεις μαθητών δείχνει ένα υψηλό επίπεδο εκπαίδευσης. Αυτή είναι η επιδίωξή μας.
            Δεν στοχεύουμε μόνο στις γνώσεις αλλά και στην ανάπτυξη δεξιοτήτων. Στόχος μας, να δημιουργήσουμε τους αυριανούς πολίτες του κόσμου, γιατί αυτό απαιτούν οι καιροί. Κι όλα αυτά μέσα σε ένα ασφαλές, οικογενειακό και στοργικό κλίμα.
            Η βιωματική μάθηση κυριαρχεί. Οι μαθητές κατανοούν καλύτερα όταν ερευνούν, ανακαλύπτουν, βιώνουν και γεμίζουν εμπειρίες. Κάθε εκπαιδευτικό πρόγραμμα συνοδεύεται από εκπαιδευτικές επισκέψεις και δράσεις εντός και εκτός σχολείου.
            Από εσάς τους γονείς ζητάμε συνεργασία, κατανόηση, εμπιστοσύνη και συμπαράσταση στα παιδιά σας. Να είστε δίπλα τους. Το έργο του μικρού μαθητή είναι δύσκολο. Μια ενθάρρυνση, μια επιβράβευση, είναι η καλύτερη συμπαράσταση από μέρους σας. Να πιστέψουμε στις ικανότητές του. Η απλή φράση “μπορείς, σου έχω εμπιστοσύνη παιδί μου” δίνει δύναμη και φτερά στο μικρό μαθητή.',
            'background' => $background,
        ]);

        new Portal($axion, 5, 'school');

        Scholio::portalStudy($axion, 'Νηπιαγωγείο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($axion, 'Νηπιαγωγείο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($axion, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($axion, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($axion, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($axion, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($axion, 'Δημοτικό', 'Γενική Παιδεία', '΄Έ Δημοτικού');
        Scholio::portalStudy($axion, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');

        Scholio::portalStudy($axion, 'Γυμνάσιο', 'Γενική Παιδεία', 'Ά Γυμνασίου');
        Scholio::portalStudy($axion, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Β Γυμνασίου');
        Scholio::portalStudy($axion, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Γ Γυμνασίου');
        Scholio::portalStudy($axion, 'Λύκειο', 'Γενική Παιδεία', 'Ά Λυκείου');
        Scholio::portalStudy($axion, 'Λύκειο', 'Γενική Παιδεία', '΄Β Λυκείου');
        Scholio::portalStudy($axion, 'Λύκειο', 'Γενική Παιδεία', '΄Γ Λυκείου');

        Scholio::portalSocial($axion, 'facebook', 'https://www.facebook.com/%CE%A3%CF%87%CE%BF%CE%BB%CE%B5%CE%AF%CE%B1-%CE%91%CE%9E%CE%99%CE%9F%CE%9D-AXION-Schools-246611032016806/');
        Scholio::portalSocial($axion, 'twitter', 'https://twitter.com/Axion4');
        Scholio::portalSocial($axion, 'youtube', 'https://www.youtube.com/channel/UC11WmM5zf7GX3ptY7GCIMdA');
        Scholio::portalSocial($axion, 'linkedin', 'https://www.linkedin.com/company/4874569?trk=tyah&trkInfo=clickedVertical:company,clickedEntityId:4874569,idx:2-1-2,tarId:1484250427961,tas:axion%20sc');



        /*===============  Aristoteleio Serres ok ================*/

        $aristoseres = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Αριστοτέλειο Εκπαιδευτήριο Σερρών', 'email' => 'info@aristotelio.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'aristoteleioserres'])->id,
            'address' => '6ο Χιλιόμετρο Σερρών-Δράμας',
            'city' => 'Σέρρες',
            'phone' => 2321051111,
            'type_id' => 13,
            'website' => 'www.aristotelio.gr',
            'approved' => 1,
            'about' => 'Εμείς οι ιδρυτές του «ΑΡΙΣΤΟΤΕΛΕΙΟΥ ΕΚΠΑΙΔΕΥΤΗΡΙΟΥ», ως μαχόμενοι εκπαιδευτικοί - φροντιστές, γνωρίσαμε την πραγματικότητα της Ελληνικής Εκπαίδευσης για μία 20ετία. Γνωρίσαμε από πρώτο χέρι όχι μόνο τα τρωτά της σημεία, τα αδιέξοδα και της αδυναμίες της, αλλά και εκείνους τους τρόπους που διευκόλυναν τους μαθητές μας να πετύχουν τους στόχους τους και να πραγματοποιήσουν τα όνειρά τους.

            Με την εμπειρία που αποκτήσαμε και τη φλόγα που ακόμα καίει μέσα μας για ένα Σχολείο όπως όλοι κάποτε το ονειρευτήκαμε δημιουργήσαμε το ΑΡΙΣΤΟΤΕΛΕΙΟ ΕΚΠΑΙΔΕΥΤΗΡΙΟ σαν τόπο μάθησης και καλλιέργειας των αυριανών πολιτών της πατρίδας μας.

            Δημιουργήσαμε ένα Σχολείο που διέπεται από μία συγκεκριμένη φιλοσοφία και ακολουθεί κάποιες βασικές αρχές.

            Σχολείο φιλικό προς τον μαθητή: Πράγματι εκείνο για το οποίο μπορούμε να καυχηθούμε χωρίς να το αμφισβητεί κανείς είναι, ότι σήμερα στο ΑΡΙΣΤΟΤΕΛΕΙΟ έχουμε μαθητές ευχαριστημένους που έρχονται καθημερινά στο Σχολείο με θετική ψυχολογία και διάθεση. Σε αυτό συντελούν οι σύγχρονες εγκαταστάσεις, οι καθηγητές και το υπόλοιπο προσωπικό καθώς και οι ποικίλες δραστηριότητες ψυχαγωγικές και πολιτιστικές που έχουν σκοπό να κάνουν τον μαθητή να νοιώσει ότι ξεφεύγει από την στείρα εκπαιδευτική διαδικασία. Ήταν πράγματι ένας πολύ μεγάλος στόχος τον οποίο πετύχαμε.
            Ελεύθερος χρόνος στον μαθητή: Ο σημερινός μαθητής όπως είναι γνωστό και εφόσον βέβαια προσπαθεί να ανταποκριθεί στις υποχρεώσεις του είναι ο πιο σκληρά εργαζόμενος πολίτης. Και τούτο γιατί είναι υποχρεωμένος για να ξεπεράσει τις αδυναμίες του σημερινού Ελληνικού Σχολείου αλλά και για να ανταπεξέλθει στον σκληρό ανταγωνισμό να καταφεύγει τα απογεύματα στα παντός είδους φροντιστήρια με αποτέλεσμα να υπάρχει ελάχιστος χρόνος για την απαραίτητη μελέτη και φυσικά καθόλου ελεύθερος προσωπικός χρόνος με ότι συνεπάγονται τα παραπάνω. Ο στόχος μας λοιπόν ήταν:
            o Ένα ολοήμερο σχολείο που θα εκμηδένιζε την ανάγκη για απογευματινά φροντιστήρια.
            o Στο Σχολείο μας λοιπόν οι μαθητές προετοιμάζονται από τους πλέον έμπειρους καθηγητές είτε για τις Πανελλήνιες Εξετάσεις, είτε για τα πτυχία των Ξένων Γλωσσών, είτε για τα πτυχία της Πληροφορικής χωρίς να ξοδεύουν χρόνο και επί πλέον χρήματα τα απογεύματα για Φροντιστήρια και ιδιαίτερα μαθήματα.
            Τώρα μπορούμε να καυχηθούμε ότι πετύχαμε τον στόχο μας και μάλιστα με αποτελέσματα εντυπωσιακά.
            Πειθαρχία: Το Σχολείο μας μακριά από τα σημερινά φαινόμενα που ζει το σημερινό Ελληνικό Σχολείο (καταλήψεις, απεργίες) και υιοθετώντας ένα σύστημα πειθαρχίας προσπαθεί να παντρέψει το Παραδοσιακό Σχολείο από το οποίο περάσαμε οι παλαιότεροι με το σύγχρονο φιλελεύθερο πνεύμα της εποχής μας δίνοντας στους μαθητές μας το αίσθημα της ασφάλειας που είναι απαραίτητο για να επιτελούν απερίσπαστοι το καθήκον τους.',
            'background' => $background,
        ]);

        new Portal($aristoseres, 5, 'school');

        Scholio::portalStudy($aristoseres, 'Γυμνάσιο', 'Γενική Παιδεία', 'Ά Γυμνασίου');
        Scholio::portalStudy($aristoseres, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Β Γυμνασίου');
        Scholio::portalStudy($aristoseres, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Γ Γυμνασίου');
        Scholio::portalStudy($aristoseres, 'Λύκειο', 'Γενική Παιδεία', 'Ά Λυκείου');
        Scholio::portalStudy($aristoseres, 'Λύκειο', 'Γενική Παιδεία', '΄Β Λυκείου');
        Scholio::portalStudy($aristoseres, 'Λύκειο', 'Γενική Παιδεία', '΄Γ Λυκείου');

        Scholio::portalSocial($aristoseres, 'facebook', 'http://www.facebook.com/aristotelioekpaideutirio/');
        Scholio::portalSocial($aristoseres, 'blogger', 'http://aristotelioserron.blogspot.com/');



        /*===============   promitheas ok ================*/

        $promitheas = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Ιδιωτικά Εκπαιδευτήρια Προμηθέας', 'email' => 'info@promitheas.edu.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'promitheas'])->id,
            'address' => 'Βενιζέλου & Χατζή, Νέα Ιωνία ',
            'city' => 'Βόλος',
            'phone' => 2421064888,
            'type_id' => 13,
            'website' => 'promitheas.edu.gr',
            'approved' => 1,
            'about' => 'Στις 12 Σεπτεμβρίου 2012 άνοιξαν τις πύλες τους στους μαθητές τα Ιδιωτικά Εκπαιδευτήρια Βόλου «Προμηθέας» . Με σύγχρονες εκπαιδευτικές εγκαταστάσεις και τεχνολογικά μέσα, εξειδικευμένους καθηγητές και πολύπλευρο παιδαγωγικό έργοπροσφέρουμε :

            <li>Εκπαίδευση με προοπτική και αγάπη για το μαθητή</li>
            <li>Εντατικά προγράμματα διδασκαλίας</li>
            <li>Ενδοσχολική μελέτη</li>
            <li>Εκμάθηση ξένων γλωσσών (Αγγλικά-Γαλλικά-Γερμανικά)</li>
            <li>Μύηση στα Γράμματα – Τέχνες – Επιστήμες</li>
            <li>Πλούσιο αθλητικό πρόγραμμα σε ιδιόκτητες αθλητικές εγκαταστάσεις</li>
            <li>Σε ένα περιβάλλον απόλυτα προσαρμοσμένο στις σύγχρονες εκπαιδευτικές και παιδαγωγικές ανάγκες, το ιδιωτικό σχολείο παρέχει εκπαιδευτικές υπηρεσίες υψηλής ποιότητας. Το σχολείο διαθέτει τα πιο σύγχρονα τεχνολογικά μέσα στον τομέα της εκπαίδευσης, σύγχρονο εργαστήριο φυσικών επιστημών και αίθουσα τεχνολογίας και Η/Υ.</li>



            <li>ΜΑΘΗΤΟΚΕΝΤΡΙΚΗ μάθηση</li>
            <li>Δημιουργική προσέγγιση της γνώσης</li>
            <li>Γνωστική επάρκεια των μαθητών</li>
            <li>Σφαιρική προσέγγιση των γνωστικών αντικειμένων</li>
            <li>Διαθεματική και βιωματική προσέγγιση της γνώσης</li>
            <li>Γνωριμία με πολιτισμούς και κουλτούρες άλλων ευρωπαϊκών χωρών, μέσα από τη συνεργασία του σχολείου με άλλα σχολεία του εξωτερικού και με ανταλλαγές μαθητών, μέσω ευρωπαϊκών προγραμμάτων.</li>
            <li>Ανάπτυξη των ιδιαίτερων δεξιοτήτων των μαθητών στους ειδικά διαμορφωμένους χώρους του σχολείου από το εξειδικευμένο προσωπικό</li>
            <li>Στόχος μας είναι η ανάπτυξη ολοκληρωμένων προσωπικοτήτων μέσα σε κλίμα άριστης συνεργασίας εκπαιδευτικών – μαθητών – γονέων</li>',
            'background' => $background,
        ]);

        new Portal($promitheas, 5, 'school');

        Scholio::portalStudy($promitheas, 'Γυμνάσιο', 'Γενική Παιδεία', 'Ά Γυμνασίου');
        Scholio::portalStudy($promitheas, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Β Γυμνασίου');
        Scholio::portalStudy($promitheas, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Γ Γυμνασίου');
        Scholio::portalStudy($promitheas, 'Λύκειο', 'Γενική Παιδεία', 'Ά Λυκείου');
        Scholio::portalStudy($promitheas, 'Λύκειο', 'Γενική Παιδεία', '΄Β Λυκείου');
        Scholio::portalStudy($promitheas, 'Λύκειο', 'Γενική Παιδεία', '΄Γ Λυκείου');

        Scholio::portalSocial($promitheas, 'facebook', 'https://www.facebook.com/promitheas.edu/');



        /*=============== Mpakogianni ok ================*/

        $bakogiannis = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Εκπαιδευτήρια Ν.Μπακογιάννη', 'email' => 'mail@lyk-nmpakog.lar.sch.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'mpakogianni'])->id,
            'address' => '1ο χιλιόμετρο περιφερειακής Τρικάλων – Λάρισα',
            'city' => 'Λάρισα',
            'phone' => 2410624424,
            'type_id' => 13,
            'website' => 'ekpmpakogianni.gr',
            'approved' => 1,
            'about' => 'Ο  ρόλος του σχολείου σήμερα, στο πλαίσιο των ευρύτερων, κοινωνικών, επιστημονικών και τεχνολογικών αλλαγών, έχει μεταβληθεί σημαντικά σε σχέση με τη βιωματική εικόνα που έχουμε όλοι εμείς οι μεγαλύτεροι για το δημοτικό σχολείο ως εκπαιδευτική βαθμίδα.

            Γίνεται  φανερό ότι οι μαθητές μας σήμερα, και πολύ περισσότερο αύριο, χρειάζονται ένα σύγχρονο, ρεαλιστικό και πολυδιάστατο «εξοπλισμό», συμβατό με την πολυπλοκότητα, τη δυναμική και τη μεταβλητότητα των συνθηκών του αύριο, τις οποίες θα κληθούν να αντιμετωπίσουν. Ταυτόχρονα, οι ίδιοι οι μαθητές θα πρέπει να αξιοποιήσουν αβίαστα το σύνολο του δυναμικού που διαθέτουν, να βοηθήσουν στην υιοθέτηση κινήτρων στη ζωή και τη δράση τους, καθώς και στη σταδιακή οικοδόμηση ενός συστήματος στάσεων και αξιών που να υποδηλώνει την αγωγή και την καλλιέργειά τους και να συμβάλλει τελικά στην ολόπλευρη και αρμονική ανάπτυξη της προσωπικότητας του κάθε παιδιού.
            Γι’ αυτό, λοιπόν, έχουμε σχεδιάσει και προχωρούμε σε ένα πολυδιάστατο, αποτελεσματικό και σύγχρονό εκπαιδευτικό πρόγραμμα που απαντά με πληρότητα στις ανάγκες των μαθητών και στηρίζεται σε σύγχρονα ερευνητικά δεδομένα των επιστημών αγωγής. Ένα πρόγραμμα ενιαίο και συνεκτικό από το Νηπιαγωγείο μέχρι το Λύκειο, ώστε να εξασφαλίζεται η συνέχεια και η σύνδεση της γνώσης μεταξύ των μαθημάτων από τάξη σε τάξη και από βαθμίδα σε βαθμίδα.  Συγχρόνως, δημιουργήσαμε ένα πρόγραμμα παιδαγωγικά διαφοροποιούμενο για να λαμβάνει υπόψη το διαφορετικό ρυθμό μάθησης των μαθητών, τα ιδιαίτερα χαρακτηριστικά της ομάδας, τη μοναδικότητα κάθε μαθητή και μαθήτριας. Έτσι η διδασκαλία γίνεται μια μη αυτοματοποιημένη διαδικασία, αφού η ομάδα τάξη νοείται ως άθροισμα διαφορετικοτήτων και όχι ως στατιστική προσέγγιση μιας θεωρητικής μέσης επίδοσης ή ενός, ουσιαστικά ανύπαρκτου  «μέσου μαθητή».
            Το πρόγραμμα είναι οργανωμένο σύμφωνα με τις πιο σύγχρονες μεθοδολογίες, οι οποίες καλλιεργούν το βιωματικό, συνεργατικό, μαθητοκεντρικό τρόπο μάθησης, ο οποίος αναπτύσσει όλες τις πλευρές της προσωπικότητας των παιδιών, τα  χειραφετεί,   τα δίνει τη δυνατότητα να ανακαλύπτουν μόνα τους τα κενά τους, να οργανώνουν τη μελέτη τους και εν τέλει να λειτουργούν ως αυτόνομα και υπεύθυνα άτομα. Αυτό θα δώσει τη δυνατότητα να λειτουργούν αργότερα ως υπεύθυνοι πολίτες που θα διαθέτουν τα εφόδια να συμμετέχουν ενεργά στην οικονομική, κοινωνική και πολιτιστική ζωή. Δίνει τη δυνατότητα να έρθουν σε επικοινωνία με την ιστορία μας, την πολιτιστική μας κληρονομιά, τη θρησκεία μας, την παράδοσή μας, να αποκτήσουν βαθύ σεβασμό για την ελληνική κληρονομιά, σεβόμενοι παράλληλα την ιστορία, τη θρησκεία και παράδοση και την πολιτιστική κληρονομιά των άλλων. Να γίνουν έτσι καλοί Έλληνες αλλά και πολίτες του κόσμου.
            ',
            'background' => $background,
        ]);

        new Portal($bakogiannis, 6, 'school');

        Scholio::portalStudy($bakogiannis, 'Νηπιαγωγείο', 'Νήπια', 'Νήπια');
        Scholio::portalStudy($bakogiannis, 'Νηπιαγωγείο', 'Προνήπια', 'Προνήπια');

        Scholio::portalStudy($bakogiannis, 'Δημοτικό', 'Γενική Παιδεία', 'Ά Δημοτικού');
        Scholio::portalStudy($bakogiannis, 'Δημοτικό', 'Γενική Παιδεία', '΄Β Δημοτικού');
        Scholio::portalStudy($bakogiannis, 'Δημοτικό', 'Γενική Παιδεία', '΄Γ Δημοτικού');
        Scholio::portalStudy($bakogiannis, 'Δημοτικό', 'Γενική Παιδεία', '΄Δ Δημοτικού');
        Scholio::portalStudy($bakogiannis, 'Δημοτικό', 'Γενική Παιδεία', '΄Έ Δημοτικού');
        Scholio::portalStudy($bakogiannis, 'Δημοτικό', 'Γενική Παιδεία', 'ΣΤ Δημοτικού');

        Scholio::portalStudy($bakogiannis, 'Γυμνάσιο', 'Γενική Παιδεία', 'Ά Γυμνασίου');
        Scholio::portalStudy($bakogiannis, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Β Γυμνασίου');
        Scholio::portalStudy($bakogiannis, 'Γυμνάσιο', 'Γενική Παιδεία', '΄Γ Γυμνασίου');
        Scholio::portalStudy($bakogiannis, 'Λύκειο', 'Γενική Παιδεία', 'Ά Λυκείου');
        Scholio::portalStudy($bakogiannis, 'Λύκειο', 'Γενική Παιδεία', '΄Β Λυκείου');
        Scholio::portalStudy($bakogiannis, 'Λύκειο', 'Γενική Παιδεία', '΄Γ Λυκείου');

        Scholio::portalSocial($bakogiannis, 'facebook', 'https://www.facebook.com/pages/%CE%95%CE%BA%CF%80%CE%B1%CE%B9%CE%B4%CE%B5%CF%85%CF%84%CE%AE%CF%81%CE%B9%CE%B1-%CE%9D%CE%9C%CF%80%CE%B1%CE%BA%CE%BF%CE%B3%CE%B9%CE%AC%CE%BD%CE%BD%CE%B7/264291897039643?fref=ts');
        Scholio::portalSocial($bakogiannis, 'youtube', 'https://www.youtube.com/channel/UCAIP6-e3dEP-qxjMc9Mma9Q');

    }

}
