<?php

return [

    'unverified' => 'Ανεπιβεβαίωτος Λογαριασμός',
    'unverifiedModal' => 'Ακολουθήστε το σύνδεσμο επιβεβαίωσης που σας έχει αποσταλεί στο email σας κατά την εγγραφή σας,
    ώστε να αποκτήσετε πλήρη δικαίωματα δημόσιας προβολής και αναζήτησης του εκπαιδευτικού σας φορέα.',
    'close'=>'Κλείσιμο',
    'tourStart'=>'Ξενάγηση',



    'menu' => [
        'profile' => 'Προφίλ',
        'settings' => 'Ρυθμίσεις',
        'logout' => 'Αποσύνδεση',
    ],

    'dashboard' => 'Πίνακας Ελέγχου',
    'management' => 'Διαχειριση',

    'resource' => [
        'title' => 'Δυναμικό',
        'students' => 'Μαθητές',
        'teachers' => 'Καθηγητές',
        'requests' => 'Αιτήσεις',
    ],

    'profile' => [
        'title' => 'Προφίλ',
        'settings' => 'Ρυθμίσεις Προφίλ',
        'contact' => 'Στοιχεία Επικοινωνίας',
        'studies' => 'Ειδικότητες',
        'photo' => 'Φωτογραφίες',
    ],

    'scholarships' => [
        'title' => 'Υποτροφίες',
        'settings' => 'Ρυθμίσεις Αιτήσεων',
        'add' => 'Δημιουργία Νέας',
        'show' => 'Προβολή',
        'admissions' => 'Αιτήματα',
    ],

    'settings' => [
        'title' => 'Ρυθμίσεις',
        'profile' => 'Δημόσιο Προφίλ',
        'admissions' => 'Αίτηση Υποτροφίας',
    ],

    'reviews' => [
        'title' => 'Αξιολογήσεις',
        'show' => 'Προβολή',
    ],





];
