<?php

return [

    'editCv' => 'Επεξεργασία Βιογραφικού',
    'titleText' => 'Συμπληρώστε τα στοιχεία επικοινωνίας σας και του βιογραφικού σας, για να διευκολυνθούν οι αιτήσεις υποτροφιών που θα πραγματοποιείσετε.',
    'selectPhoto' => 'Επιλογή φωτογραφίας προφίλ',
    'contactInfo' => 'Στοιχεία Επικοινωνίας Σπουδαστή',

    'editParentInfo' => 'Επεξεργασία Στοιχείων Γονέων/Κηδεμόνων',
    'textParentInfo' => 'Συμπληρώστε τα στοιχεία των γονέων/κηδεμόνων σας για να πραγματοποιήσεις τις αιτήσεις υποτροφιών σου.',
    'parentInfo' => 'Στοιχεία Γονέων και Κηδεμόνων',

    'details' => [
        'firstName' => 'Όνομα',
        'lastName' => 'Επώνυμο',
        'address' => 'Διεύθυνση',
        'city' => 'Πόλη / Περιοχή',
        'email' => 'Ηλεκτρονικό Ταχυδρομείο / email',
        'phone' => 'Τηλέφωνο',
        'gender' => 'Φύλο',
        'male' => 'Άνδρας',
        'female' => 'Γυναίκα',
        'dateOfBirth' => 'Ημερομηνία Γέννησης',
        'largeFamily' => 'Μέλος Πολύτεκνης Οικογένειας',
        'languages' => 'Ξένες Γλώσσες',
        'studies' => 'Προηγούμενες Σπουδές',
        'awards' => 'Έπαινοι - Διακρίσεις',
        'interests' => 'Ενδιαφέροντα - Ασχολίες',
        'certifications' => 'Πιστοποιήσεις - Σεμινάρια',
        'talents' => 'Σύνδεσμοι Ταλέντων',

    ],

    'yes' => 'Ναι',
    'no' => 'Όχι',
    'languagesInfo' => 'Γράψε τις ξένες γλώσσες που γνωρίζεις και το επίπεδο αυτών.',
    'studiesInfo' => 'Γράψε τις μέχρι τώρα σπουδές σου, τα εκπαιδευτικά ιδρύματα και το έτος αποφοίτησης, όπως φαίνονται στο παράδειγμα.',
    'awardsInfo' => 'Γράψε τις μέχρι τώρα διακρίσεις σου στις ξένες γλώσσες, στον αθλητισμό, στη μουσική, στις τέχνες ή σε προηγούμενες σπουδές σου.',
    'interestsInfo' => 'Γράψε τα ενδιαφέροντα, τις δεξιότητες και τα χόμπυ σου.',
    'certificationsInfo' => 'Γράψε τους τίτλους σεμιναρίων, που έχεις παρακολουθήσει.',
    'talentsInfo' => 'Γράψε παρακάτω τις πλατφόρμες, που χρησιμοποιείς (αθλητισμός, τέχνες, μαγειρική, ξένες γλώσσες, προγραμματισμός, ρομποτική, κ.ο.κ).',
    'saveChanges' => 'Αποθήκευση Στοιχείων',

];
