<?php

return [

    'editCv' => 'Επεξεργασία Βιογραφικού',
    'titleText' => 'Συμπληρώστε τα στοιχεία επικοινωνίας σας και του βιογραφικού σας, για να διευκολυνθούν οι αιτήσεις υποτροφιών που θα πραγματοποιείσετε.',
    'selectPhoto' => 'Επιλογή φωτογραφίας προφίλ',
    'contactInfo' => 'Στοιχεία Επικοινωνίας Σπουδαστή',


    'editParentInfo' => 'Επεξεργασία Στοιχείων Γονέων και Κηδεμόνων',
    'textParentInfo' => 'Συμπληρώστε τα στοιχεία των γονέων και κηδεμόνων σας για να πραγματοποιείσετε αιτήσεις υποτροφιών πιο εύκολα.',
    'parentInfo' => 'Στοιχεία Γονέων και Κηδεμόνων',



    'details' => [
        'firstName' => 'Όνομα',
        'lastName' => 'Επώνυμο',
        'address' => 'Διεύθυνση',
        'city' => 'Πόλη / Περιοχή',
        'email' => 'Ηλεκτρονικό Ταχυδρομείο / email',
        'phone' => 'Τηλέφωνο',
        'gender' => 'Φύλο',
        'male' => 'Άνδρας',
        'female' => 'Γυναίκα',
        'dateOfBirth' => 'Ημερομηνία Γέννησης',
        'largeFamily' => 'Μέλος Πολύτεκνης Οικογένειας',
        'languages' => 'Ξένες Γλώσσες',
        'studies' => 'Προηγούμενες Σπουδές',
        'awards' => 'Έπαινοι - Διακρίσεις',
        'interests' => 'Ενδιαφέροντα - Ασχολίες',
        'certifications' => 'Πιστοποιήσεις - Σεμινάρια',
        'talents' => 'Σύνδεσμοι Ταλέντων',

    ],


    'yes' => 'Ναι',
    'no' => 'Όχι',
    'languagesInfo' => 'Γράψε τις ξένες γλώσσες που μιλάς και σε πoιο επίπεδο.',
    'studiesInfo' => 'Γράψε τις μέχρι τώρα σπουδές σου, τα εκπαιδευτικά ιδρύματα και το έτος αποφοίτησης, όπως φαίνονται στο επόμενο παράδειγμα.',
    'awardsInfo' => 'Γράψε τις μέχρι τώρα διακρίσεις σου στις ξένες γλώσσες, στον αθλητισμό, στη μουσική, στις τέχνες ή σε προηγούμενες σπουδές σου.',
    'interestsInfo' => 'Γράψε τα ενδιαφέροντα - ασχολίες',
    'certificationsInfo' => 'Ανέφερε τις πιστοποιήσεις και τα σεμηνάρια που εχεις παρακολουθησει.',
    'talentsInfo' => 'Γράψε παρακάτω για τις πλατφόρμες που χρησιμοποιείς, τους συνδέσμους που παρουσίαζουν τα ιδιαίτερα ταλέντα σου και τις ξεχωριστές ικανότητές σου
    σε κάποιο τομέα του αθλητισμού, των τέχνων, της μαγειρικής, των ξένων γλωσσών, του προγραμματισμού, της ρομποτικής ή οπουδήποτε αλλού πιστεύεις πως διακρίνεσαι.',
    'saveChanges' => 'Αποθήκευση Στοιχείων',


];
