<?php

return [

    'review' =>[
        'leave' => 'Αξιολόγηση',
        'left' => 'Έχετε ήδη αφήσει αξιολογήση',
        'text' => 'Γράψτε τα σχόλια σας για το εκπαιδευτικό ίδρυμα',
        'save' => 'Αποθήκευση',
        'write' => 'Έχεις γράψει',
        'until' => ' αξιολογήσεις μέχρι τώρα.',
    ],

    'scholarships' =>[
        'have' => 'Έχεις ακόμη ',
        'available' => ' διαθέσιμες αιτήσεις υποτροφιών.',
        'done' => 'Έχεις πραγματοποιήσει ',
        'applications' => ' αιτήματα.',
        'received' => 'Δέχθηκε',
        'expires' => 'Λήγει',
        'expired' => 'Έληξε',
        'liked' => 'Έχεις ενδιαφερθεί για ',
        'scholarships' => ' υποτροφίες. ',

    ],


    'schools' =>[
        'connect' => 'Έχεις συνδεθεί με',
        'until' => ' εκπαιδευτικά ιδρύματα μέχρι τώρα.',
    ],




];
