<?php

use App\Models\School;
use App\Scholio\Scholio;
use Illuminate\Database\Seeder;
use Portal\Portal;

class XorosThess extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $background = Portal::createImages('/upload/school/univ.png')->id;

        /*===============   svigka   ================*/
        $s = factory(App\Models\School::class)->create([
            'user_id' => factory(App\User::class)->create(['name' => 'Σχολή Χορού Αγγελική Σβήγκα', 'email' => 'info@svigka.gr', 'password' => bcrypt('123456'), 'role' => 'school', 'username' => 'svigka'])->id,
            'address' => 'Δορυλαίου 57 & Αμφιπόλεως',
            'city' => 'Θεσσαλονίκη',
            'region' => 'Τούμπα',
            'phone' => 2310936355,
            'type_id' => 10,
            'website' => 'svigka.gr',
            'approved' => 1,
            'about' => 'Το 1983 ξεκινούν τα πρώτα βήματα της Σχολής. Αρχίζουν να συγκεντρώνονται οι πρώτοι μαθητές που λαχταρούν να μάθουν την τέχνη του χορού, την ευγενή αυτή έκφραση της κίνησης και των συναισθημάτων.

            Κατά τη διάρκεια αυτής της διαδρομής,εδώ και σχεδόν τρείς δεκαετίες, πέρασαν πολλοί μαθητές από τη σχολή. Παιδιά που αγάπησαν το χορό,παιδιά που ασχολήθηκαν επαγγελματικά με το χορό και απέκτησαν μέσα από τη Σχολή γερές βάσεις για να ολοκληρώσουν τις σπουδές τους και να ξεκινήσουν το δικό τους "ταξίδι". Παιδιά που μεγάλωσαν και  έγιναν γονείς και που μας εμπιστεύτηκαν με τη σειρά τους τα δικά τους παιδιά.
            
            Το κάθε παιδί είναι μια μοναδική προσωπικότητα, ένας υπερευαίσθητος δέκτης που καταγράφει κάθε ερέθισμα υπό το πρίσμα της σκέψης και των συναισθημάτων του. Αυτός είναι και ο λόγος που η διδασκαλία του χορού καθώς και ο τρόπος επικοινωνίας με το παιδί απαιτεί ευαισθησία και υπευθυνότητα.Θέλουμε τα παιδιά μας να είναι χαρούμενα και ευτυχισμένα!
            
            Στόχος μας είναι να είμαστε πάντα κοντά στα παιδιά και τις ανάγκες τους δίνοντας μεγάλη προσοχή στη σωματική τους ασφάλεια ,να τα καθοδηγούμε στον όμορφο κόσμο του χορού με σοβαρότητα και σεβασμό στην προσωπικότητά τους και να προσφέρουμε τις υπηρεσίες μας στον χώρο του πολιτισμού.
            
            Δάσκαλοι με αναγνωρισμένο δίπλωμα από το Υπουργείο Πολιτισμού,με γνώση και εμπειρία διδάσκουν σκύβοντας με αγάπη και προσοχή πάνω από κάθε παιδί ξεχωριστά.
            
            Η Σχολή Χορού Χορού της Αγγελικής Σβήγκα είναι αναγνωρισμένη από το Υπουργείο Πολιτισμού σύμφωνα με το νόμο 1158/81 και Π.Δ. 457/83, είναι μέλος του Σωματείου Ιδιωτικών Σχολών Χορού Ελλάδος.(Σ.Ι.Σ.Χ.Ε.) και μέλος του CID -  UNESCO (Διεθνές Συμβούλιο Χορού).
            
            Ευχαριστούμε όλους τους γονείς που στηρίζουν όλα αυτά τα χρόνια το έργο μας,που  δείχνουν την εκτίμηση στην ποιότητα της δουλειάς μας,  και κυρίως που μας εμπιστεύονται τα παιδιά τους.
            
            <br> “Άνοιξα μια μεγάλη, μια πολύ μεγάλη αγκαλιά και έβαλα μέσα ότι πολυτιμότερο. Τα παιδιά και την αγάπη που αξίζει σε κάθε ένα από αυτά. Αυτή την αγάπη κατά κύριο λόγο προσπαθούμε να μεταδώσουμε. Ο χορός είναι το μέσον. Το πιο σημαντικό είναι αυτό που μένει στην ψυχή τους.”

            Αγγελική Σβήγκα',
            'background' => $background,
        ]);

        new Portal($s, 5, 'xoros');

        Scholio::portalStudy($s, '', '', 'Κλασσικό Μπαλέτο (Σύστημα Vaganova)', '');
        Scholio::portalStudy($s, '', '', 'Σύγχρονος Χορός(Release-Limon-Graham)', '');
        Scholio::portalStudy($s, '', '', 'Ρυθμική Μουσικοκινητική Αγωγή Νηπίων - Orff & Dalcrose.', '');
        Scholio::portalStudy($s, '', '', 'Κάρακτερ - Φολκλορικοί χοροί', '');
        Scholio::portalStudy($s, '', '', '', '');
        Scholio::portalStudy($s, '', '', '', '');

 
        Scholio::portalSocial($s, 'facebook', 'http://www.facebook.com/svigka');
        Scholio::portalSocial($s, 'youtube', 'http://www.youtube.com/svigka');
        
    }
}
